<?
/* ============================================================================== */
/* =   PAGE : 공통 통보 PAGE                                                    = */
/* = -------------------------------------------------------------------------- = */
/* =   연동시 오류가 발생하는 경우 아래의 주소로 접속하셔서 확인하시기 바랍니다.= */
/* =   접속 주소 : http://kcp.co.kr/technique.requestcode.do                    = */
/* = -------------------------------------------------------------------------- = */
/* =   Copyright (c)  2016   NHN KCP Inc.   All Rights Reserverd.               = */
/* ============================================================================== */
?>
<?
/* ============================================================================== */
/* =   01. 공통 통보 페이지 설명(필독!!)                                        = */
/* = -------------------------------------------------------------------------- = */
/* =   공통 통보 페이지에서는,                                                  = */
/* =   가상계좌 입금 통보 데이터와 모바일안심결제 통보 데이터 등을 KCP를 통해   = */
/* =   실시간으로 통보 받을 수 있습니다.                                        = */
/* =                                                                            = */
/* =   common_return 페이지는 이러한 통보 데이터를 받기 위한 샘플 페이지        = */
/* =   입니다. 현재의 페이지를 업체에 맞게 수정하신 후, 아래 사항을 참고하셔서  = */
/* =   KCP 관리자 페이지에 등록해 주시기 바랍니다.                              = */
/* =                                                                            = */
/* =   등록 방법은 다음과 같습니다.                                             = */
/* =  - KCP 관리자페이지(admin.kcp.co.kr)에 로그인 합니다.                      = */
/* =  - [쇼핑몰 관리] -> [정보변경] -> [공통 URL 정보] -> [공통 URL 변경 후]에  = */
/* =    결과값은 전송받을 가맹점 URL을 입력합니다.                              = */
/* ============================================================================== */


/* ============================================================================== */
/* =   02. 공통 통보 데이터 받기                                                = */
/* = -------------------------------------------------------------------------- = */
$site_cd      = $_POST [ "site_cd"  ];                 // 사이트 코드
$tno          = $_POST [ "tno"      ];                 // KCP 거래번호
$order_no     = $_POST [ "order_no" ];                 // 주문번호
$tx_cd        = $_POST [ "tx_cd"    ];                 // 업무처리 구분 코드
$tx_tm        = $_POST [ "tx_tm"    ];                 // 업무처리 완료 시간
/* = -------------------------------------------------------------------------- = */
$ipgm_name    = "";                                    // 주문자명
$remitter     = "";                                    // 입금자명
$ipgm_mnyx    = "";                                    // 입금 금액
$bank_code    = "";                                    // 은행코드
$account      = "";                                    // 가상계좌 입금계좌번호
$op_cd        = "";                                    // 처리구분 코드
$noti_id      = "";                                    // 통보 아이디
/* = -------------------------------------------------------------------------- = */
$refund_nm    = "";                                    // 환불계좌주명
$refund_mny   = "";                                    // 환불금액
$bank_code    = "";                                    // 은행코드
/* = -------------------------------------------------------------------------- = */
$st_cd        = "";                                    // 구매확인 코드
$can_msg      = "";                                    // 구매취소 사유
/* = -------------------------------------------------------------------------- = */
$waybill_no   = "";                                    // 운송장 번호
$waybill_corp = "";                                    // 택배 업체명
/* = -------------------------------------------------------------------------- = */
$cash_a_no    = "";                                    // 현금영수증 승인번호
$cash_a_dt    = "";                                    // 현금영수증 승인시간
$cash_no      = "";                                    // 현금영수증 거래번호

/* = -------------------------------------------------------------------------- = */
/* =   02-1. 가상계좌 입금 통보 데이터 받기                                     = */
/* = -------------------------------------------------------------------------- = */
if ( $tx_cd == "TX00" )
{
    $ipgm_name = $_POST[ "ipgm_name" ];                // 주문자명
    $remitter  = $_POST[ "remitter"  ];                // 입금자명
    $ipgm_mnyx = $_POST[ "ipgm_mnyx" ];                // 입금 금액
    $bank_code = $_POST[ "bank_code" ];                // 은행코드
    $account   = $_POST[ "account"   ];                // 가상계좌 입금계좌번호
    $op_cd     = $_POST[ "op_cd"     ];                // 처리구분 코드
    $noti_id   = $_POST[ "noti_id"   ];                // 통보 아이디
    $cash_a_no = $_POST[ "cash_a_no" ];                // 현금영수증 승인번호
    $cash_a_dt = $_POST[ "cash_a_dt" ];                // 현금영수증 승인시간
    $cash_no   = $_POST[ "cash_no"   ];                // 현금영수증 거래번호
}

/* = -------------------------------------------------------------------------- = */
/* =   02-2. 가상계좌 환불 통보 데이터 받기                                     = */
/* = -------------------------------------------------------------------------- = */
else if ( $tx_cd == "TX01" )
{
    $refund_nm  = $_POST[ "refund_nm"  ];               // 환불계좌주명
    $refund_mny = $_POST[ "refund_mny" ];               // 환불금액
    $bank_code  = $_POST[ "bank_code"  ];               // 은행코드
}
/* = -------------------------------------------------------------------------- = */
/* =   02-3. 구매확인/구매취소 통보 데이터 받기                                  = */
/* = -------------------------------------------------------------------------- = */
else if ( $tx_cd == "TX02" )

    $st_cd = $_POST[ "st_cd" ];                         // 구매확인 코드

if ( $st_cd = "N"  )                                // 구매확인 상태가 구매취소인 경우
{
    $can_msg = $_POST[ "can_msg"   ];               // 구매취소 사유
}

/* = -------------------------------------------------------------------------- = */
/* =   02-4. 배송시작 통보 데이터 받기                                           = */
/* = -------------------------------------------------------------------------- = */
else if ( $tx_cd == "TX03" )
{

    $waybill_no   = $_POST[ "waybill_no"   ];           // 운송장 번호
    $waybill_corp = $_POST[ "waybill_corp" ];           // 택배 업체명
}

/* ============================================================================== */
/* =   03. 공통 통보 결과를 업체 자체적으로 DB 처리 작업하시는 부분입니다.      = */
/* = -------------------------------------------------------------------------- = */
/* =   통보 결과를 DB 작업 하는 과정에서 정상적으로 통보된 건에 대해 DB 작업에  = */
/* =   실패하여 DB update 가 완료되지 않은 경우, 결과를 재통보 받을 수 있는     = */
/* =   프로세스가 구성되어 있습니다.                                            = */
/* =                                                                            = */
/* =   * DB update가 정상적으로 완료된 경우                                     = */
/* =   하단의 [04. result 값 세팅 하기] 에서 result 값의 value값을 0000으로     = */
/* =   설정해 주시기 바랍니다.                                                  = */
/* =                                                                            = */
/* =   * DB update가 실패한 경우                                                = */
/* =   하단의 [04. result 값 세팅 하기] 에서 result 값의 value값을 0000이외의   = */
/* =   값으로 설정해 주시기 바랍니다.                                           = */
/* = -------------------------------------------------------------------------- = */

/* = -------------------------------------------------------------------------- = */
/* =   03-1. 가상계좌 입금 통보 데이터 DB 처리 작업 부분                        = */
/* = -------------------------------------------------------------------------- = */
if ( $tx_cd == "TX00" )
{
}
/* = -------------------------------------------------------------------------- = */
/* =   03-2. 가상계좌 환불 통보 데이터 DB 처리 작업 부분                        = */
/* = -------------------------------------------------------------------------- = */
else if ( $tx_cd == "TX01" )
{
}
/* = -------------------------------------------------------------------------- = */
/* =   03-3. 구매확인/구매취소 통보 데이터 DB 처리 작업 부분                    = */
/* = -------------------------------------------------------------------------- = */
else if ( $tx_cd == "TX02" )
{
}
/* = -------------------------------------------------------------------------- = */
/* =   03-4. 배송시작 통보 데이터 DB 처리 작업 부분                             = */
/* = -------------------------------------------------------------------------- = */
else if ( $tx_cd == "TX03" )
{
}
/* = -------------------------------------------------------------------------- = */
/* =   03-5. 정산보류 통보 데이터 DB 처리 작업 부분                             = */
/* = -------------------------------------------------------------------------- = */
else if ( $tx_cd == "TX04" )
{
}
/* = -------------------------------------------------------------------------- = */
/* =   03-6. 즉시취소 통보 데이터 DB 처리 작업 부분                             = */
/* = -------------------------------------------------------------------------- = */
else if ( $tx_cd == "TX05" )
{
}
/* = -------------------------------------------------------------------------- = */
/* =   03-7. 취소 통보 데이터 DB 처리 작업 부분                                 = */
/* = -------------------------------------------------------------------------- = */
else if ( $tx_cd == "TX06" )
{
}
/* = -------------------------------------------------------------------------- = */
/* =   03-8. 발급계좌해지 통보 데이터 DB 처리 작업 부분                         = */
/* = -------------------------------------------------------------------------- = */
else if ( $tx_cd == "TX07" )
{
}
/* = -------------------------------------------------------------------------- = */
/* =   03-9. 모바일안심결제 통보 데이터 DB 처리 작업 부분                       = */
/* = -------------------------------------------------------------------------- = */
else if ( $tx_cd == "TX08" )
{
}
/* ============================================================================== */


/* ============================================================================== */
/* =   04. result 값 세팅 하기                                                  = */
/* ============================================================================== */

$result = '9999';
log_message('DEBUG', "kcpBankNoti post START==================================== ");


$kakao = array();

$ipAddr = $_SERVER['REMOTE_ADDR'];

$this->order_m->kcp_noti_info_log($param['tno'], $param['order_no'], $param['tx_cd'], $param['ipgm_mnyx']);

//tx_cd = TX00(가상계좌 입금 통보) 인 경우
if ($param['tx_cd'] == 'TX00') {

    $OrderInfo = $this->order_m->get_pay_N_order_info_kcp($param['tno'], $param['order_no']);    //결제번호, 주문상세번호 가져오기
    if (isset($OrderInfo)) {

        if ($OrderInfo[0]['ORDER_REFER_PROC_STS_CD'] == 'OA02'){
            $paydata = $this->order_m->get_OrderPayinfo($OrderInfo[0]['ORDER_PAY_DTL_NO']);
            $Goods_info = $this->order_m->get_Orderinfo($OrderInfo[0]['ORDER_NO']);
            $pay_sum = $paydata['PAY_AMT'];
            $Gcount = count($OrderInfo);
            if($Gcount > 1){
                $num = $Gcount - 1;
                $goods_str = $Goods_info['GOODS_NM']." 외 ".$num."개";
            }else{
                $goods_str = $Goods_info['GOODS_NM'];
            }
            $kakao['SMS_MSG_GB_CD'         ] = 'KAKAO';
            $kakao['MSG'] = "[에타홈] 주문완료
 
주문이 완료 되었습니다.
배송이 시작되면 
다시 안내드릴게요^^

▶주문번호: ".$OrderInfo[0]['ORDER_NO']."
▶상품명: ".$goods_str."
▶주문금액: ".number_format($pay_sum)."원
* 주문금액은 쿠폰할인 및 
즉시 할인금액이 반영 되지 않은 상품 금액 입니다.

 ※ 발송 예정일은 
상품 재고 현황에 따라 
변경 될 수 있습니다.

※ 가구 등 설치가 필요하거나 
화물로 배송되는 상품의 경우
업체에서 연락드려 
배송일 협의가 진행됩니다.

※ 해외직구 상품의 배송기간은 
최대 1달 걸리니 상세페이지나 
고객센터(1522-5572)를 통해 
예정일을 확인해주세요!";
            $kakao['KAKAO_TEMPLATE_CODE'] = 'bizp_2019101813560816788648361';
            $kakao['KAKAO_SENDER_KEY'   ] = '1682e1e3f3186879142950762915a4109f2d04a2';
            if($Goods_info['SENDER_MOB_NO'] != '' || $Goods_info['SENDER_MOB_NO'] != null) {
                $kakao['DEST_PHONE'] = str_replace('-', '', $Goods_info['SENDER_MOB_NO']);
            }else{
                $kakao['DEST_PHONE'] = str_replace('-', '', $Goods_info['RECEIVER_MOB_NO']);
            }
            $kakao['KAKAO_ATTACHED_FILE'] = 'btn_mywiz_order.json';

            if($Goods_info['SENDER_NM']) {
                $this->order_m->send_sms_kakao($kakao);
            }
            //링크프라이스 주문건일시 실적전송.
            if($OrderInfo[0]['LPRICE_NO'] != null || $OrderInfo[0]['LPRICE_NO'] != ''){
                self::lprice($OrderInfo[0]['ORDER_NO']);
            }
        }

        foreach ($OrderInfo as $OrderRow) {
            if ($OrderRow['ORDER_REFER_PROC_STS_CD'] == 'OA02') {    //결제중(미입금)상태일때만 업데이트

                $upd_paydtl_state = $this->order_m->upd_order_pay_dtl_vbank_state_kcp($OrderRow['ORDER_PAY_DTL_NO']);    //결제상세 상태 업데이트
                $upd_pay_state = $this->order_m->upd_order_pay_state($OrderRow['PAY_NO']);        //결제 상태 업데이트
                $order_refer_progress_no = $this->order_m->set_order_refer_progress($OrderRow['ORDER_REFER_NO'], 'OA03'); //주문상태로그생성
                $upd_order_refer_state = $this->order_m->upd_order_refer_state($OrderRow['ORDER_REFER_NO'], $order_refer_progress_no);    //주문상태 업데이트
                $result = '0000';
            }
        }
    }
}
//}

log_message('DEBUG', "kcpBankNoti post result : ".$result."==================================== ");
log_message('DEBUG', "kcpBankNoti post END==================================== ");
//        return $this->response(array('result' => $result));

?>
<html><body><form><input type="hidden" name="result" value="<?=$result?>"></form></body></html>