<?
/* ============================================================================== */
/* =   KCP환경 설정 파일 Include                                                   = */
/* = -------------------------------------------------------------------------- = */
/* =   ※ 필수                                                                  = */
/* =   테스트 및 실결제 연동시 site_conf_inc.php파일을 수정하시기 바랍니다.     = */
/* = -------------------------------------------------------------------------- = */

include APPPATH ."/third_party/KCP/cfg/site_conf_inc.php";
//include APPPATH ."/third_party/KCP_ARS/cfg/site_conf_inc.php";

/* = -------------------------------------------------------------------------- = */
/* =   환경 설정 파일 Include END                                               = */
/* ============================================================================== */
?>

<link rel="stylesheet" href="/assets/css/cart_order.css">
<!------------------------------------------------->
<!-- 2017-04-20 비회원 구매시 동의 약관 보여주기 -->
<!------------------------------------------------->
<? if(!($this->session->userdata('EMS_U_ID_') != 'GUEST' && $this->session->userdata('EMS_U_ID_') != 'TMP_GUEST' && $this->session->userdata('EMS_U_ID_'))){	//비회원 주문시 동의	?>

    <script type="text/javascript">

        /** 체크박스 전체선택/해제	**/
        function jsChkAll(pBool){
            for (var i=0; i<document.getElementsByName("formAgree[]").length; i++){
                document.getElementsByName("formAgree[]")[i].checked = pBool;
            }
        }

        //===============================================================
        // 상품 주문하기
        //===============================================================
        function jsOrder(){

            if(document.getElementById("formNonMember0102").checked == false){
                alert("에타 웹사이트 이용약관에 동의해주세요.");
                return false;
            }

            if(document.getElementById("formNonMember0103").checked == false){
                alert("비회원 개인정보수집 및 이용에 대한 약관에 동의해주세요.");
                return false;
            }

            $('#agree_contents').hide();	//동의 창을 숨기고
            $('#order_contents').show();	//결제창을 보인다
        }

    </script>



    <div class="contents order_page" id="agree_contents">
        <h2 class="page_title">주문/결제</h2>
        <div class="myinfo">
            <div class="myinfo_greet">
                <span class="spr-cart icon_me"></span><em class="bold">비회원 주문 이용약관에 동의해주세요.</em>
            </div>
            <div class="step_block">
                <ul class="step_list">
                    <li class="step_item">
                        <span class="spr-cart icon_cart"></span>
                        <span class="step_text">01. 장바구니</span>
                        <span class="spr-cart arow_right"></span>
                    </li>
                    <li class="step_item active">
                        <span class="spr-cart icon_write"></span>
                        <span class="step_text">02. 주문/결제</span>
                        <span class="spr-cart arow_right"></span>
                    </li>
                    <li class="step_item">
                        <span class="spr-cart icon_complete"></span>
                        <span class="step_text">03. 결제완료</span>
                    </li>
                </ul>
            </div>
        </div>
        <div class="position_area">
            <h3 class="title_page">비회원 주문 이용약관</h3>
            <div class="checkbox_area position_right">
                <input type="checkbox" class="checkbox" id="formNonMember0101" onClick="javascript:jsChkAll(this.checked);"> <label class="checkbox_label" for="formNonMember0101">모든 이용약관에 동의합니다.</label>
            </div>
        </div>

        <ul class="order_use_clause">
            <li class="order_use_clause_item">
                <div class="order_use_clause_top position_area">
                    (주)에타 웹사이트 이용약관 (필수)
                    <div class="checkbox_area position_right">
                        <input type="checkbox" class="checkbox" id="formNonMember0102" name="formAgree[]"> <label class="checkbox_label" for="formNonMember0102">동의합니다.</label>
                    </div>
                </div>
                <div class="order_use_clause_content">
                    <ul class="use_clause_list">
                        <li>
                            <span class="title">제1조(목적)</span>
                            <p class="paragraph">이 약관은 (주)에타(전자상거래 사업자)가 운영하는 에타 사이버 몰(이하 “몰”이라 한다)에서 제공하는 인터넷 관련 서비스(이하 “서비스”라 한다)를 이용함에 있어 사이버 몰과 이용자의 권리․의무 및 책임사항을 규정함을 목적으로 합니다.</p>
                            <p class="paragraph"> ※「PC통신, 무선 등을 이용하는 전자상거래에 대해서도 그 성질에 반하지 않는 한 이 약관을 준용합니다.」</p>
                        </li>
                        <li>
                            <span class="title">제2조(정의)</span>
                            <ul>
                                <li>① “몰”이란 에타가 재화 또는 용역(이하 “재화 등”이라 함)을 이용자에게 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 재화 등을 거래할 수 있도록 설정한 가상의 영업장을 말하며, 아울러 사이버몰을 운영하는 사업자의 의미로도 사용합니다.</li>
                                <li>② “이용자”란 “몰”에 접속하여 이 약관에 따라 “몰”이 제공하는 서비스를 받는 회원 및 비회원을 말합니다.</li>
                                <li>③ ‘회원’이라 함은 “몰”에 회원등록을 한 자로서, 계속적으로 “몰”이 제공하는 서비스를 이용할 수 있는 자를 말합니다.</li>
                                <li>④ ‘비회원’이라 함은 회원에 가입하지 않고 “몰”이 제공하는 서비스를 이용하는 자를 말합니다.</li>
                                <li>⑤ ‘서비스’라 함은 다양한 정보의 제공 및 상품(재화와 용역 포함)의 판매 또는 상품과 관련한 다양한 판촉행위 및, 기타 부가 서비스를 말합니다.</li>
                                <li>⑥ ‘마일리지’라 함은 "몰"이 특정 재화 등을 구입한 이용자 또는 경품 등의 목적으로 이용자에게 부여한 사이버머니를 말하며, 적립금의 부여 및 사용 등과 관련한 사항은 이 약관 또는 "몰"의 운영정책이 정한 바에 따릅니다.</li>
                            </ul>
                        </li>


                        <li>
                            <span class="title">제3조 (약관 등의 명시와 설명 및 개정) </span>
                            <ul>
                                <li>① “몰”은 이 약관의 내용과 상호 및 대표자 성명, 영업소 소재지 주소(소비자의 불만을 처리할 수 있는 곳의 주소를 포함), 전화번호․모사전송번호․전자우편주소, 사업자등록번호, 통신판매업 신고번호, 개인정보관리책임자등을 이용자가 쉽게 알 수 있도록 에타 사이버몰의 서비스화면에 게시합니다. 다만, 약관의 내용은 이용자가 연결화면을 통하여 볼 수 있도록 할 수 있습니다.</li>
                                <li>② “몰”은 이용자가 약관에 동의하기에 앞서 약관에 정하여져 있는 내용 중 청약철회․배송책임․환불조건 등과 같은 중요한 내용을 이용자가 이해할 수 있도록 별도의 연결화면 또는 팝업화면 등을 제공하여 이용자의 확인을 구하여야 합니다.</li>
                                <li>③ “몰”은 「전자상거래 등에서의 소비자보호에 관한 법률」, 「약관의 규제에 관한 법률」, 「전자문서 및 전자거래기본법」, 「전자금융거래법」, 「전자서명법」, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」, 「방문판매 등에 관한 법률」, 「소비자기본법」 등 관련 법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.</li>
                                <li>④ “몰”이 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 몰의 초기화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 다만, 이용자에게 불리하게 약관내용을 변경하는 경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다. 이 경우 "몰“은 개정 전 내용과 개정 후 내용을 명확하게 비교하여 이용자가 알기 쉽도록 표시합니다. </li>
                                <li>⑤ “몰”이 약관을 개정할 경우에는 그 개정약관은 그 적용일자 이후에 체결되는 계약에만 적용되고 그 이전에 이미 체결된 계약에 대해서는 개정 전의 약관조항이 그대로 적용됩니다. 다만 이미 계약을 체결한 이용자가 개정약관 조항의 적용을 받기를 원하는 뜻을 제3항에 의한 개정약관의 공지기간 내에 “몰”에 송신하여 “몰”의 동의를 받은 경우에는 개정약관 조항이 적용됩니다.</li>
                                <li>⑥ 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제 등에 관한 법률, 공정거래위원회가 정하는 전자상거래 등에서의 소비자 보호지침 및 관계법령 또는 상관례에 따릅니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제4조(서비스의 제공 및 변경) </span>
                            <ul>
                                <li>① “몰”은 다음과 같은 업무를 수행합니다.
                                    <ul>
                                        <li>1. 재화 또는 용역에 대한 정보 제공 및 구매계약의 체결</li>
                                        <li>2. 구매계약이 체결된 재화 또는 용역의 배송</li>
                                        <li>3. 기타 “몰”이 정하는 업무</li>
                                    </ul>
                                </li>

                                <li>② “몰”은 재화 또는 용역의 품절 또는 기술적 사양의 변경 등의 경우에는 장차 체결되는 계약에 의해 제공할 재화 또는 용역의 내용을 변경할 수 있습니다. 이 경우에는 변경된 재화 또는 용역의 내용 및 제공일자를 명시하여 현재의 재화 또는 용역의 내용을 게시한 곳에 즉시 공지합니다.</li>

                                <li>③ “몰”이 제공하기로 이용자와 계약을 체결한 서비스의 내용을 재화 등의 품절 또는 기술적 사양의 변경 등의 사유로 변경할 경우에는 그 사유를 이용자에게 통지 가능한 주소로 즉시 통지합니다.</li>

                                <li>④ 전항의 경우 “몰”은 이로 인하여 이용자가 입은 손해를 배상합니다. 다만, “몰”이 고의 또는 과실이 없음을 입증하는 경우에는 그러하지 아니합니다.</li>

                                <li>⑤ “몰”은 무료로 제공되는 "서비스"의 일부 또는 전부를 회사의 정책 및 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에 대하여 관련법에 특별한 규정이 없는 한 "회원"에게 별도의 보상을 하지 않습니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제5조(서비스의 중단) </span>
                            <ul>
                                <li>① “몰”은 컴퓨터 등 정보통신설비의 보수점검․교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.</li>
                                <li>② “몰”은 제1항의 사유로 서비스의 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에 대하여 배상합니다. 단, “몰”이 고의 또는 과실이 없음을 입증하는 경우에는 그러하지 아니합니다.</li>
                                <li>③ 사업종목의 전환, 사업의 포기, 업체 간의 통합 등의 이유로 서비스를 제공할 수 없게 되는 경우에는 “몰”은 제8조에 정한 방법으로 이용자에게 통지하고 당초 “몰”에서 제시한 조건에 따라 소비자에게 보상합니다. 다만, “몰”이 보상기준 등을 고지하지 아니한 경우에는 이용자들의 마일리지 또는 적립금 등을 “몰”에서 통용되는 통화가치에 상응하는 현물 또는 현금으로 이용자에게 지급합니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제6조(회원가입) </span>
                            <ul>
                                <li>① 이용자는 “몰”이 정한 가입 양식에 따라 회원정보를 기입한 후 이 약관에 동의한다는 의사표시를 함으로서 회원가입을 신청합니다.</li>
                                <li>② “몰”은 제1항과 같이 회원으로 가입할 것을 신청한 이용자 중 다음 각 호에 해당하지 않는 한 회원으로 등록합니다.
                                    <ul>
                                        <li>1. 가입신청자가 이 약관 제7조제3항에 의하여 이전에 회원자격을 상실한 적이 있는 경우, 다만 제7조제3항에 의한 회원자격 상실 후 3년이 경과한 자로서 “몰”의 회원재가입 승낙을 얻은 경우에는 예외로 한다.</li>
                                        <li>2. 등록 내용에 허위, 기재누락, 오기가 있는 경우</li>
                                        <li>3. 기타 회원으로 등록하는 것이 “몰”의 기술상 현저히 지장이 있다고 판단되는 경우</li>
                                    </ul>
                                </li>
                                <li>③ 회원가입계약의 성립 시기는 “몰”의 승낙이 회원에게 도달한 시점으로 합니다.</li>
                                <li>④ 회원은 회원가입 시 등록한 사항에 변경이 있는 경우, 상당한 기간 이내에 “몰”에 대하여 회원정보 수정 등의 방법으로 그 변경사항을 알려야 합니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제7조(회원 탈퇴 및 자격 상실 등) </span>
                            <ul>
                                <li>① 회원은 “몰”에 언제든지 탈퇴를 요청할 수 있으며 “몰”은 즉시 회원탈퇴를 처리합니다.</li>
                                <li>② 회원이 다음 각 호의 사유에 해당하는 경우, “몰”은 회원자격을 제한 및 정지시킬 수 있습니다.
                                    <ul>
                                        <li>1. 가입 신청 시에 허위 내용을 등록한 경우</li>
                                        <li>2. “몰”을 이용하여 구입한 재화 등의 대금, 기타 “몰”이용에 관련하여 회원이 부담하는 채무를 기일에 지급하지 않는 경우</li>
                                        <li>3. 다른 사람의 “몰” 이용을 방해하거나 그 정보를 도용하는 등 전자상거래 질서를 위협하는 경우</li>
                                        <li>4. “몰”을 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우</li>
                                    </ul>
                                </li>
                                <li>③ “몰”이 회원 자격을 제한․정지 시킨 후, 동일한 행위가 2회 이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우 “몰”은 회원자격을 상실시킬 수 있습니다.</li>
                                <li>④ “몰”이 회원자격을 상실시키는 경우에는 회원등록을 말소합니다. 이 경우 회원에게 이를 통지하고, 회원등록 말소 전에 최소한 30일 이상의 기간을 정하여 소명할 기회를 부여합니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제8조(회원에 대한 통지)</span>
                            <ul>
                                <li>① “몰”이 회원에 대한 통지를 하는 경우, 회원이 “몰”과 미리 약정하여 지정한 전자우편 주소로 할 수 있습니다.</li>
                                <li>② “몰”은 불특정다수 회원에 대한 통지의 경우 1주일이상 “몰” 게시판에 게시함으로서 개별 통지에 갈음할 수 있습니다. 다만, 회원 본인의 거래와 관련하여 중대한 영향을 미치는 사항에 대하여는 개별통지를 합니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제9조(구매신청 및 개인정보 제공 동의 등) </span>
                            <ul>
                                <li>① “몰”이용자는 “몰”상에서 다음 또는 이와 유사한 방법에 의하여 구매를 신청하며, “몰”은 이용자가 구매신청을 함에 있어서 다음의 각 내용을 알기 쉽게 제공하여야 합니다.
                                    <ul>
                                        <li>1. 재화 등의 검색 및 선택</li>
                                        <li>2. 받는 사람의 성명, 주소, 전화번호, 전자우편주소(또는 이동전화번호) 등의 입력</li>
                                        <li>3. 약관내용, 청약철회권이 제한되는 서비스, 배송료․설치비 등의 비용부담과 관련한 내용에 대한 확인</li>
                                        <li>4. 이 약관에 동의하고 위 3.호의 사항을 확인하거나 거부하는 표시 (예, 마우스 클릭)</li>
                                        <li>5. 재화 등의 구매신청 및 이에 관한 확인 또는 “몰”의 확인에 대한 동의</li>
                                        <li>6. 결제방법의 선택</li>
                                    </ul>
                                </li>
                                <li>② “몰”이 제3자에게 구매자 개인정보를 제공할 필요가 있는 경우 1) 개인정보를 제공받는 자, 2)개인정보를 제공받는 자의 개인정보 이용목적, 3) 제공하는 개인정보의 항목, 4) 개인정보를 제공받는 자의 개인정보 보유 및 이용기간을 구매자에게 알리고 동의를 받아야 합니다. (동의를 받은 사항이 변경되는 경우에도 같습니다.)</li>
                                <li>③ “몰”이 제3자에게 구매자의 개인정보를 취급할 수 있도록 업무를 위탁하는 경우에는 1) 개인정보 취급위탁을 받는 자, 2) 개인정보 취급위탁을 하는 업무의 내용을 구매자에게 알리고 동의를 받아야 합니다. (동의를 받은 사항이 변경되는 경우에도 같습니다.) 다만, 서비스제공에 관한 계약이행을 위해 필요하고 구매자의 편의증진과 관련된 경우에는 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」에서 정하고 있는 방법으로 개인정보
                                    취급방침을 통해 알림으로써 고지절차와 동의절차를 거치지 않아도 됩니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제10조 (계약의 성립)</span>
                            <ul>
                                <li>① “몰”은 제9조와 같은 구매신청에 대하여 다음 각 호에 해당하면 승낙하지 않을 수 있습니다. 다만, 미성년자와 계약을 체결하는 경우에는 법정대리인의 동의를 얻지 못하면 미성년자 본인 또는 법정대리인이 계약을 취소할 수 있다는 내용을 고지하여야 합니다.
                                    <ul>
                                        <li>1. 신청 내용에 허위, 기재누락, 오기가 있는 경우</li>
                                        <li>2. 미성년자가 담배, 주류 등 청소년보호법에서 금지하는 재화 및 용역을 구매하는 경우</li>
                                        <li>3. 기타 구매신청에 승낙하는 것이 “몰” 기술상 현저히 지장이 있다고 판단하는 경우</li>
                                    </ul>
                                </li>
                                <li>② “몰”의 승낙이 제12조제1항의 수신확인통지형태로 이용자에게 도달한 시점에 계약이 성립한 것으로 봅니다.</li>
                                <li>③ “몰”의 승낙의 의사표시에는 이용자의 구매 신청에 대한 확인 및 판매가능 여부, 구매신청의 정정 취소 등에 관한 정보 등을 포함하여야 합니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제11조(지급방법)</span>
                            <p class="paragraph">“몰”에서 구매한 재화 또는 용역에 대한 대금지급방법은 다음 각 호의 방법 중 가용한 방법으로 할 수 있습니다. 단, “몰”은 이용자의 지급방법에 대하여 재화 등의 대금에 어떠한 명목의 수수료도 추가하여 징수할 수 없습니다.</p>
                            <ul>
                                <li>1. 폰뱅킹, 인터넷뱅킹, 메일 뱅킹 등의 각종 계좌이체</li>
                                <li>2. 선불카드, 직불카드, 신용카드 등의 각종 카드 결제</li>
                                <li>3. 온라인무통장입금</li>
                                <li>4. 전자화폐에 의한 결제</li>
                                <li>5. 수령 시 대금지급</li>
                                <li>6. 마일리지 등 “몰”이 지급한 포인트에 의한 결제
                                <li>7. “몰”과 계약을 맺었거나 “몰”이 인정한 상품권에 의한 결제</li>
                                <li>8. 기타 전자적 지급 방법에 의한 대금 지급 등</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제12조(수신확인통지․구매신청 변경 및 취소)</span>
                            <p class="paragraph">“몰”에서 구매한 재화 또는 용역에 대한 대금지급방법은 다음 각 호의 방법 중 가용한 방법으로 할 수 있습니다. 단, “몰”은 이용자의 지급방법에 대하여 재화 등의 대금에 어떠한 명목의 수수료도 추가하여 징수할 수 없습니다.</p>
                            <ul>
                                <li>① “몰”은 이용자의 구매신청이 있는 경우 이용자에게 수신확인통지를 합니다.</li>
                                <li>② 수신확인통지를 받은 이용자는 의사표시의 불일치 등이 있는 경우에는 수신확인통지를 받은 후 즉시 구매신청 변경 및 취소를 요청할 수 있고 “몰”은 배송 전에 이용자의 요청이 있는 경우에는 지체 없이 그 요청에 따라 처리하여야 합니다. 다만 이미 대금을 지불한 경우에는 제15조의 청약철회 등에 관한 규정에 따릅니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제13조(재화 등의 공급)</span>
                            <ul>
                                <li>① “몰”은 이용자와 재화 등의 공급시기에 관하여 별도의 약정이 없는 이상, 이용자가 청약을 한 날부터 7일 이내에 재화 등을 배송할 수 있도록 주문제작, 포장 등 기타의 필요한 조치를 취합니다. 다만, “몰”이 이미 재화 등의 대금의 전부 또는 일부를 받은 경우에는 대금의 전부 또는 일부를 받은 날부터 3영업일 이내에 조치를 취합니다. 이때 “몰”은 이용자가 재화 등의 공급 절차 및 진행 사항을 확인할 수 있도록 적절한 조치를
                                    합니다.</li>
                                <li>② “몰”은 이용자가 구매한 재화에 대해 배송수단, 수단별 배송비용 부담자, 수단별 배송기간 등을 명시합니다. 만약 “몰”이 약정 배송기간을 초과한 경우에는 그로 인한 이용자의 손해를 배상하여야 합니다. 다만 “몰”이 고의․과실이 없음을 입증한 경우에는 그러하지 아니합니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제14조(환급)</span>
                            <p class="paragraph">“몰”은 이용자가 구매신청한 재화 등이 품절 등의 사유로 인도 또는 제공을 할 수 없을 때에는 지체 없이 그 사유를 이용자에게 통지하고 사전에 재화 등의 대금을 받은 경우에는 대금을 받은 날부터 3영업일 이내에 환급하거나 환급에 필요한 조치를 취합니다.</p>
                        </li>

                        <li>
                            <span class="title">제15조(청약철회 등)</span>
                            <ul>
                                <li>① “몰”과 재화등의 구매에 관한 계약을 체결한 이용자는 「전자상거래 등에서의 소비자보호에 관한 법률」 제13조 제2항에 따른 계약내용에 관한 서면을 받은 날(그 서면을 받은 때보다 재화 등의 공급이 늦게 이루어진 경우에는 재화 등을 공급받거나 재화 등의 공급이 시작된 날을 말합니다)부터 7일 이내에는 청약의 철회를 할 수 있습니다. 다만, 청약철회에 관하여 「전자상거래 등에서의 소비자보호에 관한 법률」에 달리 정함이 있는 경우에는
                                    동 법 규정에 따릅니다. </li>
                                <li>② 이용자는 재화 등을 배송 받은 경우 다음 각 호의 1에 해당하는 경우에는 반품 및 교환을 할 수 없습니다.
                                    <ul>
                                        <li>1. 이용자에게 책임 있는 사유로 재화 등이 멸실 또는 훼손된 경우(다만, 재화 등의 내용을 확인하기 위하여 포장 등을 훼손한 경우에는 청약철회를 할 수 있습니다)</li>
                                        <li>2. 이용자의 사용 또는 일부 소비에 의하여 재화 등의 가치가 현저히 감소한 경우</li>
                                        <li>3. 시간의 경과에 의하여 재판매가 곤란할 정도로 재화등의 가치가 현저히 감소한 경우</li>
                                        <li>4. 같은 성능을 지닌 재화 등으로 복제가 가능한 경우 그 원본인 재화 등의 포장을 훼손한 경우</li>
                                    </ul>
                                </li>
                                <li>③ 제2항제2호 내지 제4호의 경우에 “몰”이 사전에 청약철회 등이 제한되는 사실을 소비자가 쉽게 알 수 있는 곳에 명기하거나 시용상품을 제공하는 등의 조치를 하지 않았다면 이용자의 청약철회 등이 제한되지 않습니다.</li>
                                <li>④ 이용자는 제1항 및 제2항의 규정에 불구하고 재화 등의 내용이 표시·광고 내용과 다르거나 계약내용과 다르게 이행된 때에는 당해 재화 등을 공급받은 날부터 3월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 청약철회 등을 할 수 있습니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제16조(청약철회 등의 효과)</span>
                            <ul>
                                <li>① “몰”은 이용자로부터 재화 등을 반환받은 경우 3영업일 이내에 이미 지급받은 재화 등의 대금을 환급합니다. 이 경우 “몰”이 이용자에게 재화 등의 환급을 지연한때에는 그 지연기간에 대하여 「전자상거래 등에서의 소비자보호에 관한 법률 시행령」제21조의2에서 정하는 지연이자율을 곱하여 산정한 지연이자를 지급합니다.</li>
                                <li>② “몰”은 위 대금을 환급함에 있어서 이용자가 신용카드 또는 전자화폐 등의 결제수단으로 재화 등의 대금을 지급한 때에는 지체 없이 당해 결제수단을 제공한 사업자로 하여금 재화 등의 대금의 청구를 정지 또는 취소하도록 요청합니다.</li>
                                <li>③ 청약철회 등의 경우 공급받은 재화 등의 반환에 필요한 비용은 이용자가 부담합니다. “몰”은 이용자에게 청약철회 등을 이유로 위약금 또는 손해배상을 청구하지 않습니다. 다만 재화 등의 내용이 표시·광고 내용과 다르거나 계약내용과 다르게 이행되어 청약철회 등을 하는 경우 재화 등의 반환에 필요한 비용은 “몰”이 부담합니다.</li>
                                <li>④ 이용자가 재화 등을 제공받을 때 발송비를 부담한 경우에 “몰”은 청약철회 시 그 비용을 누가 부담하는지를 이용자가 알기 쉽도록 명확하게 표시합니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제17조(마일리지)</span>
                            <ul>
                                <li>① "몰"은 재화 등을 구입하거나 특정 결제 수단으로 구입하는 이용자에게 또는 경품 등의 목적으로 이용자에게 마일리지를 부여할 수 있습니다. 마일리지의 적립 및 사용 등과 관련한 사항은 이 약관 또는 "몰"의 운영정책이 정한 바에 따릅니다.</li>
                                <li>② 1마일리지는 1원의 의미가 있으며, "몰" 및 회사가 운영하는 다른 서비스에서 재화 등 구매 시 현금가액과 동일하게 1,000원 단위로 마일리지를 사용할 수 있습니다 (단, 마일리지 사용이 불가하다고 사전 고지한 품목은 제외됩니다). 타인에게 양도하거나 현금으로 교환할 수 없으며, 부정한 목적이나 용도로 사용할 수 없습니다. </li>
                                <li>③ 상품구매 후 취소 또는 반품을 할 경우에는 상품 구매 시 “몰”이 부여한 마일리지를 회수합니다.</li>
                                <li>④ 마일리지 유효기간은 적립일로부터 24개월이며 유효기간이 경과된 마일리지는 자동 소멸됩니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제18조(할인쿠폰)</span>
                            <ul>
                                <li>① “몰” 또는 판매자는 구매서비스를 이용하는 회원에게 상품 구매 시 일정금액 또는 일정비율을 할인 받을 수 있는 할인 쿠폰을 발급할 수 있습니다.</li>
                                <li>② 할인 쿠폰은 회원 본인의 구매에만 사용할 수 있으며, 어떠한 경우에도 타인에게 매매하거나 양도할 수 없습니다.</li>
                                <li>③ 할인 쿠폰은 일부 품목이나 금액에 따라 사용이 제한될 수 있으며 유효기간이 지난 후에는 사용할 수 없고, 상품구매 후 취소나 반품으로 환불이 이루어졌을 때에는 재사용을 할 수 없습니다.</li>
                                <li>④ 구매자에게 제공된 할인 쿠폰은 한 상품 구매 때 중복으로 사용할 수 없습니다. 단, 할인 쿠폰의 발행자가 서로 다르면 중복으로 사용할 수도 있습니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제19조(개인정보보호)</span>
                            <ul>
                                <li>① “몰”은 이용자의 개인정보 수집시 서비스제공을 위하여 필요한 범위에서 최소한의 개인정보를 수집합니다. </li>
                                <li>② “몰”은 회원가입시 구매계약이행에 필요한 정보를 미리 수집하지 않습니다. 다만, 관련 법령상 의무이행을 위하여 구매계약 이전에 본인확인이 필요한 경우로서 최소한의 특정 개인정보를 수집하는 경우에는 그러하지 아니합니다.</li>
                                <li>③ “몰”은 이용자의 개인정보를 수집·이용하는 때에는 당해 이용자에게 그 목적을 고지하고 동의를 받습니다. </li>
                                <li>④ “몰”은 수집된 개인정보를 목적 외의 용도로 이용할 수 없으며, 새로운 이용목적이 발생한 경우 또는 제3자에게 제공하는 경우에는 이용·제공단계에서 당해 이용자에게 그 목적을 고지하고 동의를 받습니다. 다만, 관련 법령에 달리 정함이 있는 경우에는 예외로 합니다.</li>
                                <li>⑤ “몰”이 제2항과 제3항에 의해 이용자의 동의를 받아야 하는 경우에는 개인정보관리 책임자의 신원(소속, 성명 및 전화번호, 기타 연락처), 정보의 수집목적 및 이용목적, 제3자에 대한 정보제공 관련사항(제공받은자, 제공목적 및 제공할 정보의 내용) 등 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 제22조제2항이 규정한 사항을 미리 명시하거나 고지해야 하며 이용자는 언제든지 이 동의를 철회할 수 있습니다.</li>
                                <li>⑥ 이용자는 언제든지 “몰”이 가지고 있는 자신의 개인정보에 대해 열람 및 오류정정을 요구할 수 있으며 “몰”은 이에 대해 지체 없이 필요한 조치를 취할 의무를 집니다. 이용자가 오류의 정정을 요구한 경우에는 “몰”은 그 오류를 정정할 때까지 당해 개인정보를 이용하지 않습니다.</li>
                                <li>⑦ “몰”은 개인정보 보호를 위하여 이용자의 개인정보를 취급하는 자를 최소한으로 제한하여야 하며 신용카드, 은행계좌 등을 포함한 이용자의 개인정보의 분실, 도난, 유출, 동의 없는 제3자 제공, 변조 등으로 인한 이용자의 손해에 대하여 모든 책임을 집니다.</li>
                                <li>⑧ “몰” 또는 그로부터 개인정보를 제공받은 제3자는 개인정보의 수집목적 또는 제공받은 목적을 달성한 때에는 당해 개인정보를 지체 없이 파기합니다.</li>
                                <li>⑨ “몰”은 개인정보의 수집·이용·제공에 관한 동의 란을 미리 선택한 것으로 설정해두지 않습니다. 또한 개인정보의 수집·이용·제공에 관한 이용자의 동의거절시 제한되는 서비스를 구체적으로 명시하고, 필수수집항목이 아닌 개인정보의 수집·이용·제공에 관한 이용자의 동의 거절을 이유로 회원가입 등 서비스 제공을 제한하거나 거절하지 않습니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제20조(“몰“의 의무)</span>
                            <ul>
                                <li>① “몰”은 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 재화․용역을 제공하는데 최선을 다하여야 합니다.</li>
                                <li>② “몰”은 이용자가 안전하게 인터넷 서비스를 이용할 수 있도록 이용자의 개인정보(신용정보 포함)보호를 위한 보안 시스템을 갖추어야 합니다.</li>
                                <li>③ “몰”이 상품이나 용역에 대하여 「표시․광고의 공정화에 관한 법률」 제3조 소정의 부당한 표시․광고행위를 함으로써 이용자가 손해를 입은 때에는 이를 배상할 책임을 집니다.</li>
                                <li>④ “몰”은 이용자가 원하지 않는 영리목적의 광고성 전자우편을 발송하지 않습니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제21조(회원의 ID 및 비밀번호에 대한 의무)</span>
                            <ul>
                                <li>① 제17조의 경우를 제외한 ID와 비밀번호에 관한 관리책임은 회원에게 있습니다.</li>
                                <li>② 회원은 자신의 ID 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.</li>
                                <li>③ 회원이 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 “몰”에 통보하고 “몰”의 안내가 있는 경우에는 그에 따라야 합니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제22조(이용자의 의무) </span>
                            <p class="paragraph">이용자는 다음 행위를 하여서는 안 됩니다.</p>
                            <ul>
                                <li>1. 신청 또는 변경시 허위 내용의 등록</li>
                                <li>2. 타인의 정보 도용</li>
                                <li>3. “몰”에 게시된 정보의 변경</li>
                                <li>4. “몰”이 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시</li>
                                <li>5. “몰” 기타 제3자의 저작권 등 지적재산권에 대한 침해</li>
                                <li>6. “몰” 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위</li>
                                <li>7. 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 몰에 공개 또는 게시하는 행위</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제23조(연결“몰”과 피연결“몰” 간의 관계)</span>
                            <ul>
                                <li>① 상위 “몰”과 하위 “몰”이 하이퍼링크(예: 하이퍼링크의 대상에는 문자, 그림 및 동화상 등이 포함됨)방식 등으로 연결된 경우, 전자를 연결 “몰”(웹사이트)이라고 하고 후자를 피연결 “몰”(웹사이트)이라고 합니다.</li>
                                <li>② 연결“몰”은 피연결“몰”이 독자적으로 제공하는 재화 등에 의하여 이용자와 행하는 거래에 대해서 보증 책임을 지지 않는다는 뜻을 연결“몰”의 초기화면 또는 연결되는 시점의 팝업화면으로 명시한 경우에는 그 거래에 대한 보증 책임을 지지 않습니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제24조(저작권의 귀속 및 이용제한)</span>
                            <ul>
                                <li>① “몰“이 작성한 저작물에 대한 저작권 기타 지적재산권은 ”몰“에 귀속합니다.</li>
                                <li>② 이용자는 “몰”을 이용함으로써 얻은 정보 중 “몰”에게 지적재산권이 귀속된 정보를 “몰”의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.</li>
                                <li>③ “몰”은 약정에 따라 이용자에게 귀속된 저작권을 사용하는 경우 당해 이용자에게 통보하여야 합니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제25조(분쟁해결)</span>
                            <ul>
                                <li>① “몰”은 이용자가 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 보상처리하기 위하여 피해보상처리기구를 설치․운영합니다.</li>
                                <li>② “몰”은 이용자로부터 제출되는 불만사항 및 의견은 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와 처리일정을 즉시 통보해 드립니다.</li>
                                <li>③ “몰”과 이용자 간에 발생한 전자상거래 분쟁과 관련하여 이용자의 피해구제신청이 있는 경우에는 공정거래위원회 또는 시·도지사가 의뢰하는 분쟁조정기관의 조정에 따를 수 있습니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">제26조(재판권 및 준거법)</span>
                            <ul>
                                <li>① “몰”과 이용자 간에 발생한 전자상거래 분쟁에 관한 소송은 “몰”의 본사 소재지를 관할하는 법원을 합의관할법원으로 정합니다.</li>
                                <li>② “몰”과 이용자 간에 제기된 전자상거래 소송에는 한국법을 적용합니다.</li>
                            </ul>
                        </li>

                        <li>
                            부 칙(시행일) 이 약관은 2016년 7월 4일부터 시행합니다.
                        </li>
                    </ul>
                </div>
            </li>
            <li class="order_use_clause_item">
                <div class="order_use_clause_top position_area">
                    비회원 개인정보수집 및 이용에 대한 동의 (필수)
                    <div class="checkbox_area position_right">
                        <input type="checkbox" class="checkbox" id="formNonMember0103" name="formAgree[]"> <label class="checkbox_label" for="formNonMember0103">동의합니다.</label>
                    </div>
                </div>
                <div class="order_use_clause_content">
                    <ul class="use_clause_list">
                        <li>
                            <p class="paragraph">주식회사 에타(이하 '에타')는 개인정보보호법에 따라 이용자의 개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다. 회사는 개인정보처리방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다.</p>
                        </li>
                        <li>
                            <span class="title">1. 개인정보의 처리 목적</span>
                            <p class="paragraph">에타는 개인정보를 다음의 목적을 위해 처리합니다. 처리한 개인정보는 다음의 목적 이외의 용도로는 사용되지 않으며 이용 목적이 변경될 시에는 사전동의를 구할 예정입니다.</p>
                            <ul>
                                <li>가. 홈페이지 회원가입 및 관리<br /> 회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 제한적 본인확인제 시행에 따른 본인확인, 서비스 부정이용 방지, 만14세 미만 아동 개인정보 수집 시 법정대리인 동의 여부 확인, 각종 고지·통지, 고충처리, 분쟁 조정을 위한 기록 보존 등을 목적으로 개인정보를 처리합니다.</li>
                                <li>나. 재화 또는 서비스 제공<br /> 물품배송, 서비스 제공, 청구서 발송, 콘텐츠 제공, 맞춤 서비스 제공, 본인인증, 연령인증, 요금결제·정산, 채권추심, 부정거래 방지 등을 목적으로 개인정보를 처리합니다.</li>
                                <li>다. 마케팅 및 광고에의 활용<br /> 신규 서비스(제품) 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회 제공, 인구통계학적 특성에 따른 서비스 제공 및 광고 게재, 서비스의 유효성 확인, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.</li>
                            </ul>
                        </li>
                        <li>
                            <span class="title">2. 개인정보 수집 및 보유</span>
                            <ul>
                                <li>가. 에타는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집시에 동의 받은 개인정보 보유, 이용기간 내에서 개인정보를 처리, 보유합니다.</li>
                                <li>나. 각각의 개인정보 수집항목, 처리 및 보유 기간은 다음과 같습니다.</li>
                            </ul>

                            <div class="table_basic_type">
                                <table>
                                    <caption>약관동의 정보 표</caption>
                                    <colgroup>
                                        <col style="width:101px;" />
                                        <col style="width:160px;" />
                                        <col style="width:160px;" />
                                        <col style="width:160px;" />
                                        <col style="width:178px;" />
                                        <col />
                                    </colgroup>
                                    <thead>
                                    <tr>
                                        <th scope="col">구분</th>
                                        <th scope="col">항목</th>
                                        <th scope="col">수집방법</th>
                                        <th scope="col">보유근거</th>
                                        <th scope="col">보유기간</th>
                                        <th scope="col">비고</th>
                                    </tr>
                                    </thead>
                                    <tbody>
                                    <tr>
                                        <td>필수</td>
                                        <td>이메일, 휴대전화번호, 비밀번호 질문과 답, 비밀번호, 로그인ID, 생년월일, 이름, 서비스 이용 기록, 접속 로그, 쿠키, 접속 IP 정보</td>
                                        <td>사이트 회원가입 절차, 이벤트나 경품 행사, 서비스 이용 과정이나 사업 처리 과정 등</td>
                                        <td>서비스 이용자 식별, 만 14세 미만 아동 여부 확인, 서비스 이용에 따른 민원사항의 처리, 부정거래 방지</td>
                                        <td>6개월</td>
                                        <td>부정거래를 배제하기 위한 회사방침</td>
                                    </tr>
                                    <tr>
                                        <td>필수<br />(상품구매 등 서비스 이용 시 필수적인 정보)</td>
                                        <td>신용카드정보, 은행계좌정보, 결제기록, 배송지주소, 배송지 연락처, 수취인 정보</td>
                                        <td>사이트에서 상품/서비스 구매 시 입력</td>
                                        <td>상품 및 경품 배송(반품/환불), 배송지 및 연락처 확인, 부정거래 방지</td>
                                        <td>대금결제 및 재화 등의 공급에 관한 기록 : 5년<br />계약 또는 청약철회 등에 관한 기록 : 5년<br />소비자의 불만 또는 분쟁처리에 관한 기록 : 3년</td>
                                        <td>전자상거래등 에서의 소비자보호에 관한 법률</td>
                                    </tr>
                                    <tr>
                                        <td>선택</td>
                                        <td>성별, 기념일, 결혼여부, 취미</td>
                                        <td>사이트 회원가입 절차, 이벤트나 경품 행사 등</td>
                                        <td>마케팅 및 개인맞춤 서비스 제공</td>
                                        <td>회원 탈퇴 시 즉시 삭제</td>
                                        <td>&nbsp;</td>
                                    </tr>
                                    </tbody>
                                </table>
                            </div>
                            <ul>
                                <li>다. 에타는 법정 대리인의 동의가 필요한 만14세 미만 아동의 회원가입은 받고 있지 않습니다.</li>
                                <li>라. 에타는 비회원 주문의 경우에도 아래와 같이 배송, 대금결제, 주문내역 조회 및 구매확인, 실명여부 확인을 위하여 필요한 개인정보만을 요청하고 있으며, 이 경우 그 정보는 대금결제 및 상품의 배송에 관련된 용도 이외에는 다른 어떠한 용도로도 사용되지 않습니다. 에타는 비회원의 개인정보도 회원과 동등한 수준으로 보호합니다.</li>
                            </ul>
                            <div class="table_basic_type">
                                <table>
                                    <caption>약관동의 정보 표</caption>
                                    <colgroup>
                                        <col style="width:305px;" />
                                        <col style="width:305px;" />
                                        <col />
                                    </colgroup>
                                    <thead>
                                    <tr>
                                        <th scope="col">목적</th>
                                        <th scope="col">항목</th>
                                        <th scope="col">보유 및 이용기간</th>
                                    </tr>
                                    </thead>
                                    <tbody>
                                    <tr>
                                        <td>상품 배송 및 서비스 제공을 위한 사용자 정보 확인</td>
                                        <td>배송의뢰인 및 수령인의 성명, 전화번호, 휴대폰번호, 주소, 이메일주소</td>
                                        <td>5년 보관 (전자상거래 등에서의 소비자보호에 관한 법률)</td>
                                    </tr>
                                    <tr>
                                        <td>상품 구매에 대한 대금결제 및 취소</td>
                                        <td>신용카드정보, 은행계좌정보, 휴대폰가입정보</td>
                                        <td>5년 보관 (전자상거래 등에서의 소비자보호에 관한 법률)</td>
                                    </tr>
                                    </tbody>
                                </table>
                            </div>
                        </li>

                        <li>
                            <span class="title">3. 개인정보의 제3자 제공에 관한 사항</span>
                            <ul>
                                <li>가. 에타는 정보주체의 동의, 법률의 특별한 규정 등 개인정보 보호법 제17조 및 제18조에 해당하는 경우에만 개인정보를 제3자에게 제공합니다.</li>
                                <li>나. 에타는 다음과 같이 개인정보를 제3자에게 제공하고 있습니다. </li>
                            </ul>

                            <div class="table_basic_type">
                                <table>
                                    <caption>약관동의 정보 표</caption>
                                    <colgroup>
                                        <col style="width:230px;" />
                                        <col style="width:230px;" />
                                        <col style="width:230px;" />
                                        <col />
                                    </colgroup>
                                    <thead>
                                    <tr>
                                        <th scope="col">제공받는 자</th>
                                        <th scope="col">항목</th>
                                        <th scope="col">이용목적</th>
                                        <th scope="col">보유 및 이용기간</th>
                                    </tr>
                                    </thead>
                                    <tbody>
                                    <tr>
                                        <td>판매자</td>
                                        <td>1)구매자정보(구매자id,구매자명, 구매자전화번호, 구매자휴대폰번호)<br />2)상품 구매, 취소, 반품, 교환정보<br />3)수령인정보(수령인명, 휴대폰번호,전화번호,수령인주소) <br />4)송장정보</td>
                                        <td>상품(서비스) 배송(전송), 제품 설치, 반품, 환불, 고객상담 등 <br />정보통신서비스제공계약 및 전자상거래(통신판매)계약의 이행을 위해 필요한 업무의 처리</td>
                                        <td>배송완료 후 3개월까지 (관계법령의 규정에 의하여 보존할 필요가 있는 경우 및 사전 동의를 득한 경우 해당 보유 기간)</td>
                                    </tr>
                                    </tbody>
                                </table>
                            </div>
                        </li>

                        <li>
                            <span class="title">4. 개인정보처리 위탁</span>
                            <ul>
                                <li>가. 에타는 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다.</li>
                            </ul>
                            <div class="table_basic_type">
                                <table>
                                    <caption>약관동의 정보 표</caption>
                                    <colgroup>
                                        <col style="width:305px;" />
                                        <col style="width:305px;" />
                                        <col />
                                    </colgroup>
                                    <thead>
                                    <tr>
                                        <th scope="col">위탁받는 자(수탁자)</th>
                                        <th scope="col">위탁하는 업무 내용</th>
                                        <th scope="col">위탁 기간</th>
                                    </tr>
                                    </thead>
                                    <tbody>
                                    <tr>
                                        <td>전자결제대행사(㈜케이지이니시스 외)</td>
                                        <td>신용카드 결제승인 및 매입업무 대행무통장입금(가상계좌) 서비스제공</td>
                                        <td>회원 탈퇴 및 위탁 계약 만료 때 까지</td>
                                    </tr>
                                    <tr>
                                        <td>판매자 지정 물류업체 및 배송업체(우체국, CJ대한통운 외)</td>
                                        <td>물품배송 또는 청구지 등 발송</td>
                                        <td>회원 탈퇴 및 위탁 계약 만료 때 까지</td>
                                    </tr>
                                    </tbody>
                                </table>
                            </div>
                            <ul>
                                <li>나. 에타는 위탁계약 체결시 개인정보 보호법 제25조에 따라 위탁업무 수행목적 외 개인정보 처리금지, 기술적․관리적 보호조치, 재위탁 제한, 수탁자에 대한 관리․감독, 손해배상 등 책임에 관한 사항을 계약서 등 문서에 명시하고, 수탁자가 개인정보를 안전하게 처리하는지를 감독하고 있습니다.</li>
                                <li>다. 위탁업무의 내용이나 수탁자가 변경될 경우에는 지체없이 본 개인정보 처리방침을 통하여 공개하도록 하겠습니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">5. 정보주체의 권리, 의무 및 그 행사방법</span>
                            <ul>
                                <li>가. 이용자는 개인정보주체로서 에타에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.
                                    <ul>
                                        <li>① 개인정보 열람요구</li>
                                        <li>② 오류 등이 있을 경우 정정 요구</li>
                                        <li>③ 삭제요구</li>
                                        <li>④ 처리정지 요구</li>
                                    </ul>
                                </li>
                                <li>나. 제1항에 따른 권리 행사는 에타에 대해 개인정보 보호법 시행규칙 별지 제8호 서식에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 에타는 이에 대해 지체 없이 조치하겠습니다.</li>
                                <li>다. 정보주체가 개인정보의 오류 등에 대한 정정 또는 삭제를 요구한 경우에는 에타는 정정 또는 삭제를 완료할 때까지 당해 개인정보를 이용하거나 제공하지 않습니다.</li>
                                <li>라. 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">6. 개인정보 자동 수집 장치의 설치, 운영 및 그 거부에 관한 사항</span>
                            <ul>
                                <li>가. 쿠키(cookie)란?
                                    <p class="paragraph">에타는 이용자에 대한 정보를 저장하고 수시로 찾아내는 쿠키(cookie)를 사용합니다. 쿠키는 웹사이트가 이용자의 컴퓨터 브라우저(인터넷익스플로러 등)로 전송하는 소량의 정보입니다. 이용자께서 웹사이트에 접속을 하면 에타의 서버는 이용자의 브라우저에 추가정보를 임시로 저장하여 접속에 따른 성명 등의 추가 입력 없이 서비스를 제공할 수 있습니다. 쿠키는 이용자의 컴퓨터는 식별하지만 이용자를 개인적으로 식별하지는 않습니다. 또한
                                        이용자는 쿠키에 대한 선택권이 있습니다.</p>
                                </li>
                                <li>나. 에타의 쿠키 운용
                                    <p class="paragraph">에타는 이용자의 편의를 위하여 쿠키를 운영합니다. 에타가 쿠키를 통해 수집하는 정보는 회원ID에 한하며, 그 외의 다른 정보는 수집하지 않습니다. 에타가 쿠키를 통해 수집한 회원 ID는 다음의 목적을 위해 사용됩니다.</p>
                                    <ul>
                                        <li>- 개인의 관심 분야에 따란 차별화된 정보를 제공</li>
                                        <li>- 쇼핑한 품목들에 대한 정보와 장바구니 서비스를 제공 </li>
                                        <li>- 회원과 비회원의 접속빈도 또는 머문 시간 등을 분석하여 서비스 개편 및 마케팅에 활용</li>
                                    </ul>
                                </li>
                                <li>다. 쿠키는 브라우저의 종료시나 로그아웃 시 만료됩니다.</li>
                                <li>라. 쿠키의 설치 및 거부
                                    <ul>
                                        <li>① 이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서 이용자는 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다. </li>
                                        <li>② 다만, 쿠키의 저장을 거부할 경우에는 로그인이 필요한 서비스 등 일부 서비스 이용에 어려움이 있을 수 있습니다. </li>
                                        <li>③ 쿠키 설치 허용 여부를 지정하는 방법
                                            <ul>
                                                <li>Internet Explorer: 도구 메뉴 선택 > 인터넷 옵션 선택 > 개인정보 탭 클릭 > 개인정보처리 수준 설정</li>
                                                <li>Chrome: 설정 메뉴 선택 > 고급 설정 표시 선택 > 개인정보-콘텐츠 설정 선택 > 쿠키 수준 설정</li>
                                                <li>firefox: 옵션 메뉴 선택 > 개인정보 선택 > 방문기록-사용자 정의 설정 > 쿠키 수준 설정</li>
                                                <li>safari: 환경설정 메뉴 선택 > 개인정보 탭 선택 > 쿠키 및 웹 사이트 데이터 수준 설정</li>
                                            </ul>
                                        </li>
                                    </ul>
                                </li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">7. 개인정보의 파기</span>
                            <p class="paragraph">에타는 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.</p>
                            <ul>
                                <li>- 파기절차이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.</li>
                                <li>- 파기기한이용자의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.</li>
                                <li>- 파기방법
                                    <ul>
                                        <li>① 전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.</li>
                                        <li>② 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.</li>
                                    </ul>
                                </li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">8. 개인정보의 안전성 확보 조치</span>
                            <p class="paragraph">에타는 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고 있습니다.</p>
                            <ul>
                                <li>- 정기적인 자체 감사 실시<br />개인정보 취급 관련 안정성 확보를 위해 정기적(분기 1회)으로 자체 감사를 실시하고 있습니다.</li>
                                <li>- 개인정보 취급 직원의 최소화 및 교육<br />개인정보를 취급하는 직원을 지정하고 담당자에 한정시켜 최소화 하여 개인정보를 관리하는 대책을 시행하고 있습니다.</li>
                                <li>- 내부관리계획의 수립 및 시행<br />개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.</li>
                                <li>- 해킹 등에 대비한 기술적 대책<br />에타는 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신·점검을 하며 외부로부터 접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다.</li>
                                <li>- 개인정보의 암호화<br />이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.</li>
                                <li>- 접속기록의 보관 및 위변조 방지<br />개인정보처리시스템에 접속한 기록을 최소 6개월 이상 보관, 관리하고 있으며, 접속 기록이 위변조 및 도난, 분실되지 않도록 보안기능 사용하고 있습니다.</li>
                                <li>- 개인정보에 대한 접근 제한<br />개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">9. 개인정보 보호책임자 작성</span>
                            <ul>
                                <li>가. 에타는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.
                                    <p class="paragraph">▶ 개인정보 보호책임</p>
                                    <ul>
                                        <li>- 성명: 민승기</li>
                                        <li>- 담당부서명: 서비스기획팀</li>
                                        <li>- 직책: 팀장</li>
                                        <li>- 전화번호: 02-569-6227</li>
                                        <li>- 이메일: <a href="mailto:admin@etah.co.kr">admin@etah.co.kr</a></li>
                                    </ul>
                                </li>
                                <li>나. 정보주체께서는 에타의 서비스(또는 사업)를 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. 에타는 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.</li>
                            </ul>
                        </li>

                        <li>
                            <span class="title">10. 개인정보 처리방침 변경</span>
                            <ul>
                                <li>○ 본 방침은 2016년 7월 18일부터 시행됩니다.</li>
                            </ul>
                        </li>
                    </ul>
                </div>
            </li>
        </ul>

        <ul class="btn_list">
            <li><button type="button" class="btn_positive btn_positive__min" onClick="javascript:jsOrder();">약관동의</button></li>
            <? if($order_gb == 'A' || $order_gb == 'C' || $order_gb == 'D'){	?>
                <li><button type="button" class="btn_negative btn_negative__min" onClick="javascript:location.href='/cart'">동의취소</button></li>
            <? } else {	?>
                <li><button type="button" class="btn_negative btn_negative__min" onClick="javascript:location.href='/goods/detail/<?=explode('||',$order_gb)[1]?>'">동의취소</button></li>
            <? }?>
        </ul>
    </div>
<? }?>
<!----------------------------------------------------->
<!-- 2017-04-20 비회원 구매시 동의 약관 보여주기 END -->
<!----------------------------------------------------->

<!-- 주문/결제 페이지 시작 CONTENTS -->
<div class="contents order_page" id="order_contents" <? if(!($this->session->userdata('EMS_U_ID_') != 'GUEST' && $this->session->userdata('EMS_U_ID_') != 'TMP_GUEST' && $this->session->userdata('EMS_U_ID_'))){	?>style="display:none;"<? }?>>
    <h2 class="page_title">주문/결제</h2>

    <form name="OrderForm" id="OrderForm" method="post">
        <div class="myinfo">
            <div class="myinfo_greet">
                <span class="spr-cart icon_me"></span>
                <? if($this->session->userdata('EMS_U_ID_') && $this->session->userdata('EMS_U_ID_') != 'GUEST' && $this->session->userdata('EMS_U_ID_') != 'TMP_GUEST' ){	?>
                    <em class="bold"><?=$this->session->userdata('EMS_U_NAME_')?></em>님 혜택정보
                    <dl class="my_benefits">
                        <dt>마일리지 :</dt>
                        <dd><?=number_format($mileage)?>P</dd>
                        <dt>쿠폰 :</dt>
                        <dd><a href="/mywiz/coupon"><?=$mycoupon_cnt?>장</a></dd>
                    </dl>
                <? } else {?>
                    <em class="bold">비회원으로 구매중이십니다.</em>
                <? }?>
            </div>
            <div class="step_block">
                <ul class="step_list">
                    <li class="step_item">
                        <span class="spr-cart icon_cart"></span>
                        <span class="step_text">01. 장바구니</span>
                        <span class="spr-cart arow_right"></span>
                    </li>
                    <li class="step_item active">
                        <span class="spr-cart icon_write"></span>
                        <span class="step_text">02. 주문/결제</span>
                        <span class="spr-cart arow_right"></span>
                    </li>
                    <li class="step_item">
                        <span class="spr-cart icon_complete"></span>
                        <span class="step_text">03. 결제완료</span>
                    </li>
                </ul>
            </div>
        </div>

        <!--############################################################-->
        <!--####################### 주문상품 내역 ######################-->
        <!--############################################################-->

        <h3 class="title_page">주문상품 내역</h3>
        <div class="board_list board_list_cartmodify">
            <table class="board_list_table" summary="장바구니에 담겨진 상품 리스트 입니다.">
                <caption>장바구니 상품 리스트</caption>
                <colgroup>
                    <col width="150px" />
                    <col width="*" />
                    <col width="143px" />
                    <col width="137px" />
                    <col width="144px" />
                    <col width="144px" />
                    <col width="144px" />
                </colgroup>
                <thead>
                <tr>
                    <th scope="col">
                        <span class="hide_text">상품이미지</span>
                    </th>
                    <th scope="col" class="th_goods_data">
                        <span class="th_text">상품정보</span>
                    </th>
                    <th scope="col">
                        <span class="th_text">수량</span>
                    </th>
                    <th scope="col">
                        <span class="th_text">상품금액</span>
                    </th>
                    <th scope="col">
                        <span class="th_text">할인금액</span>
                    </th>
                    <th scope="col">
                        <span class="th_text">할인적용금액</span>
                    </th>
                    <th scope="col">
                        <span class="th_text">배송비</span>
                    </th>
                </tr>
                </thead>
                <tbody>
                <?
                $total_goods_price		= 0;
                $total_discount_price	= 0;
                $total_delivery_price	= 0;
                $idx					= 0;		//상품별 카운트 인덱스
                $idx2					= 0;		//하부공급사별 묶음 카운트를 위한 인덱스
                $goods_mileage_save		= 0;
                $goods_seller_amt_sum	= 0;		//상품별 셀러쿠폰 합
                $goods_item_amt_sum		= 0;		//상품별 아이템쿠폰 합
                $goods_cust_amt_sum		= 0;		//상품별 에타중복쿠폰 합

                $group					= array_keys($cart);

                $ascw_good_info			= "";		//kcp 에스크로 상품 정보
                $ascw_good_cnt			= 0;		//kcp 에스크로 상품 갯수

                //                          var_dump($cart);
                foreach($cart as $cart_grp){
                    //var_dump($group[$idx2]);
                    $group_delivery_price	= explode("||",$group[$idx2])[1];		//묶음배송비
                    $group_goods	= 'N';		//묶음상품여부

                    foreach($cart_grp as $row){

                        $ascw_good_cnt ++;
                        $ascw_good_info .= "seq=".$ascw_good_cnt.chr(31)."ordr_numb=".date("YmdHms").$ascw_good_cnt.chr(31)."good_name=".$row['GOODS_NM'].chr(31)."good_cntx=".$row['GOODS_CNT'].chr(31)."good_amtx=".(($row['SELLING_PRICE'] + $row['GOODS_OPTION_ADD_PRICE']) * $row['GOODS_CNT'] - ($row['DISCOUNT_PRICE'] * $row['GOODS_CNT']) - $row['ADD_DISCOUNT_PRICE']).chr(30);

                        if($idx == 0){
                            $main_goods = $row['GOODS_NM'];
                        }	?>
                        <tr>
                            <td class="image">
                                <a href="/goods/detail/<?=$row['GOODS_CD']?>"><img src="<?=$row['GOODS_IMG']?>" width="100" height="100" alt="상품 이미지" /></a>
                            </td>
                            <td class="goods_detail__string">
                                <p class="name"><?=$row['BRAND_NM']?></p>
                                <p class="description"><?=$row['GOODS_NM']?></p>
                                <p class="option"><?=$row['GOODS_OPTION_NM']?> <? if($row['GOODS_OPTION_ADD_PRICE'] > 0){?>(+<?=number_format($row['GOODS_OPTION_ADD_PRICE'])?>원)<? } else if($row['GOODS_OPTION_ADD_PRICE'] < 0){?>(<?=number_format($row['GOODS_OPTION_ADD_PRICE'])?>원)<? }?></p>
                                <!--	<p class="change_option">
									<button type="button" class="btn_white btn_white__small">옵션변경</button>
								</p>	-->
                            </td>
                            <td class="quantity">
                                <?=$row['GOODS_CNT']?>
                            </td>
                            <td class="price">	<!-- 상품금액 -->
                                <p class="price_text"><?=number_format(($row['SELLING_PRICE'] + $row['GOODS_OPTION_ADD_PRICE']) * $row['GOODS_CNT'])?>원</p>
                            </td>
                            <td class="cupon">	<!-- 할인금액 -->
                                <!--                                --><?//=number_format(($row['DISCOUNT_PRICE'] * $row['GOODS_CNT']) + $row['ADD_DISCOUNT_PRICE'])?><!--원-->
                                <p class="price_text" name="discount_price<?=$idx?>"><?=number_format(($row['DISCOUNT_PRICE'] * $row['GOODS_CNT']) + $row['ADD_DISCOUNT_PRICE'])?>원</p><br />
                                <button type="button" class="btn_white btn_white__small" data-ui="layer-opener" data-target="#layer__cart_02_<?=$idx?>" onClick="javascript:jsReset(<?=$idx?>,'CPN');">쿠폰선택</button>
                            </td>
                            <td class="price">	<!-- 할인 금액 적용 -->
                                <p name="sale_price<?=$idx?>"><?=number_format(($row['SELLING_PRICE'] + $row['GOODS_OPTION_ADD_PRICE']) * $row['GOODS_CNT'] - ($row['DISCOUNT_PRICE'] * $row['GOODS_CNT']) - $row['ADD_DISCOUNT_PRICE'])?>원</p>
                            </td>
                            <? if($group_goods == "N"){	?>
                                <td class="delivery_type" rowspan="<?=count($cart_grp)?>">
                                    <input type="hidden"	name="group_deli_policy_no[]"				value="<?=$row['DELIV_POLICY_NO']?>">	<!-- 묶음상품 배송정책 -->
                                    <input type="hidden"	name="group_delivery_price[]"				value="<?=$group_delivery_price?>">	<!-- 묶음상품 배송비 -->
                                    <input type="hidden"	name="group_add_delivery_price[]"	value=0>	<!-- 묶음상품 추가배송비 -->
                                    <input type="hidden"	name="group_text[]"	value="N">		<!--묶음 무료배송 코드-->
                                    <p name="delivery_price<?=$idx2?>">
                                        <?=$group_delivery_price == 0 ? "무료배송" : number_format($group_delivery_price)."원"?>
                                        <? if($row['DELIV_PATTERN_TYPE'] == 'NONE'){	?>
                                            착불배송
                                        <?}?>
                                    </p>
                                    <button type="button" class="btn_white btn_white__small" data-ui="layer-opener" data-target="#layer__cart_01_<?=$idx?>">지역별 추가배송비</button>
                                </td>
                            <?
                            $group_goods = "Y";
                            $total_delivery_price	+= $group_delivery_price;
                            } else if($group_goods == 'Y'){	?>
                                <script>
                                    var idx2 = "<?=$idx2?>";
                                    document.getElementsByName("group_text[]")[idx2].value = 'Y';
                                </script>
                            <?	}	?>
                        </tr>
                        <?
                        $total_goods_price		+= ($row['SELLING_PRICE'] + $row['GOODS_OPTION_ADD_PRICE'])  * $row['GOODS_CNT'];
                        $total_discount_price	+= ($row['DISCOUNT_PRICE'] * $row['GOODS_CNT']) + $row['ADD_DISCOUNT_PRICE'];
//						$total_delivery_price	+= $row['DELIVERY_PRICE'];

                        $idx++;
                        ?>
                        <input type="hidden"	name="goods_code[]"					value="<?=$row['GOODS_CD'		]?>">
                        <input type="hidden"	name="goods_name[]"					value="<?=$row['GOODS_NM'		]?>">
                        <input type="hidden"	name="brand_code[]"					value="<?=$row['BRAND_CD'		]?>">
                        <input type="hidden"	name="brand_name[]"					value="<?=$row['BRAND_NM'		]?>">
                        <input type="hidden"	name="goods_option_code[]"			value="<?=$row['GOODS_OPTION_CD']?>">
                        <input type="hidden"	name="goods_option_name[]"			value="<?=$row['GOODS_OPTION_NM']?>">
                        <input type="hidden"	name="goods_option_add_price[]"		value="<?=$row['GOODS_OPTION_ADD_PRICE']?>">
                        <input type="hidden"	name="goods_deli_policy_no[]"		value="<?=$row['DELIV_POLICY_NO']?>">
                        <input type="hidden"	name="goods_deli_policy_pattern_type[]" value="<?=$row['DELIV_PATTERN_TYPE']?>">
                        <input type="hidden"	name="goods_cnt[]"					value="<?=$row['GOODS_CNT'		]?>">
                        <input type="hidden"	name="goods_option_qty[]"			value="<?=$row['GOODS_OPTION_QTY']?>">      <!--옵션 재고수량-->
                        <input type="hidden"    name="goods_buy_limit_qty[]"		value="<?=$row['BUY_LIMIT_QTY']?>">         <!--구매제한 수량-->
                        <input type="hidden"	name="goods_price_code[]"			value="<?=$row['GOODS_PRICE_CD'	]?>">
                        <input type="hidden"	name="goods_selling_price[]"		value="<?=$row['SELLING_PRICE'	]?>">
                        <input type="hidden"	name="goods_street_price[]"			value="<?=$row['STREET_PRICE'	]?>">
                        <input type="hidden"	name="goods_factory_price[]"		value="<?=$row['FACTORY_PRICE']?>">
                        <input type="hidden"	name="goods_discount_price[]"		value="<?=$row['DISCOUNT_PRICE'	]?>">
                        <input type="hidden"	name="goods_add_discount_price[]"	value="<?=$row['ADD_DISCOUNT_PRICE']?>">
                        <input type="hidden"	name="goods_mileage_save_rate[]"	value="<?=$row['GOODS_MILEAGE_SAVE_RATE']?>">
                        <input type="hidden"	name="goods_mileage_save_amt[]"		value="<?=$this->session->userdata('EMS_U_NO_') != "" && $this->session->userdata('EMS_U_ID_') != 'GUEST' && $this->session->userdata('EMS_U_ID_') != 'TMP_GUEST' ? (($row['SELLING_PRICE']+$row['GOODS_OPTION_ADD_PRICE'])*$row['GOODS_CNT']) * ($row['GOODS_MILEAGE_SAVE_RATE']/1000) : 0?>">
                        <input type="hidden"	name="goods_coupon_code_s[]"		value="<?=$row['SELLER_COUPON_CODE'	]?>">	<!--할인쿠폰코드(셀러)-->
                        <input type="hidden"	name="goods_coupon_amt_s[]"			value="<?=$row['SELLER_COUPON_AMT']?>">		<!--쿠폰할인적용금액(셀러쿠폰)-->
                        <input type="hidden"	name="goods_coupon_code_i[]"		value="<?=$row['ITEM_COUPON_CODE'	]?>">	<!--할인쿠폰코드(아이템)-->
                        <input type="hidden"	name="goods_coupon_amt_i[]"			value="<?=$row['ITEM_COUPON_AMT']?>">		<!--쿠폰할인적용금액(아이템쿠폰)-->
                                                                                                                                    <!--	<input type="hidden"	name="goods_coupon_num[]"	value="<?/*=$row['COUPON_NUM'		]*/?>">	-->
                        <input type="hidden"	name="goods_add_coupon_no[]"		value="<?=$row['ADD_COUPON_NO']?>">			<!--추가쿠폰번호... cust_coupon_no-->
                        <input type="hidden"	name="goods_add_coupon_code[]"		value="<?=$row['ADD_COUPON_CODE']?>">		<!--추가쿠폰코드-->
                        <input type="hidden"	name="goods_add_coupon_num[]"		value="<?=$row['ADD_COUPON_NUM']?>">		<!--추가쿠폰번호-->
                                                                                                                                 <!--<input type="hidden"	name="goods_delivery_price[]"		value="<?/*=$row['DELIVERY_PRICE'	]*/?>">-->
                        <input type="hidden"	name="goods_delivery_price[]"		value="<?=$group_delivery_price?>">
                        <input type="hidden"	name="goods_add_delivery_price[]"	value=0>
                        <input type="hidden"	name="deliv_yn"						value="Y">	<!--배송가능여부-->
                        <input type="hidden"	name="cart_coupon_code"				value="">	<!--장바구니쿠폰-->
                        <input type="hidden"	name="cart_coupon_num"				value="">	<!--장바구니번호-->
                        <input type="hidden"	name="cart_coupon_amt"				value="0">	<!--장바구니쿠폰적용금액-->

                                                                                                    <!-- 2019.09.25 쿠폰선택버튼 추가 // -->
                        <input type="hidden" name="goods_add_coupon_num[]"		value="">	<!--추가할인쿠폰번호-->
                        <input type="hidden" name="goods_add_coupon_type[]"		value="">	<!--추가할인쿠폰 지급방식-->
                        <input type="hidden" name="goods_add_coupon_gubun[]"	value="">	<!--추가할인쿠폰 구분-->
                        <!-- // 쿠폰선택버튼 추가 -->

                        <?
                        $goods_mileage_save	+= $this->session->userdata('EMS_U_NO_') != "" && $this->session->userdata('EMS_U_ID_') != 'GUEST' && $this->session->userdata('EMS_U_ID_') != 'TMP_GUEST' ? ($row['SELLING_PRICE']*$row['GOODS_CNT']) * ($row['GOODS_MILEAGE_SAVE_RATE']/1000) : 0;	//적립예정마일리지

                        $goods_seller_amt_sum	+= $row['SELLER_COUPON_AMT'] * $row['GOODS_CNT'];
                        $goods_item_amt_sum		+= $row['ITEM_COUPON_AMT'] * $row['GOODS_CNT'];
                        $goods_cust_amt_sum		+= $row['ADD_DISCOUNT_PRICE'];
                    }
                    $idx2++;
                }
                $goods_name = $main_goods;

                if($idx > 1){
                    $goods_name .=" 외 ".($idx-1)."개";
                }	?>

                </tbody>
            </table>
        </div>

        <!-- 결제에 필요한 정보 -->
        <input type="hidden" name="gopaymethod"				value="">
        <input type="hidden" name="goodname"				value="<?=$goods_name ?>">
        <input type="hidden" name="buyercode"				value="<?=$this->session->userdata('EMS_U_NO_')?>">
        <input type="hidden" name="buyerid"					value="<?=$this->session->userdata('EMS_U_ID_')?>">
        <input type="hidden" name="buyername"				value="<?=$this->session->userdata('EMS_U_NAME_')?>">
        <input type="hidden" name="buyeremail"				value="<?=$this->session->userdata('EMS_U_EMAIL_')?>">
        <input type="hidden" name="buyertel"				value="<?=$this->session->userdata('EMS_U_MOB_')?>">

        <input type="hidden" name="imp_uid"					value="">	<!--PG사 결제 고유 ID-->
        <input type="hidden" name="receipt_url"				value="">	<!--신용카드 매출전표 확인 URL-->
        <input type="hidden" name="card_name"				value="">	<!--카드사명-->
        <input type="hidden" name="card_quota"				value="">	<!--카드할부개월-->
        <input type="hidden" name="vbank_name"				value="">	<!--가상계좌 은행명-->
        <input type="hidden" name="vbank_num"				value="">	<!--가상계좌 계좌번호-->
        <input type="hidden" name="vbank_holder"			value="">	<!--가상계좌 예금주-->
        <input type="hidden" name="vbank_date"				value="">	<!--가상계좌 마감기한-->

        <!--2018.04.09  휴대폰 결제 정보 추가-->
        <input type="hidden" name="tel_code"                value="">   <!--통신사 코드-->
        <input type="hidden" name="mob_no"                  value="">   <!--결제 휴대폰 번호-->

        <input type="hidden" name="pg_tid"					value="">	<!--PG사 주문번호-->

        <!-- ARS 결제 정보 추가 -->
        <input type="hidden" name="vnum_no"                 value="">   <!--ARS 가상전화번호-->
        <input type="hidden" name="expr_dt"                 value="">   <!--ARS 결제 유효기간-->
        <input type="hidden" name="ars_trade_no"            value="">   <!--ARS 상품 등록번호-->

        <!-- 기타설정 -->
        <input type="hidden" name="currency"				value="WON">
        <input type="hidden" name="acceptmethod"			value="">
        <input type="hidden" name="oid"						value="">
        <!--input type="hidden" name=ini_logoimage_url		value="http://"-->
        <input type="hidden" name="ini_encfield"			value="">
        <input type="hidden" name="ini_certid"				value="">
        <input type="hidden" name="quotainterest"			value="">
        <input type="hidden" name="paymethod"				value="">
        <input type="hidden" name="cardcode"				value="">
        <input type="hidden" name="cardquota"				value="">
        <input type="hidden" name="rbankcode"				value="">
        <input type="hidden" name="reqsign"					value="DONE">
        <input type="hidden" name="encrypted"				value="">
        <input type="hidden" name="sessionkey"				value="">
        <input type="hidden" name="uid"						value="">
        <input type="hidden" name="sid"						value="">
        <input type="hidden" name="version"					value=5000>
        <input type="hidden" name="clickcontrol"			value="">
        <input type="hidden" name="escrowuse"				value="N">

        <input type="hidden" name="order_payment_type"      value="">
        <input type="hidden" name="total_order_money"		value="<?=$total_goods_price?>">
        <input type="hidden" name="total_discount_money"	value="<?=$total_discount_price?>">
        <input type="hidden" name="total_delivery_money"	value="<?=$total_delivery_price?>">
        <input type="hidden" name="total_payment_money"		value="<?=$total_goods_price - $total_discount_price + $total_delivery_price?>">
        <input type="hidden" name="use_mileage"				value=0>
        <input type="hidden" name="save_mileage"			value=1000>
        <!--브라우저 정보 추가-->
        <input type="hidden" name="browser_info"  id="browser_info"  value="">
        <input type="hidden" name="kcp_temp_data" id="kcp_temp_data" value="">

        <div class="select_action">
            <button type="button" class="btn_white btn_white__small" onClick="javascript:location.href = '/cart'";>장바구니가기</button>
            <!--	<p class="select_action_description">
					장바구니에 담긴 상품은 최대 30일까지 보관되며 종료되거나 매진될 경우 자동으로 삭제됩니다.
				</p>	-->
        </div>



        <div class="payment_schedule_cost">
            <div class="inner total_payment">
                <dl class="payment_data">
                    <dt>총 상품금액</dt>
                    <dd><?=number_format($total_goods_price)?><span class="won">원</span></dd>
                </dl>
                <dl class="payment_data_option">
                    <dt>상품금액</dt>
                    <dd><?=number_format($total_goods_price)?><span class="won">원</span></dd>
                </dl>
                <span class="spr-cart icon_minus"></span>
            </div>
            <div class="inner total_discount">
                <dl class="payment_data">
                    <dt>총 할인금액</dt>
                    <dd><span name="discount_price"><?=number_format($total_discount_price)?></span><span class="won">원</span></dd>
                </dl>

                <span class="spr-cart icon_plus"></span>
            </div>
            <div class="inner total_delivery_payment">
                <dl class="payment_data">
                    <dt>총 배송비</dt>
                    <dd><span name="total_delivery_price"><?=number_format($total_delivery_price)?></span><span class="won">원</span></dd>
                </dl>
                <dl class="payment_data_option">
                    <dt>배송비</dt>
                    <dd><span name="delivery_info"><?=number_format($total_delivery_price)?></span><span class="won">원</span><span name="total_add_delivery_price"></span></dd>
                </dl>
                <span class="spr-cart icon_equal"></span>
            </div>
            <div class="inner total">
                <dl class="payment_data payment_data__point">
                    <dt>결제예정금액</dt>
                    <dd><span name="payment_price"><?=number_format($total_goods_price - $total_discount_price + $total_delivery_price)?></span><span class="won">원</span></dd>
                </dl>
                <dl class="payment_data_option">
                    <dt>적립예정 마일리지</dt>
                    <dd><?=number_format($goods_mileage_save)?><span class="won">P</span></dd>
                </dl>
            </div>
        </div>

        <!--############################################################-->
        <!--##################### 주문자/배송정보 ######################-->
        <!--############################################################-->

        <h3 class="title_page">주문자/배송정보</h3>
        <div class="orderer_shipping_info">
            <table class="normal_table">
                <caption class="hide">배송지정보 입력표</caption>
                <colgroup>
                    <col style="width:144px" />
                    <col />
                </colgroup>
                <tbody>
                <tr class="text_line">
                    <th scope="row">주문하시는 분</th>
                    <? if($this->session->userdata('EMS_U_NAME_') != ''/*&&$this->session->userdata('EMS_U_NO_') !=  5109*/&&$this->session->userdata('EMS_U_NO_') != 5770){	?>
                        <input type="hidden" name="order_name" value="<?=$this->session->userdata('EMS_U_NAME_')?>">
                        <td><?=$this->session->userdata('EMS_U_NAME_')?></td>
                    <? }else if($this->session->userdata('EMS_U_NO_') ==  5109) {?>
                        <td><input type="text" class="input_text" name="order_name" value=""></td>
                    <? }else {?>
                        <td><input type="text" class="input_text" name="order_name" value=""></td>
                    <? }?>
                </tr>
                <tr>
                    <th scope="row">배송지 선택</th>
                    <td>
                        <? if($this->session->userdata('EMS_U_NO_') != "" && $this->session->userdata('EMS_U_ID_') != 'GUEST' && $this->session->userdata('EMS_U_ID_') != 'TMP_GUEST'){	?>
                            <div class="radio_area radio_area__gray">
                                <input type="radio" name="formAdress" class="radio" id="formAddress01" checked="checked" /> <label for="formAddress01" class="radio_label" onClick="javascript:jsAddrReset('A');">최근배송지</label>
                                <input type="radio" name="formAdress" class="radio" id="formNewAddress02" onClick="javascript:jsAddrReset('B');"/> <label for="formNewAddress02" class="radio_label">새로운배송지</label>
                                <button type="button" class="btn_white btn_white__small" data-ui="layer-opener" data-target="#layer_address_list">배송지선택</button>
                            </div>
                        <? } else {	?>
                            <div class="radio_area radio_area__gray">
                                <input type="radio" name="formAdress" class="radio" id="formNewAddress02" checked="checked" onClick="javascript:jsAddrReset('B');"/> <label for="formNewAddress02" class="radio_label">새로운배송지</label>
                            </div>
                        <?	}?>
                    </td>
                </tr>
                <tr>
                    <th scope="row">받으시는 분</th>
                    <td><input type="text" id="formJoin02" name="order_recipient" class="input_text" value="<?=$this->session->userdata('EMS_U_NAME_')?>" style="width: 260px;" /></td>
                </tr>
                <tr>
                    <th scope="row"><label for="formAddressInput">주소</label></th>
                    <td>
                        <div class="td_composition_item">
                            <input type="text" id="formAddressInput" name="order_postnum_text" class="input_text" value="" style="width: 152px;" disabled/>
                            <input type="hidden" name="order_postnum" id="order_postnum" value="">

                            <!--<button type="button" class="btn_white" data-ui="layer-opener" data-target="#layer__postal_code_search_01">우편번호검색</button> //-->
                            <button type="button" class="btn_white" onclick="execDaumPostcode('formAddressInput','order_postnum','order_addr1_text','order_addr1','order_addr2');">우편번호검색</button>
                            <span name="no_deliv_text" style="color:red;"></span>
                        </div>
                        <div class="td_composition_item">
                            <label><input type="text" class="input_text" name="order_addr1_text" id="order_addr1_text" style="width: 762px;" placeholder="기본 주소" value="" disabled/></label>
                            <input type="hidden" name="order_addr1" id="order_addr1" value="">
                        </div>
                        <div class="td_composition_item">
                            <label><input type="text" class="input_text" name="order_addr2" id="order_addr2" style="width: 762px;" placeholder="상세 주소" value=""/></label>
                        </div>
                    </td>
                </tr>
                <tr>
                    <th scope="row"><label for="formNumSelect01">휴대폰번호</label></th>
                    <td>
                        <div class="select_wrap" style="width:97px; margin-right:15px;">
                            <select id="formCommIdSelect01" name="sel_comm_id" style="width:97px;">
                                <option value="">선택</option>
                                <option value="SKT">SKT</option>
                                <option value="KTF">KT</option>
                                <option value="LGT">LGU+</option>
                            </select>
                        </div>
                        <div class="select_wrap" style="width:97px;">
                            <select id="formNumSelect01" name="order_mobile1" style="width:97px;">
                                <option value="">선택</option>
                                <option value="010">010</option>
                                <option value="011">011</option>
                                <option value="016">016</option>
                                <option value="017">017</option>
                                <option value="019">019</option>
                            </select>
                        </div>
                        <span class="dash">- </span>
                        <label><input type="text" class="input_text" name="order_mobile2" style="width: 100px;" value="" /></label>
                        <span class="dash">- </span>
                        <label><input type="text" class="input_text" name="order_mobile3" style="width: 100px;" value=""/></label>
                        <input type="hidden" name="order_mobile" value="<?=$order_mobile?>">
                    </td>
                </tr>
                <tr>
                    <th scope="row"><label for="formNumSelect02">전화번호</label></th>
                    <td>
                        <div class="select_wrap" style="width:97px;">
                            <select id="formNumSelect02" name="order_phone1" style="width:97px;">
                                <option value="">선택</option>
                                <option value="02">02</option>
                                <option value="031">031</option>
                                <option value="032">032</option>
                                <option value="033">033</option>
                                <option value="041">041</option>
                                <option value="042">042</option>
                                <option value="043">043</option>
                                <option value="044">044</option>
                                <option value="051">051</option>
                                <option value="052">052</option>
                                <option value="053">053</option>
                                <option value="054">054</option>
                                <option value="055">055</option>
                                <option value="061">061</option>
                                <option value="062">062</option>
                                <option value="063">063</option>
                                <option value="064">064</option>
                                <option value="070">070</option>
                                <option value="080">080</option>
                                <option value="0507">0507</option>
                                <option value="0506">0506</option>
                                <option value="0505">0505</option>
                                <option value="0504">0504</option>
                                <option value="0503">0503</option>
                                <option value="0502">0502</option>
                                <option value="0303">0303</option>
                            </select>
                        </div>
                        <span class="dash">- </span>
                        <label><input type="text" class="input_text" name="order_phone2" style="width: 100px;" /></label>
                        <span class="dash">- </span>
                        <label><input type="text" class="input_text" name="order_phone3" style="width: 100px;" /></label>
                        &nbsp;<input type="checkbox" id="phone_yn" name="phone_yn" class="checkbox" value="Y"/>
                        <label for="phone_yn" class="checkbox_label"/>없음</label>
                        <input type="hidden" name="order_phone" value="">
                    </td>
                </tr>
                <tr>
                    <th scope="row"><label for="formNumSelect01">이메일</label></th>
                    <td>
                        <label><input type="text" class="input_text" name="order_email1" style="width: 100px;" value="<?=$this->session->userdata('EMS_U_EMAIL_') ? explode('@',$this->session->userdata('EMS_U_EMAIL_'))[0] : ''?>" /></label>
                        <span class="dash">@</span>
                        <input type="text" id="formJoin05_2" name="order_email2" class="input_text" value="<?=$this->session->userdata('EMS_U_EMAIL_') ? explode('@',$this->session->userdata('EMS_U_EMAIL_'))[1] : ''?>" style="width: 142px;" />
                        <div class="select_wrap" style="width:168px;">
                            <label for="formMailSelect">이메일선택</label>
                            <select id="formMailSelect" style="width:168px;" onChange="javascript:$('input[name=order_email2]').val(this.value);">
                                <option value=''>직접입력</option>
                                <option value="naver.com">naver.com</option>
                                <!--	<option value="daum.net">daum.net</option>	-->
                                <option value="hotmail.com">hotmail.com</option>
                                <option value="nate.com">nate.com</option>
                                <option value="yahoo.co.kr">yahoo.co.kr</option>
                                <option value="paran.com">paran.com</option>
                                <option value="empas.com">empas.com</option>
                                <option value="dreamwiz.com">dreamwiz.com</option>
                                <option value="freechal.com">freechal.com</option>
                                <option value="lycos.co.kr">lycos.co.kr</option>
                                <option value="korea.com">korea.com</option>
                                <option value="gmail.com">gmail.com</option>
                                <option value="hanmir.com">hanmir.com</option>
                            </select>
                        </div>
                    </td>
                </tr>
                <tr>
                    <th scope="row"><label for="formRequest">배송시 요청사항</label></th>
                    <td><input type="text" id="formRequest" name="order_request" class="input_text" value="" style="width: 762px;" /></td>
                </tr>
                </tbody>
            </table>
        </div>

        <!--############################################################-->
        <!--####################### 가구 배송정보 ######################-->
        <!--############################################################-->
        <? if($DELIV_INFO == 'Y'){	?>
            <h3 class="title_page title_page__large">가구 배송정보</h3>
            <div class="furniture_shipping_info">
                <table class="normal_table">
                    <caption class="hide">가구 배송정보 입력표</caption>
                    <colgroup>
                        <col style="width:144px" />
                        <col style="width:500px" />
                        <col />
                    </colgroup>
                    <tbody>
                    <tr>
                        <th scope="row">주거층수</th>
                        <td>
                            <div class="radio_area radio_area__gray">
                                <input type="radio" name="shipping_floor" class="radio" id="formShippingAddress0101" value="LOW" checked="checked" /> <label for="formShippingAddress0101" class="radio_label">1~2층</label>
                                <input type="radio" name="shipping_floor" class="radio" id="formShippingAddress0102" value="HIGH"/> <label for="formShippingAddress0102" class="radio_label">3층이상</label>
                            </div>
                        </td>
                        <td>
                            <ul class="bullet_list">
                                <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>제품 설치 할 공간을 미리 확보 하셨습니까?</li>
                            </ul>
                            <div class="checkbox_area">
                                <input type="checkbox" class="checkbox" id="formShippingAddress0103" value="N"> <label class="checkbox_label" for="formShippingAddress0103">동의확인</label>
                            </div>
                        </td>
                    </tr>
                    <tr>
                        <th scope="row">계단폭</th>
                        <td>
                            <div class="radio_area radio_area__gray">
                                <input type="radio" name="shipping_step_width" class="radio" id="formShippingAddress0201" value="LOW" checked="checked" /> <label for="formShippingAddress0201" class="radio_label">2m미만</label>
                                <input type="radio" name="shipping_step_width" class="radio" id="formShippingAddress0202" value="HIGH"/> <label for="formShippingAddress0202" class="radio_label">2m이상</label>
                            </div>
                        </td>
                        <td>
                            <ul class="bullet_list">
                                <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>(제품에 따라) 3층 이상 또는 계단 폭 2m 미만, 엘리베이터가 없거나 8인 이상이 <br /> 아닌경우 사다리차가 필요합니다.(자세한 내용은 상품 정보 배송가이드 참조 또는<br /> 고객센터 문의) 이에 동의하십니까?</li>
                            </ul>
                            <div class="checkbox_area">
                                <input type="checkbox" class="checkbox" id="formShippingAddress0203" value="N"> <label class="checkbox_label" for="formShippingAddress0203">동의확인</label>
                            </div>
                        </td>
                    </tr>
                    <tr>
                        <th scope="row">엘리베이터</th>
                        <td>
                            <div class="radio_area radio_area__gray">
                                <input type="radio" name="shipping_elevator" class="radio" id="formShippingAddress0301" value="SEVEN" checked="checked" /> <label for="formShippingAddress0301" class="radio_label">1~7인승</label>
                                <input type="radio" name="shipping_elevator" class="radio" id="formShippingAddress0302" value="TEN"/> <label for="formShippingAddress0302" class="radio_label">8~10인승</label>
                                <input type="radio" name="shipping_elevator" class="radio" id="formShippingAddress0303" value="ELEVEN"/> <label for="formShippingAddress0303" class="radio_label">11인승 이상</label>
                                <input type="radio" name="shipping_elevator" class="radio" id="formShippingAddress0304" value="NONE"/> <label for="formShippingAddress0304" class="radio_label">없음</label>
                                <input type="radio" name="shipping_elevator" class="radio" id="formShippingAddress0305" value="NOUSE"/> <label for="formShippingAddress0305" class="radio_label">사용불가</label>
                            </div>
                        </td>
                        <td>
                            <ul class="bullet_list">
                                <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>사다리차 이용이 필요한 경우 고객님 부담입니다. 이에 동의 하십니까?<br /> 사다리차 사용 거부 시, 반품 처리가 되며 반품비가 발생합니다.<br /> 가구 엘리베이터 이동이 불가능 할 시 부득이한 경우에만 사다리차를 사용합니다.<br /> 하단 &lt;사다리차 추가비용 안내&gt; 상세내용 필독바랍니다.</li>
                            </ul>
                            <div class="checkbox_area">
                                <input type="checkbox" class="checkbox" id="formShippingAddress0401" value="N"> <label class="checkbox_label" for="formShippingAddress0401">동의확인</label>
                            </div>
                        </td>
                    </tr>
                    </tbody>
                </table>
                <em class="bullet_title">사다리차 추가비용 안내</em>
                <ul class="bullet_list">
                    <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>설치 당일. 설치현장의 특수성으로 인하여 추가적으로 발생하는 비용은 고객님 부담입니다. (양중비용, 엘리베이터 사용료, 사다리차, 지계차 사용료, 배송차량 주차료 등)</li>
                    <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>사다리차를 이용하셔야 하는 경우(사다리차는 기본적으로 고객님이 별도 요청하셔야 합니다. (8인이상 탑승가능한 엘리베이터가 없는 경우 3층부터 사용. 계단이 좁거나(2m이하), 가구가 들어가지 않는 경우)</li>
                    <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>소파 및 침대와 같은 대물 가구인 경우, 8인승 엘리베이터여도 사다리차가 필요할 수 있습니다.</li>
                    <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>사다리차 사용을 하지 않고, 기사님과 같이 가구를 옮기는 것은 불가합니다.</li>
                    <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>사다리차 필요 여건임에도 건물 특성상 사다리차 사용이 불가할 경우 양중비용 진행되어 비용이 발생합니다.</li>
                    <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>사다리차 비용 거부시 배송 불가하며, 발생 반품비용은 고객부담입니다.</li>
                </ul>

                <em class="bullet_title">배송일정 정보</em>
                <ul class="bullet_list">
                    <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>고객께서 원하시는 시점에 상품을 배송하기 위해 에타는 최선의 노력을 다하겠습니다. 다만 주문제작 등 상품 준비 상황에 따라 배송이 약간 늦어질 수 있는 점 양해하여 주십시오.</li>
                    <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>궁금하신 상황이 있으시면 저희에게 문의하여 주십시오.</li>
                </ul>
            </div>
        <? } else {?>
            <input type="hidden" name="shipping_floor"		value="">
            <input type="hidden" name="shipping_step_width" value="">
            <input type="hidden" name="shipping_elevator"	value="">
        <? }?>

        <div class="position_area">
            <!--############################################################-->
            <!--####################### 개인통관고유부호 ###################-->
            <!--############################################################-->
            <? if($SEND_NATION_INFO == 'Y'){	?>
                <h3 class="title_page title_page__large">개인통관고유부호 (해외직구 상품)</h3>
                <div class="customs_id_number">
                    <div class="customs_id_number_cehck">
                        <p class="customs_id_number_cehck_tit">통관정보 수집 및 제공에 동의 (필수)</p>
                        <input type="checkbox" id="formCustomsIdNumber0" class="checkbox">
                        <label for="formCustomsIdNumber0" class="checkbox_label">동의합니다.</label>
                    </div>
                    <div class="customs_id_number_cehck">
                        <p class="customs_id_number_cehck_tit">개인통관고유부호의 이름과 주문하시는분, 받으시는분 이름은 모두 동일해야 합니다. 동일한지 확인하셨습니까? (필수)</p>
                        <input type="checkbox" id="formCustomsIdNumber1" class="checkbox">
                        <label for="formCustomsIdNumber1" class="checkbox_label">동일합니다.</label>
                    </div>
                    <table class="normal_table">
                        <caption class="hide">개인통관고유부호 입력표</caption>
                        <colgroup>
                            <col style="width:145px" />
                            <col />
                        </colgroup>
                        <tbody>
                        <tr class="bd_none">
                            <th scope="row"><label for="orderCustomsNum">개인통관고유부호</label></th>
                            <td>
                                <input type="text" class="input_text" id="orderCustomsNum" name="orderCustomsNum" placeholder="P자로 시작하는 개인통관 고유부호 입력" style="width: 261px;" />
                                <a href="https://p.customs.go.kr" target="_blank" class="btn_white">관세청시스템 바로가기</a>
                            </td>
                        </tr>
                        </tbody>
                    </table>
                    <ul class="bullet_list bullet_list__size">
                        <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>개인통관 고유부호는 개인정보 유출을 방지하기 위하여 관세청에서 개인물품 수입신고시 주민등록번호 대신 활용할 수 있는 개인식별 고유번호입니다. 관세청시스템(<a target="_blank" href="http://p.customs.go.kr" class="link">http://p.customs.go.kr</a>)에서 본인인증 및 신청 즉시 부여되며 한 번
                            발급된 부호는 계속 사용 가능합니다. </li>
                        <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>통관업무를 위해 개인통관고유부호를 수집하여 공급자에게 제공하며, 다음 주문시 사용할 수 있도록 서비스 이용기간동안 보관합니다.</li>
                    </ul>
                </div>
            <? }?>

            <!--############################################################-->
            <!--####################### 할인/혜택 적용 #####################-->
            <!--############################################################-->
            <h3 class="title_page title_page__large">할인/혜택 적용</h3>
            <div class="dc_benefit_info">
                <table class="normal_table">
                    <caption class="hide">할인/혜택 적용 입력표</caption>
                    <colgroup>
                        <col style="width:145px" />
                        <col />
                    </colgroup>
                    <tbody>
                    <tr>
                        <th>총 주문금액</th>
                        <td><em class="price"><?=number_format($total_goods_price)?><span class="won">원</span></em> <span class="light">(배송비 제외 금액입니다.)</span></td>
                    </tr>
                    <tr>
                        <th>총 배송비(선불)</th>
                        <td><span class="light" name="total_delivery_price"><?=number_format($total_delivery_price)?></span><span class="light">원</span></td>
                    </tr>
                    <tr class="bd_none">
                        <th><label for="formDcPrice">브랜드할인</label></th>
                        <td><input type="text" class="input_text" id="formDcPrice" name="brand_price" value="<?=number_format(floor($goods_seller_amt_sum))?>" style="width: 134px;" disabled/> 원</td>
                    </tr>
                    <tr class="bd_none">
                        <th><label for="formDcCoupon">에타할인</label></th>
                        <td>
                            <input type="text" class="input_text" id="formDcCoupon" name="discount_price" value="<?=number_format(floor($goods_item_amt_sum)+$goods_cust_amt_sum)?>" style="width: 134px;" disabled/> 원
                        </td>
                    </tr>
                    <tr class="bd_none">
                        <th><label for="formDcMileage">마일리지</label></th>
                        <td>
                            <input type="text" class="input_text" id="formDcMileage" value="0" style="width: 134px;" placeholder=0 onkeypress="javascript:OnlyNumber()"/> P &nbsp;
                            <button type="button" class="btn_white" onClick="javascript:jsUsemileage();">적용</button>&nbsp;&nbsp;
                            <a class="btn_text btn_text__line">사용가능 마일리지 : <em class="bold"><?=number_format($mileage)?></em> P</a>
                        </td>
                    </tr>
                    <tr class="bold">
                        <th>최종결제금액</th>
                        <td><strong class="price"><span name="finally_payment_price"><?=number_format($total_goods_price + $total_delivery_price - $total_discount_price)?></span><span class="won">원</span></strong> <span class="light">(배송비 포함. 착불 제외)</span></td>
                    </tr>
                    </tbody>
                </table>
                <ul class="bullet_list">
                    <li class="bullet_item">※ 배송비 별도표기 및 착불인 경우, 결제금액에 포함되지 않습니다.</li>
                    <li class="bullet_item">※ 마일리지 보유금액 1,000p 이상부터 사용 가능합니다.</li>
                </ul>
            </div>
            <!--2016-09-19
		<? if($this->session->userdata('EMS_U_NO_') != ""){

                $cust_coupon_cnt = 0;	//고객이 현재 사용가능한 쿠폰 갯수
                foreach($mycoupon as $row){//최소금액 이상일때 쿠폰 갯수 증가
                    if($row['MIN_AMT'] < $total_goods_price - $total_discount_price){
                        $cust_coupon_cnt++;
                    }
                }
                ?>
			<div class="position_area">
				<h3 class="title_page title_page__large">할인/혜택 적용</h3>
				<div class="dc_benefit_info">
					<table class="normal_table">
						<caption class="hide">할인/혜택 적용 입력표</caption>
						<colgroup>
							<col style="width:145px" />
							<col />
						</colgroup>
						<tbody>
							<tr>
								<th>총 주문금액</th>
								<td><em class="price"><?=number_format($total_goods_price)?><span class="won">원</span></em> <span class="light">(배송비 제외 금액입니다.)</span></td>
							</tr>
							<tr>
								<th>총 배송비(선불)</th>
								<td><span class="light" name="total_delivery_price"><?=number_format($total_delivery_price)?></span><span class="light">원</span></td>
							</tr>
							<tr class="bd_none">
								<th><label for="formDcPrice">가격할인</label></th>
								<td><input type="text" class="input_text" id="formDcPrice" value="<?=number_format($total_discount_price)?>" style="width: 134px;" disabled/> 원</td>
							</tr>
							<tr class="bd_none">
								<th><label for="formDcCoupon">쿠폰할인</label></th>
								<td>
									<input type="text" class="input_text" id="formDcCoupon" value="0" style="width: 134px;" disabled/> 원
									<a href="#layer__cart_02" class="btn_text btn_text__line" data-ui="layer-opener">적용가능한쿠폰 <em class="bold">(<?=$cust_coupon_cnt?>)</em></a>
								</td>
							</tr>
							<tr class="bd_none">
								<th><label for="formDcMileage">마일리지</label></th>
								<td>
									<input type="text" class="input_text" id="formDcMileage" value="0" style="width: 134px;" placeholder=0 onkeypress="javascript:OnlyNumber()"/> P &nbsp;
									<button type="button" class="btn_white" onClick="javascript:jsUsemileage();">적용</button>&nbsp;&nbsp;
									<a class="btn_text btn_text__line">사용가능 마일리지 : <em class="bold"><?=number_format($mileage)?></em> P</a>
								</td>
							</tr>
							<tr class="bold">
								<th>총 주문금액</th>
								<td><strong class="price"><span name="finally_payment_price"><?=number_format($total_goods_price + $total_delivery_price - $total_discount_price)?></span><span class="won">원</span></strong> <span class="light">(배송비포함)</span></td>
							</tr>
						</tbody>
					</table>
					<ul class="bullet_list">
						<li class="bullet_item">※ 마일리지는 최소 1,000P부터 사용이 가능하며, 1,000P 단위로 사용이 가능합니다.</li>
						<li class="bullet_item">※ 결제금액은 배송비 포함 금액이며 배송비가 착불인 경우 결제금액에 포함되어 결제되지 않습니다.</li>
					</ul>
				</div>
			<? } else {	//비회원경우 할인/혜택 노출 x	?>
				<div class="position_area">
					<h3 class="title_page title_page__large">할인/혜택 적용</h3>
				<div class="dc_benefit_info">
					<h4 class="bullet_title">더 많은 할인/혜택 적용을 원하시면 로그인을 해주세요.</h4>
				</div>
			<? }?>
-->
            <!--############################################################-->
            <!--####################### 결제 수단선택 ######################-->
            <!--############################################################-->

            <h3 class="title_page title_page__large">결제수단선택</h3>
            <div class="pay_select">
                <table class="normal_table">
                    <caption class="hide">결제수단선택 입력표</caption>
                    <colgroup>
                        <col style="width:145px" />
                        <col />
                    </colgroup>
                    <tbody>
                    <tr>
                        <th><label for="formPaySelect">결제수단</label></th>
                        <td>
                            <div class="td_composition_item radio_area radio_area__gray">
                                <input type="radio" name="pay" class="radio" id="formpay01" checked="checked" onClick="javascript:jsChgpaymethod('01');" /> <label for="formpay01" class="radio_label">신용카드(일반)</label>
                                <!--					<input type="radio" name="pay" class="radio" id="formpay02" disabled/> <label for="formpay02" class="radio_label"><s>신용카드(법인)</s></label>	-->
                                <input type="radio" name="pay" class="radio" id="formpay03" onClick="javascript:jsChgpaymethod('03');" /> <label for="formpay03" class="radio_label">실시간계좌이체</label>
                                <input type="radio" name="pay" class="radio" id="formpay04" onClick="javascript:jsChgpaymethod('04');" /> <label for="formpay04" class="radio_label">무통장입금</label>
                                <!--2018.04.09 휴대폰 결제 추가-->
                                <input type="radio" name="pay" class="radio" id="formpay05" onClick="javascript:jsChgpaymethod('05');" /> <label for="formpay05" class="radio_label">휴대폰결제</label>
                                <?if($CATEGORY_PET == 'N'){?>
                                    <input type="radio" name="pay" class="radio" id="formpay07" onClick="javascript:jsChgpaymethod('07');" /> <label for="formpay07" class="radio_label kakao">카카오페이</label>
                                <?}?>
                                <input type="radio" name="pay" class="radio" id="formpay08" onClick="javascript:jsChgpaymethod('08');" /> <label for="formpay08" class="radio_label ars">ARS결제</label>

                                <?$ipdata = $_SERVER['HTTP_X_FORWARDED_FOR'];
                                //IT : 112.217.100.186
                                //에타 : 106.243.163.42
                                ?>

                                <?if(/*$this->session->userdata('EMS_U_NO_') == 42 && *//*$ipdata == '1.221.31.141'*/$ipdata == '112.217.100.186' ||  $ipdata == '106.243.163.42' || $ipdata == '106.243.163.43'){?>
                                    <input type="radio" name="pay" class="radio" id="formpay06" onClick="javascript:jsChgpaymethod('06');" /> <label for="formpay06" class="radio_label">외부결제</label>
                                    <input type="text" name="external_paytype"  class="input_text" id="external_paytype" style="display: none;" value="" placeholder="ex)카카오">
                                <?}?>
                            </div>
                        </td>
                    </tr>
                    </tbody>
                </table>

                <!--############################################################-->
                <!--####################### 환불계좌정보 ######################-->
                <!--############################################################-->

                <h3 class="title_page title_page__large refundInfoForm" style="display:none;">환불계좌 등록</h3>
                <div class="dc_benefit_info refundInfoForm" style="display:none;">
                    <input type="hidden" name="refundFromDispYn" id="refundFromDispYn" value="">
                    <table class="normal_table">
                        <caption class="hide">환불계좌정보 입력표</caption>
                        <colgroup>
                            <col style="width:145px" />
                            <col />
                        </colgroup>
                        <tbody>
                        <tr>
                            <th>환불정보</th>
                            <td>
                                <span>은행</span>&nbsp;&nbsp;
                                <div class="select_wrap" style="width:120px;margin-right:20px;">
                                    <select id="selRefundBank" name="selRefundBank" style="width:120px;">
                                        <option value="">은행선택</option>
                                        <option value="국민은행">국민은행</option>
                                        <option value="기업은행">기업은행</option>
                                        <option value="신한은행">신한은행</option>
                                        <option value="우리은행">우리은행</option>
                                        <option value="KEB하나은행">KEB하나은행</option>
                                        <option value="SC은행">SC은행</option>
                                        <option value="농협중앙회">농협중앙회</option>
                                        <option value="단위농협">단위농협</option>
                                        <option value="우체국">우체국</option>
                                        <option value="전북은행">전북은행</option>
                                        <option value="제주은행">제주은행</option>
                                        <option value="경남은행">경남은행</option>
                                        <option value="광주은행"">광주은행</option>
                                        <option value="대구은행">대구은행</option>
                                        <option value="부산은행">부산은행</option>
                                        <option value="산림조합">산림조합</option>
                                        <option value="상호저축은행">상호저축은행</option>
                                        <option value="새마을금고">새마을금고</option>
                                        <option value="수협">수협</option>
                                        <option value="신협">신협</option>
                                        <option value="한국씨티은행">한국씨티은행</option>
                                        <option value="산업은행">산업은행</option>
                                        <option value="케이뱅크">케이뱅크</option>
                                        <option value="카카오뱅크">카카오뱅크</option>
                                    </select>
                                </div>
                                <span>계좌번호</span>&nbsp;&nbsp;
                                <input type="text" class="input_text" name="txtRefundAccount" id="txtRefundAccount" value="" style="width: 200px;height:35px;margin-right:20px;text-align:left;" placeholder="'-' 없이 입력해주세요.">
                                <span>예금주</span>&nbsp;&nbsp;
                                <input type="text" class="input_text" name="txtRefundCust" id="txtRefundCust" value="" style="width: 150px;text-align:left;height:35px;">
                            </td>
                        </tr>
                        </tbody>
                    </table>
                </div>

                <!-- 결제 이용 안내 -->
                <div class="pay_select_text" id="credit_info" style="display: block;">
                    <h4 class="bullet_title">결제 이용 안내</h4>
                    <ul class="bullet_list bullet_list__size">
                        <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>신용카드, 실시간 계좌이체는 안전거래 서비스 KCP전자결제를 통해 결제 됩니다.</li>
                        <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>무이자행사는 '무이자안내'팝업 또는 KCP전자결제 창에서 확인가능합니다.</li>
                        <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>에타 가구와 생활용품(소품/패브릭)의 배송은 제품별로 설치, 택배 상품으로 각각 나뉘어 배송됩니다.</li>
                        <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>에타배송 상품과 업체 배송 상품을 같이 구매하실 경우, 각각의 배송비가 적용되며 각각 배송됩니다.</li>
                    </ul>
                </div>

                <!-- 카카오페이 이용 안내 -->
                <div class="pay_select_text" id="kakao_info" style="display:none;">
                    <h4 class="bullet_title">카카오페이 이용 안내</h4>
                    <ul class="bullet_list bullet_list__size">
                        <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>카카오페이는 카카오톡에 개인 신용/체크 카드를 등록하여 간단하게 비밀번호 만으로 결제할 수있는 모바일 결제 서비스입니다.<br>등록 시 휴대폰과 카드 명의자가 동일해야 합니다.</li>
                        <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>무이자 할부 서비스 및 신용카드 전용쿠폰 서비스는 이용이 제한 됩니다.</li>
                        <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>카카오머니로 결제 시, 현금영수증 발급은 ㈜카카오페이에서 발급가능합니다.</li>
                    </ul>
                </div>

                <!-- 무이자할부 이용 안내 -->
                <div class="pay_select_text">
                    <h4 class="bullet_title">무이자할부 이용 안내</h4>
                    <ul class="bullet_list bullet_list__size">
                        <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>무이자 할부 개월 수가 다른 상품을 한번에 주문하시는 경우, 가장 낮은 할부 개월 수가 적용됩니다. 원치 않으시면 각각 주문해주세요.<br />(예:6개월, 3개월 무이자 상품 동시 결제 시 3개월 무이자로 결제)</li>
                        <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>무이자행사는 카드사 사정에 따라 변경 또는 중단될 수 있습니다.</li>
                    </ul>
                </div>
            </div>

            <!--############################################################-->
            <!--####################### 최종 결제금액 ######################-->
            <!--############################################################-->

            <div class="last_pay">
                <h3 class="last_pay_title">최종 결제금액</h3>
                <div class="last_pay_cont">
                    <ul class="last_pay_list">
                        <li class="last_pay_item">
                            <span class="title">총 주문금액</span>
                            <span class="price"><?=number_format($total_goods_price)?><span class="won">원</span></span>
                        </li>
                        <li class="last_pay_item">
                            <span class="title">총 배송비</span>
                            <span class="price"><span name="total_delivery_price"><?=number_format($total_delivery_price)?></span><span class="won">원</span></span>
                        </li>
                        <li class="last_pay_item">
                            <span class="title">총 할인금액</span>
                            <span class="price"><span name="finally_discount_price"><?=number_format($total_discount_price)?></span><span class="won">원</span></span>
                        </li>
                        <li class="last_pay_item">
                            <span class="title">사용 마일리지</span>
                            <span class="price"><span name="finally_payment_mileage">0</span><span class="won">원</span></span>
                        </li>
                        <li class="last_pay_item last_pay_item__price">
                            <span class="title">최종결제금액</span>
                            <strong class="price"><span name="finally_payment_price"><?=number_format($total_goods_price - $total_discount_price + $total_delivery_price)?></span><span class="won">원</span></strong>
                        </li>
                    </ul>
                    <div class="last_pay_agree">
                        <em class="last_pay_agree_title">구매동의</em>
                        <p class="last_pay_agree_text">주문 상품의 상품명, 상품가격, 배송정보를<br />확인하였으며, 구매에 동의 하시겠습니까?<br />(근거 전자상거래법 8조 2항)</p>
                        <div class="checkbox_area">
                            <input type="checkbox" class="checkbox" id="formAgree"> <label class="checkbox_label" for="formAgree">동의합니다.</label>
                        </div>
                        <div class="checkbox_area" id="formEscrow" style="display:none;">
                            <input type="checkbox" class="checkbox" id="Escorw_yn" name="Escorw_yn" value="N"> <label class="checkbox_label" for="Escorw_yn">에스크로(구매안전)서비스를 적용합니다.</label>
                        </div>
                        <!--<button type="button" class="btn_positive" onClick="javascript:jsOrderPay();">결제하기</button>-->
                        <button type="button" class="btn_positive" id="btn_kcp"  onClick="javascript:jsOrderPayKCP();">결제하기</button>
                        <button type="button" class="btn_positive" id="btn_kakao"onClick="javascript:jsOrderPaykakao();" style="display: none;">카카오페이</button>
                        <button type="button" class="btn_positive" id="btn_ars"onClick="javascript:jsOrderPayARS();" style="display: none;">ARS결제</button>
                        <?if(/*$this->session->userdata('EMS_U_NO_') == 42 &&*/ /*$ipdata == '1.221.31.141'*/ $ipdata == '112.217.100.186' ||  $ipdata == '106.243.163.42' || $ipdata == '106.243.163.43'){?>
                            <button type="button" class="btn_positive" id="btn_external"onClick="javascript:jsOrderPayExternal();" style="display: none;">외부결제</button>
                        <?}?>
                    </div>
                </div>
            </div>
        </div>
    </form>

    <iframe name="HiddenFrame" frameborder="0" width="100%" height="0"></iframe>
</div>

<!--############################################################-->
<!--####################### 우편번호 검색 ######################-->
<!--############################################################-->

<!-- 우편번호 검색 레이어 // -->
<div class="layer layer__postal_code_search" id="layer__postal_code_search_01">
    <div class="layer_inner">

        <h1 class="layer_title layer_title__line">주소 찾기</h1>
        <div class="layer_cont">
            <h2 class="layer_title_sub">도로명 주소</h2>

            <div class="radio_area postal_code_select">
                <input type="radio" name="a" class="radio" id="formapostalCodeSelect01" checked="checked" onClick="javascript:$('#postal01').show(); $('#postal02').hide(); $('#postal03').hide(); $('ul[name=postalCodeCont01]').html('');" /> <label for="formapostalCodeSelect01" class="radio_label">동(읍&#47;면) + 지번</label>
                <input type="radio" name="a" class="radio" id="formapostalCodeSelect02" onClick="javascript:$('#postal02').show(); $('#postal01').hide(); $('#postal03').hide(); $('ul[name=postalCodeCont01]').html('');"/> <label for="formapostalCodeSelect02" class="radio_label">도로명주소 + 건물번호</label>
                <input type="radio" name="a" class="radio" id="formapostalCodeSelect03" onClick="javascript:$('#postal03').show(); $('#postal01').hide(); $('#postal02').hide(); $('ul[name=postalCodeCont01]').html('');"/> <label for="formapostalCodeSelect03" class="radio_label">건물명(아파트명)</label>
            </div>

            <!-- 동(읍/면) + 지번 // -->
            <div id="postal01">
                <p class="postal_code_search_text">
                    <em class="bold">검색방법 : 시&#47;도 및 시&#47;군&#47;구 선택 후 동(읍&#47;면) + 지번 입력</em> 예) 역삼동 737 -> 서울특별시 선택 후 역삼동(동명) + 737(지번)
                    <span class="tip">* 도로명 주소가 검색되지 않은 경우는 행정안전부 새주소 안내시스템 (<a href="http://www.juso.go.kr" target="_blank">http://www.juso.go.kr</a>)에서<br />확인하시기 바랍니다.</span>
                </p>
                <div class="postal_code_search_area">
                    <table class="normal_table">
                        <caption class="hide">회원가입 필수항목 입력표</caption>
                        <colgroup>
                            <col style="width:72px" />
                            <col style="width:169px" />
                            <col style="width:65px" />
                            <col />
                        </colgroup>
                        <tbody>
                        <tr>
                            <th sope="row"><label for="formPostalSearch0101">시도</label></th>
                            <td>
                                <div class="select_wrap" style="width:157px;">
                                    <select id="formPostalSearch0101" style="width:157px;" onChange="javascript:jsFindGungu(this.value,'01')">
                                        <option value=''>선택</option>
                                        <? foreach($deliv_sido_list as $row){	?>
                                            <option value="<?=$row['SIDO']?>"><?=$row['SIDO']?></option>
                                        <? }?>
                                    </select>
                                </div>
                            </td>
                            <th sope="row"><label for="formPostalSearch0102">시군구</label></th>
                            <td>
                                <div class="select_wrap" style="width:157px;">
                                    <select id="formPostalSearch0102" style="width:157px;" onChange="javscript:$('#formPostalSearch0103').val('');">
                                        <option value=''>선택</option>
                                    </select>
                                </div>
                            </td>
                        </tr>
                        <tr>
                            <th sope="row"><label for="formPostalSearch0103">검색어</label></th>
                            <td colspan="3">
                                <input type="text" class="input_text" id="formPostalSearch0103" name="formPostalSearchDong" placeholder="동(읍/면)" style="width: 376px;" />
                                <!--	<span class="spr-common spr-ico_plus">+</span>
												<label><input type="text" class="input_text" placeholder="지번" style="width: 162px;" /></label>	-->
                                <button type="submit" class="btn_black" onClick="javascript:jsPostnum('01')">검색</button>
                            </td>
                        </tr>
                        </tbody>
                    </table>
                </div>
            </div>
            <!-- // 동(읍/면) + 지번 -->

            <!-- 도로명주소 + 건물번호 // -->
            <div id="postal02" style="display:none;">
                <p class="postal_code_search_text">
                    <em class="bold">검색방법 : 시&#47;도 및 시&#47;군&#47;구 선택 후 도로명과 건물번호 입력</em> 예) 테헤란로(도로명) + 152(건물번호)
                    <span class="tip">* 도로명 주소가 검색되지 않은 경우는 행정안전부 새주소 안내시스템 (<a href="http://www.juso.go.kr" target="_blank">http://www.juso.go.kr</a>)에서<br />확인하시기 바랍니다.</span>
                </p>
                <div class="postal_code_search_area">
                    <table class="normal_table">
                        <caption class="hide">회원가입 필수항목 입력표</caption>
                        <colgroup>
                            <col style="width:72px" />
                            <col style="width:169px" />
                            <col style="width:65px" />
                            <col />
                        </colgroup>
                        <tbody>
                        <tr>
                            <th sope="row"><label for="formPostalSearch0201">시도</label></th>
                            <td>
                                <div class="select_wrap" style="width:157px;">
                                    <select id="formPostalSearch0201" style="width:157px;" onChange="javascript:jsFindGungu(this.value,'02')">
                                        <option value=''>선택</option>
                                        <? foreach($deliv_sido_list as $row){	?>
                                            <option value="<?=$row['SIDO']?>"><?=$row['SIDO']?></option>
                                        <? }?>
                                    </select>
                                </div>
                            </td>
                            <th sope="row"><label for="formPostalSearch0202">시군구</label></th>
                            <td>
                                <div class="select_wrap" style="width:157px;">
                                    <select id="formPostalSearch0202" style="width:157px;" onChange="javscript:$('#formPostalSearch0203').val(''); $('#formPostalSearch0204').val('');">
                                        <option>선택</option>
                                    </select>
                                </div>
                            </td>
                        </tr>
                        <tr>
                            <th sope="row"><label for="formPostalSearch0203">검색어</label></th>
                            <td colspan="3">
                                <input type="text" class="input_text" id="formPostalSearch0203" placeholder="도로명" style="width: 162px;" />
                                <span class="spr-common spr-ico_plus">+</span>
                                <label><input type="text" id="formPostalSearch0204" class="input_text" placeholder="건물번호" style="width: 162px;" /></label>
                                <button type="submit" class="btn_black" onClick="javascript:jsPostnum('02')">검색</button>
                            </td>
                        </tr>
                        </tbody>
                    </table>
                </div>
            </div>
            <!-- // 도로명주소 + 건물번호 -->

            <!-- 건물명(아파트명) // -->
            <div id="postal03" style="display:none;">
                <p class="postal_code_search_text">
                    <em class="bold">검색방법 : 시&#47;도 및 시&#47;군&#47;구 선택 후 건물명 입력</em> 예) 강남파이낸스센터(건물명)
                    <span class="tip">* 도로명 주소가 검색되지 않은 경우는 행정안전부 새주소 안내시스템 (<a href="http://www.juso.go.kr" target="_blank">http://www.juso.go.kr</a>)에서<br />확인하시기 바랍니다.</span>
                </p>
                <div class="postal_code_search_area">
                    <table class="normal_table">
                        <caption class="hide">회원가입 필수항목 입력표</caption>
                        <colgroup>
                            <col style="width:72px" />
                            <col style="width:169px" />
                            <col style="width:65px" />
                            <col />
                        </colgroup>
                        <tbody>
                        <tr>
                            <th sope="row"><label for="formPostalSearch0301">시도</label></th>
                            <td>
                                <div class="select_wrap" style="width:157px;">
                                    <select id="formPostalSearch0301" style="width:157px;" onChange="javascript:jsFindGungu(this.value,'03')">
                                        <option value=''>선택</option>
                                        <? foreach($deliv_sido_list as $row){	?>
                                            <option value="<?=$row['SIDO']?>"><?=$row['SIDO']?></option>
                                        <? }?>
                                    </select>
                                </div>
                            </td>
                            <th sope="row"><label for="formPostalSearch0302">시군구</label></th>
                            <td>
                                <div class="select_wrap" style="width:157px;">
                                    <select id="formPostalSearch0302" style="width:157px;" onChange="javscript:$('#formPostalSearch0303').val('');">
                                        <option>선택</option>
                                    </select>
                                </div>
                            </td>
                        </tr>
                        <tr>
                            <th sope="row"><label for="formPostalSearch0303">검색어</label></th>
                            <td colspan="3">
                                <input type="text" class="input_text" id="formPostalSearch0303" placeholder="건물명(아파트명)" style="width: 376px;" />
                                <button type="submit" class="btn_black" onClick="javascript:jsPostnum('03')">검색</button>
                            </td>
                        </tr>
                        </tbody>
                    </table>
                </div>
            </div>
            <!-- // 건물명(아파트명) -->

            <!-- // 우편번호 검색 필드 -->

            <!-- 우편번호 검색 결과 // -->
            <div class="postal_code">
                <ul class="postal_code_list" id="postalCodeCont01" name="postalCodeCont01">
                    <!--<li class="postal_code_item">
								<a href="#">
									<input type="hidden" name="addr_v1[]" value="인천광역시 용현동">
									<input type="hidden" name="addr_post1[]" value="402-202">
									<span class="address" onClick="javascript:jsPastepost()";>인천광역시 용현동</span>
									<span class="code">402-202</span>
								</a>
							</li>-->
                </ul>
            </div>
            <!-- // 우편번호 검색 결과 -->
        </div>

        <a href="#layer__postal_code_search_01" data-ui="layer-closer" class="spr-common layer_close" title="레이어 닫기"></a>
    </div>
    <div class="dimd"></div>
</div>
<!-- // 우편번호 검색 레이어 -->


<!--############################################################-->
<!--################## 지역별 추가 배송비 ######################-->
<!--############################################################-->
<?	if(count($cart) != 0){
    $idx = 0;
    foreach($cart as $cart_grp){
        foreach($cart_grp as $row){
            ?>

            <!-- 지역별 추가 배송비 확인 레이어 // -->
            <div class="layer layer__cart_01" id="layer__cart_01_<?=$idx?>">
                <div class="layer_inner">
                    <h1 class="layer_title layer_title__line">지역별 추가 배송비 확인</h1>
                    <div class="layer_cont">
                        <div class="table_basic_type table_basic_type__side_none_border">
                            <table>
                                <caption>제품에 따른 추가 배송비 안내</caption>
                                <colgroup>
                                    <col width="50%" />
                                    <col width="*" />
                                </colgroup>
                                <thead>
                                <tr>
                                    <th scope="col">상품정보</th>
                                    <th scope="col">지역별 추가 배송비</th>
                                </tr>
                                </thead>
                                <tbody>
                                <tr>
                                    <td class="goods_detail__string">
                                        <p class="name"><?=$row['BRAND_NM']?></p>
                                        <p class="description"><?=$row['GOODS_NM']?></p>
                                        <? if(count($cart_grp) != 1){	?>
                                            <p class="shiping_info">외 <?=count($cart_grp)-1?>개의 상품</p>
                                        <? }?>
                                    </td>
                                    <td>
                                        <?// if($row['ADD_DELIVERY']){
                                        //	foreach($row['ADD_DELIVERY'] as $row2){	?>
                                        <!--	<p class="shiping_info"><?/*=$row2['DELIV_AREA_NM']*/?>(선불/수량별배송비부과)</p>
										<p class="shiping_payment">배송비 <?/*=number_format($row2['ADD_DELIV_COST'])*/?>원</p>
										<br />	-->
                                        <?//	}
                                        //}?>
                                        <p class="shiping_info">제주도 및 도서산간지역 추가 운임 발생 가능<br>(수도권 외 지역 추가운임은 상품페이지 내 설명 참조)</p>
                                    </td>
                                </tr>
                                </tbody>
                            </table>
                        </div>
                        <ul class="bullet_list">
                            <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>상품별로 배송비 및 추가배송비가 다르게 적용됩니다.</li>
                            <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>택배사를 통해 배송되는 상품의 경우, 지역별 추가운임을 상품 페이지 내 설명에서 꼭 확인해주십시오.</li>
                            <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>업체직접배송 또는 설치배송 상품의 경우, 사전에 고객님께 연락을 하고 배송 및 설치를 진행하는 과정에서 추가배송비를 확인하실 수 있으며, 일정 기간 내 연락 부재 시 1:1문의 또는 고객센터로 문의하여 주십시오.</li>
                        </ul>
                    </div>

                    <a href="#layer__cart_01_<?=$idx?>" class="spr-common layer_close" data-ui="layer-closer" title="레이어 닫기"></a>
                </div>
                <div class="dimd"></div>
            </div>
            <!-- // 지역별 추가 배송비 확인 레이어 -->
            <? $idx++;
        }
    }
}?>

<!--################################################-->
<!--################## 주소록 ######################-->
<!--################################################-->

<!-- 주소록 레이어 // -->
<div class="layer layer_address_list" id="layer_address_list">
    <div class="layer_inner">
        <h1 class="layer_title">주소록</h1>
        <div class="layer_cont">
            <ul class="radio_check_list address_book_list">
                <? $i=0;
                if($cust_delivery){
                    foreach($cust_delivery as $row){	?>
                        <li class="radio_area radio_check_item">
                            <input type="radio" name="address_book" class="radio" id="formAddressBook_<?=$i?>" value="<?=$i?>" <?if($row['BASE_DELIV_ADDR_YN'] == 'Y'){?>checked="checked"<?}?>/> <label for="formAddressBook_<?=$i?>" class="radio_label"><?=$row['CUST_DELIV_ADDR_NM']?></label>
                            <span class="address">[<?=strlen($row['ZIPCODE']) == '6' ? substr($row['ZIPCODE'],0,3)."-".substr($row['ZIPCODE'],3,3) : $row['ZIPCODE']?>] <?=$row['ADDR1']." ".$row['ADDR2']?></span>
                            <span class="phone_num">휴대폰번호 : <?=$row['MOB_NO']?></span>
                            <input type="hidden" name="cust_zipcode[]"	value="<?=strlen($row['ZIPCODE']) == '6' ? substr($row['ZIPCODE'],0,3)."-".substr($row['ZIPCODE'],3,3) : $row['ZIPCODE']?>">
                            <input type="hidden" name="cust_addr1[]"	value="<?=$row['ADDR1']?>">
                            <input type="hidden" name="cust_addr2[]"	value="<?=$row['ADDR2']?>">
                        </li>
                        <? $i++;
                    }
                } else {?>
                    <br/>
                    주소록에 등록된 주소가 없습니다.	<br/>
                    [마이페이지 > 회원정보 - 배송지관리]에서 주소를 등록해주세요.
                <? }?>
            </ul>

        </div>
        <ul class="btn_list">
            <li><button type="button" class="btn_positive" onClick="javascript:jsUseaddr('C');">적용</button></li>
            <li><button type="button" class="btn_negative" onClick="javascript:$('#layer_address_list').removeClass();
		$('#layer_address_list').addClass('layer layer_address_list');">취소</button></li>
        </ul>
        <a href="#layer_address_list" data-ui="layer-closer" class="spr-common layer_close" title="레이어 닫기"></a>
    </div>
    <div class="dimd"></div>
</div>
<!-- // 주소록 레이어 -->

<!--############################################################-->
<!--################## 쿠폰적용하기 레이어 ######################-->
<!--############################################################-->
<?	if(count($cart) != 0){
    $idx = 0;
    foreach($cart as $cart_grp){
        foreach($cart_grp as $row){
            $seller_coupon_max	= isset($row['SELLER_COUPON_MAX']) ? $row['SELLER_COUPON_MAX'] : 0;
            $item_coupon_max	= isset($row['ITEM_COUPON_MAX']) ? $row['ITEM_COUPON_MAX'] : 0;
            $seller_coupon_amt	= isset($row['SELLER_COUPON_AMT']) ? $row['SELLER_COUPON_AMT'] : 0;
            $item_coupon_amt	= isset($row['ITEM_COUPON_AMT']) ? $row['ITEM_COUPON_AMT'] : 0;

            if($seller_coupon_amt > $seller_coupon_max && $seller_coupon_max != 0){
                $seller_coupon_amt	= $seller_coupon_max * $row['GOODS_CNT'];
            } else {
                $seller_coupon_amt	= $seller_coupon_amt * $row['GOODS_CNT'];
            }

            if($item_coupon_amt > $item_coupon_max && $item_coupon_max != 0){
                $item_coupon_amt	= $item_coupon_max * $row['GOODS_CNT'];
            } else {
                $item_coupon_amt	= $item_coupon_amt * $row['GOODS_CNT'];
            }

//				$goods_price = ($row['SELLING_PRICE']+$row['GOODS_OPTION_ADD_PRICE'])*$row['GOODS_CNT'] - ($seller_coupon_amt + $item_coupon_amt)*$row['GOODS_CNT'];	// 추가 쿠폰 금액 계산을 위해 상품할인금액을 뺀다	2016-07-20 수정
            $goods_price = $row['SELLING_PRICE']*$row['GOODS_CNT'];
            ?>

            <!-- 쿠폰 적용하기 레이어 // -->
            <div class="layer layer__cart_02" id="layer__cart_02_<?=$idx?>">
                <div class="layer_inner">
                    <h1 class="layer_title">쿠폰 적용하기</h1>
                    <div class="layer_cont">
                        <div class="table_basic_type table_basic_type__side_none_border">
                            <table>
                                <caption>적용가능한 쿠폰 테이블 리스트에서 쿠폰을 선택</caption>
                                <colgroup>
                                    <col width="100px" />
                                    <col width="260px" />
                                    <col width="*" />
                                </colgroup>
                                <thead>
                                <tr>
                                    <th scope="col">할인구분</th>
                                    <th scope="col">쿠폰명</th>
                                    <th scope="col">할인액</th>
                                </tr>
                                </thead>
                                <tbody>
                                <tr>
                                    <td class="">
                                        <p>판매자할인</p>
                                    </td>
                                    <td>
                                        <div class="radio_block">
                                            <? $idx2 = 0;
                                            if($row['AUTO_COUPON_LIST']){
                                                foreach($row['AUTO_COUPON_LIST'] as $row2)	{
                                                    if($row2['COUPON_KIND_CD'] == 'SELLER'){

                                                        $row2['COUPON_PRICE'] = $row2['COUPON_DC_METHOD_CD'] == 'RATE' ? floor($row2['COUPON_SALE']/100*$goods_price) : $row2['COUPON_SALE'];

                                                        $row2 = str_replace("\"","&ldquo;",$row2);		//큰따옴표 치환
                                                        ?>
                                                        <input type="radio" name="coupon_select_S<?=$idx?>" class="radio" id="coupon_1_1"  value="<?=$row2['COUPON_CD']?>||<?=$row2['WEB_DISP_DC_COUPON_NM'] == '' ? $row2['DC_COUPON_NM'] : $row2['WEB_DISP_DC_COUPON_NM']?>||<?=($row2['COUPON_PRICE']/$row['GOODS_CNT'])?>||<?=$row2['MAX_DISCOUNT']?>" checked>
                                                        <!-- 쿠폰코드||쿠폰명||할인금액||최대할인금액 -->

                                                        <label for="coupon_1_1" class="radio_label">
                                                            <!--<span class="coupon_name">브랜드쿠폰 3% (또는 300원) 할인</span>	-->
                                                            <span class="coupon_name"><?=$row2['WEB_DISP_DC_COUPON_NM'] == '' ? $row2['DC_COUPON_NM'] : $row2['WEB_DISP_DC_COUPON_NM']?></span>
                                                            <span class="coupon_info"><?=$row2['COUPON_DC_METHOD_CD'] == 'RATE' ? $row2['COUPON_SALE'].'%' : number_format($row2['COUPON_SALE']).'원'?>할인 <?=$row2['MAX_DISCOUNT'] ? "(최대 ".number_format($row2['MAX_DISCOUNT'])."원 할인)" : ""?></span>
                                                        </label>
                                                        <?  $coupon_S_text = $row2['MAX_DISCOUNT'] < ($row2['COUPON_PRICE']/$row['GOODS_CNT']) && $row2['MAX_DISCOUNT'] != 0 ? number_format($row2['MAX_DISCOUNT']*$row['GOODS_CNT']) : number_format($row2['COUPON_PRICE']);
                                                        $idx2++;
                                                    }//END IF
                                                    else if($row2['COUPON_KIND_CD'] != 'GOODS' || count($row['AUTO_COUPON_LIST']) == 1){	?>
                                                        <p>적용 가능한 쿠폰이 없습니다.</p>
                                                        <?
                                                        $coupon_S_text = 0;
                                                    }
                                                }//END FOREACH
                                            }//END IF
                                            else {	?>
                                                <p>적용 가능한 쿠폰이 없습니다.</p>
                                                <?
                                                $coupon_S_text = 0;
                                            }
                                            ?>
                                        </div>
                                    </td>
                                    <!-- 밑에 함수에서 사용쿠폰 표시를 위해 각 상품별 셀러쿠폰이 몇개인지 알려주는 변수 -->
                                    <input type="hidden"	name="seller_coupon_cnt[]"			value="<?=$idx2?>">
                                    <td>
                                        <?=$coupon_S_text?><span class="won">원</span>
                                    </td>
                                </tr>
                                <tr>
                                    <td class="">
                                        <p>에타할인</p>
                                    </td>
                                    <td>
                                        <div class="radio_block">
                                            <? $idx2 = 0;
                                            $ITEM_COUPON_YN = '';
                                            $coupon_E_text = 0;
                                            if($row['AUTO_COUPON_LIST'] || $row['CUST_COUPON_LIST']){
                                                foreach($row['AUTO_COUPON_LIST'] as $row2)	{
                                                    if($row2['COUPON_KIND_CD'] == 'GOODS'){

                                                        $row2['COUPON_PRICE'] = $row2['COUPON_DC_METHOD_CD'] == 'RATE' ? floor($row2['COUPON_SALE']/100*$goods_price) : $row2['COUPON_SALE'];

                                                        $row2 = str_replace("\"","&ldquo;",$row2);		//큰따옴표 치환
                                                        ?>
                                                        <p>
                                                            <input type="radio" name="coupon_select_E<?=$idx?>" class="radio" id="coupon_E<?=$idx?>_<?=$idx2?>" onClick="javascript:Coupon_check('E',this.value,<?=$idx?>,<?=$idx2?>);" value="<?=$row2['COUPON_CD']?>||<?=$row2['WEB_DISP_DC_COUPON_NM'] == '' ? $row2['DC_COUPON_NM'] : $row2['WEB_DISP_DC_COUPON_NM']?>||<?=($row2['COUPON_PRICE']/$row['GOODS_CNT'])?>||<?=$row2['MAX_DISCOUNT']?>||COUPON_I" checked>
                                                            <!-- 쿠폰코드||쿠폰명||할인금액||최대할인금액||아이템쿠폰|| -->

                                                            <label for="coupon_E<?=$idx?>_<?=$idx2?>" class="radio_label">
                                                                <!-- <span class="coupon_name">아이템쿠폰 3% (또는 300원) 할인</span>	-->
                                                                <span class="coupon_name" id="coupon_name_E<?=$idx?>_<?=$idx2?>"><?=$row2['WEB_DISP_DC_COUPON_NM'] == '' ? $row2['DC_COUPON_NM'] : $row2['WEB_DISP_DC_COUPON_NM']?></span>
                                                                <span class="coupon_info"><?=$row2['COUPON_DC_METHOD_CD'] == 'RATE' ? $row2['COUPON_SALE'].'%' : number_format($row2['COUPON_SALE']).'원'?>할인 <?=$row2['MAX_DISCOUNT'] ? "(최대 ".number_format($row2['MAX_DISCOUNT'])."원 할인)" : ""?></span>
                                                            </label>
                                                            <?	$coupon_E_text = $row2['MAX_DISCOUNT'] < ($row2['COUPON_PRICE']/$row['GOODS_CNT']) && $row2['MAX_DISCOUNT'] != 0 ? number_format($row2['MAX_DISCOUNT']*$row['GOODS_CNT']) : number_format($row2['COUPON_PRICE']);	//COUPON_PRICE에 이미 CNT가격포함
                                                            ?>
                                                        </p>
                                                        <?		$ITEM_COUPON_YN = 'Y';
                                                        $idx2++;
                                                    }
                                                }	//END FOREACH
                                                foreach($row['CUST_COUPON_LIST'] as $row2)	{
                                                    if($row2['BUYER_COUPON_DUPLICATE_DC_YN'] == 'N' && $row2['MIN_AMT'] < (($row['SELLING_PRICE']+$row['GOODS_OPTION_ADD_PRICE'])*$row['GOODS_CNT'])){
                                                        $row2['COUPON_PRICE'] = $row2['COUPON_DC_METHOD_CD'] == 'RATE' ? $row2['COUPON_SALE']/100*$goods_price : $row2['COUPON_SALE']*$row['GOODS_CNT'];

                                                        $row2 = str_replace("\"","&ldquo;",$row2);		//큰따옴표 치환

                                                        ?>
                                                        <p>
                                                            <input type="radio" name="coupon_select_E<?=$idx?>" class="radio" id="coupon_E<?=$idx?>_<?=$idx2?>" onClick="javascript:Coupon_check('E',this.value,<?=$idx?>,<?=$idx2?>);" value="<?=$row2['COUPON_CD']?>||<?=$row2['WEB_DISP_DC_COUPON_NM'] == '' ? $row2['DC_COUPON_NM'] : $row2['WEB_DISP_DC_COUPON_NM']?>||<?=$row2['COUPON_PRICE']/$row['GOODS_CNT']?>||<?=$row2['MAX_DISCOUNT']?>||COUPON_B||<?=$row2['BUYER_COUPON_GIVE_METHOD_CD']?>||<?=$row2['BUYER_COUPON_DUPLICATE_DC_YN']?>||<?=$row2['GUBUN']?>||<?=$row2['CUST_COUPON_NO']?>">
                                                            <!-- 쿠폰코드||쿠폰명||할인금액||최대할인금액||바이어쿠폰||쿠폰지급방식||중복여부||쿠폰구분 -->

                                                            <label for="coupon_E<?=$idx?>_<?=$idx2?>" class="radio_label">
                                                                <!-- <span class="coupon_name">아이템쿠폰 3% (또는 300원) 할인</span>	-->
                                                                <span class="coupon_name" id="coupon_name_E<?=$idx?>_<?=$idx2?>"><?=$row2['WEB_DISP_DC_COUPON_NM'] == '' ? $row2['DC_COUPON_NM'] : $row2['WEB_DISP_DC_COUPON_NM']?></span>
                                                                <span class="coupon_info"><?=$row2['COUPON_DC_METHOD_CD'] == 'RATE' ? $row2['COUPON_SALE'].'%' : number_format($row2['COUPON_SALE']).'원'?>할인 <?=$row2['MAX_DISCOUNT'] ? "(최대 ".number_format($row2['MAX_DISCOUNT'])."원 할인)" : ""?></span>
                                                            </label>
                                                            <? if(!$row['AUTO_COUPON_LIST']){
                                                                $coupon_E_text = 0;
                                                            }?>
                                                        </p>
                                                        <?
                                                        if($ITEM_COUPON_YN == ''){
                                                            $ITEM_COUPON_YN = 'N';
                                                        }

                                                        $idx2++;
                                                    }
                                                }	//END FOREACH

                                                if(($row['AUTO_COUPON_LIST'] && ($row['AUTO_COUPON_LIST'][0]['COUPON_KIND_CD'] == 'GOODS') || (@$row['AUTO_COUPON_LIST'][1]['COUPON_KIND_CD'] == 'GOODS')) || $row['CUST_COUPON_LIST']){
                                                    ?>
                                                    <p>
                                                        <input type="radio" name="coupon_select_E<?=$idx?>" class="radio" id="coupon_E<?=$idx?>_<?=$idx2?>" value="" onClick="javascript:Coupon_check('EN',this.value,<?=$idx?>,<?=$idx2?>);"<?if($ITEM_COUPON_YN == 'N'){?>checked<?}?>>
                                                        <label for="coupon_E<?=$idx?>_<?=$idx2?>" class="radio_label">
                                                            <span class="coupon_name">쿠폰 적용 안함</span>
                                                        </label>
                                                    </p>
                                                    <?
                                                } else {	?>
                                                    <p>적용 가능한 쿠폰이 없습니다.</p>
                                                    <?			$coupon_E_text = 0;
                                                }

                                            }	//END IF
                                            else {	?>
                                                <p>적용 가능한 쿠폰이 없습니다.</p>
                                                <?
                                                $coupon_E_text = 0;
                                            }
                                            ?>

                                            <!--		<p>
												<input type="radio" name="coupon_select_E<?=$idx?>" class="radio" id="coupon_2_2" checked>
												<label for="coupon_2_2" class="radio_label">
													<span class="coupon_name">쿠폰이름1 2%(또는 200원) 할인</span>
												</label>
											</p>
											<p>
												<input type="radio" name="coupon_select_E<?=$idx?>" class="radio" id="coupon_2_3" checked>
												<label for="coupon_2_3" class="radio_label">
													<span class="coupon_name">쿠폰이름2 1%(또는 100원) 할인</span>
												</label>
											</p>
											<p>
												<input type="radio" name="coupon_select_E<?=$idx?>" class="radio" id="coupon_2_4" checked>
												<label for="coupon_2_4" class="radio_label">
													<span class="coupon_name">쿠폰 적용 안함</span>
												</label>
											</p>	-->
                                        </div>
                                    </td>
                                    <!-- 밑에 함수에서 사용쿠폰 표시를 위해 각 상품별 셀러쿠폰이 몇개인지 알려주는 변수 -->
                                    <input type="hidden"	name="item_coupon_cnt[]"			value="<?=$idx2?>">
                                    <td>
                                        <span name="coupon_E_text<?=$idx?>"><?=$coupon_E_text?></span><span class="won">원</span>
                                    </td>
                                </tr>
                                <!--	<tr id="dup_coupon_0<?=$idx?>" style="display:none">
									<td class="">
										<p>에타중복할인</p>
									</td>
									<td>
										<div class="radio_block">
											<p>적용 가능한 쿠폰이 없습니다.</p>
										</div>
									</td>
									<td>
										0<span class="won">원</span>
									</td>
								</tr>	-->
                                <tr id="dup_coupon_<?=$idx?>">
                                    <td class="">
                                        <p>에타중복할인</p>
                                    </td>
                                    <td>
                                        <div class="radio_block">

                                            <? $idx2 = 0;
                                            if($row['CUST_COUPON_LIST']){
                                                foreach($row['CUST_COUPON_LIST'] as $row2)	{
                                                    if($row2['BUYER_COUPON_DUPLICATE_DC_YN'] == 'Y' && $row2['MIN_AMT'] < (($row['SELLING_PRICE']+$row['GOODS_OPTION_ADD_PRICE'])*$row['GOODS_CNT'])){	//최소금액 이상일때 보임

                                                        $row2['COUPON_PRICE'] = $row2['COUPON_DC_METHOD_CD'] == 'RATE' ? $row2['COUPON_SALE']/100*$goods_price : $row2['COUPON_SALE']*$row['GOODS_CNT'];

                                                        $row2 = str_replace("\"","&ldquo;",$row2);		//큰따옴표 치환
                                                        ?>
                                                        <p>
                                                            <input type="radio" name="coupon_select_C<?=$idx?>" class="radio" id="coupon_C<?=$idx?>_<?=$idx2?>" onClick="javascript:Coupon_check('C',this.value,<?=$idx?>,<?=$idx2?>);" value="<?=$row2['COUPON_CD']?>||<?=$row2['WEB_DISP_DC_COUPON_NM'] == '' ? $row2['DC_COUPON_NM'] : $row2['WEB_DISP_DC_COUPON_NM']?>||<?=$row2['COUPON_PRICE']/$row['GOODS_CNT']?>||<?=$row2['MAX_DISCOUNT'] ? $row2['MAX_DISCOUNT'] : 0?>||<?=$row2['COUPON_DTL_NO']?>||<?=$row2['BUYER_COUPON_GIVE_METHOD_CD']?>||<?=$row2['BUYER_COUPON_DUPLICATE_DC_YN']?>||<?=$row2['GUBUN']?>||<?=$row2['CUST_COUPON_NO']?>">
                                                            <?// var_dump($row2['GUBUN']);?>
                                                            <!-- 쿠폰코드||쿠폰명||할인금액||최대할인금액||쿠폰번호||쿠폰지급방식||중복여부||쿠폰구분-->
                                                            <label for="coupon_C<?=$idx?>_<?=$idx2?>" class="radio_label">
                                                                <!--	<span class="coupon_name">쿠폰이름3 10%(또는 1,000원) 할인</span>-->
                                                                <span class="coupon_name" id="coupon_name_C<?=$idx?>_<?=$idx2?>"><?=$row2['WEB_DISP_DC_COUPON_NM'] == '' ? $row2['DC_COUPON_NM'] : $row2['WEB_DISP_DC_COUPON_NM']?></span>
                                                                <span class="coupon_info"><?=$row2['COUPON_DC_METHOD_CD'] == 'RATE' ? $row2['COUPON_SALE'].'%' : number_format($row2['COUPON_SALE']).'원'?>할인 <?=$row2['MAX_DISCOUNT'] ? "(최대 ".number_format($row2['MAX_DISCOUNT'])."원 할인)" : ""?></span>
                                                            </label>
                                                        </p>
                                                        <? $idx2++;
                                                    }	//END IF
                                                } //END FOREACH

                                                if($idx2>0){	//최소금액 이상일때 보임?>
                                                    <p>
                                                        <input type="radio" name="coupon_select_C<?=$idx?>" class="radio" id="coupon_C<?=$idx?>_<?=$idx2?>" value="" onClick="javascript:Coupon_check('CN',this.value,<?=$idx?>,<?=$idx2?>);" checked>
                                                        <label for="coupon_C<?=$idx?>_<?=$idx2?>" class="radio_label">
                                                            <span class="coupon_name">쿠폰 적용 안함</span>
                                                        </label>
                                                    </p>
                                                <? } else {	?>
                                                    <input type="hidden" name="coupon_select_C<?=$idx?>" id="coupon_C<?=$idx?>_<?=$idx2?>" value="">
                                                    <p>적용 가능한 쿠폰이 없습니다.</p>
                                                <? } ?>
                                                <?
                                                $coupon_C_text = 0;
                                            } //END IF
                                            else {?>
                                                <input type="hidden" name="coupon_select_C<?=$idx?>" id="coupon_C<?=$idx?>_<?=$idx2?>" value="">
                                                <p>적용 가능한 쿠폰이 없습니다.</p>
                                                <?
                                                $coupon_C_text = 0;
                                            } ?>

                                            <!--	<p>
												<input type="radio" name="coupon_select_C<?=$idx?>" class="radio" id="coupon_3_2" checked>
												<label for="coupon_3_2" class="radio_label">
													<span class="coupon_name">쿠폰이름4 2%(또는 200원) 할인</span>
												</label>
											</p>
											<p>
												<input type="radio" name="coupon_select_C<?=$idx?>" class="radio" id="coupon_3_3" checked>
												<label for="coupon_3_3" class="radio_label">
													<span class="coupon_name">쿠폰 적용 안함</span>
												</label>
											</p>	-->
                                        </div>
                                    </td>
                                    <!-- 밑에 함수에서 사용쿠폰 표시를 위해 각 상품별 추가쿠폰이 몇개인지 알려주는 변수 -->
                                    <input type="hidden"	name="add_coupon_cnt[]"			value="<?=$idx2?>">
                                    <td>
                                        <span name="coupon_C_text<?=$idx?>"><?=$coupon_C_text?></span><span class="won">원</span>
                                    </td>
                                </tr>
                                <!-- seller & item value :: 쿠폰코드||쿠폰명||할인금액||최대할인금액)
                                     cust value :: 쿠폰코드||쿠폰명||할인금액||최대할인금액||쿠폰번호||쿠폰지급방식||중복여부)	-->
                                <input type="hidden" name="goods_seller_coupon_<?=$idx?>"		value="">
                                <input type="hidden" name="goods_item_coupon_<?=$idx?>"		value="">
                                <input type="hidden" name="goods_cust_coupon_<?=$idx?>"		value="">
                                <tr class="total_coupon_payment">
                                    <th scope="row" colspan="2">
                                        쿠폰할인 총액
                                    </th>
                                    <td>
                                        <span name="coupon_total_amt_<?=$idx?>"><?=number_format(($seller_coupon_amt+$item_coupon_amt))?></span><span class="won">원</span>
                                    </td>
                                </tr>
                                </tbody>
                            </table>
                        </div>
                        <ul class="bullet_list">
                            <li class="bullet_item"><span class="spr-common spr_bg_dot02"></span>할인쿠폰은 판매가 기준으로 할인율 적용됩니다.</li>
                        </ul>
                    </div>
                    <ul class="btn_list">
                        <li><button type="button" class="btn_positive" onClick="javascript:Coupon_apply(<?=$idx?>);">쿠폰적용</button></li>
                        <li><button type="button" class="btn_negative" onClick="javascript:jsReset(<?=$idx?>,'CPN');">적용취소</button></li>
                    </ul>
                    <a href="" onClick="javascript:jsReset(<?=$idx?>,'CPN');" class="spr-common layer_close" data-ui="layer-closer" title="레이어 닫기"></a>
                </div>
                <div class="dimd"></div>
            </div>
            <!-- // 쿠폰 적용하기 레이어 -->
            <?	 $idx ++;
        }
    }
}?>

<!-- //KCP 결제용
/* ============================================================================== */
/* =   2. 가맹점 필수 정보 설정                                                 = */
/* = -------------------------------------------------------------------------- = */
/* =   ※ 필수 - 결제에 반드시 필요한 정보입니다.                               = */
/* =   site_conf_inc.php 파일을 참고하셔서 수정하시기 바랍니다.                 = */
/* = -------------------------------------------------------------------------- = */
// 요청종류 : 승인(pay)/취소,매입(mod) 요청시 사용
-->
<form name="order_info" id="order_info" method="post" action="/order/kcpCli">
    <input type="hidden" name="pay_method" />
    <input type="hidden" name="ordr_idxx" />
    <input type="hidden" name="good_name" value="<?=$goods_name ?>" />
    <input type="hidden" name="good_mny" value="<?=$total_goods_price - $total_discount_price + $total_delivery_price?>" />
    <input type="hidden" name="buyr_name" />
    <input type="hidden" name="buyr_mail" />
    <input type="hidden" name="buyr_tel1" />
    <input type="hidden" name="buyr_tel2" />
    <input type="hidden" name="req_tx"          value="pay" />
    <input type="hidden" name="site_cd"         value="<?=$g_conf_site_cd	?>" />
    <input type="hidden" name="site_name"       value="<?=$g_conf_site_name ?>" />
    <input type="hidden" name="quotaopt"        value="12"/>
    <input type="hidden" name="currency"        value="WON"/>
    <input type="hidden" name="module_type"     value="<?=$module_type ?>"/>
    <input type="hidden" name="res_cd"          value=""/>
    <input type="hidden" name="res_msg"         value=""/>
    <input type="hidden" name="enc_info"        value=""/>
    <input type="hidden" name="enc_data"        value=""/>
    <input type="hidden" name="ret_pay_method"  value=""/>
    <input type="hidden" name="tran_cd"         value=""/>
    <input type="hidden" name="use_pay_method"  value=""/>
    <input type="hidden" name="ordr_chk"        value=""/>
    <!--  현금영수증 관련 정보 : Payplus Plugin 에서 설정하는 정보입니다 -->
    <input type="hidden" name="cash_yn"         value=""/>
    <input type="hidden" name="cash_tr_code"    value=""/>
    <input type="hidden" name="cash_id_info"    value=""/>
    <!-- 2012년 8월 18일 전자상거래법 개정 관련 설정 부분 -->
    <!-- 제공 기간 설정 0:일회성 1:기간설정(ex 1:2012010120120131)  -->
    <input type="hidden" name="good_expr"		value="0">
    <input type="hidden" name="kcp_noint"       value=""/>

    <!-- 에스크로 사용 여부 : 반드시 Y 로 설정 -->
    <input type="hidden" name="escw_used"       value="Y"/>
    <!-- 에스크로 결제처리 모드 : 에스크로: Y, 일반: N, KCP 설정 조건: O  -->
    <input type="hidden" id="pay_mod" name="pay_mod"         value="N"/>
    <!-- 배송 소요일 : 예상 배송 소요일을 입력 -->
    <input type="hidden"  name="deli_term" value="03"/>
    <!-- 장바구니 상품 개수 : 장바구니에 담겨있는 상품의 개수를 입력(good_info의 seq값 참조) -->
    <input type="hidden"  id="bask_cntx" name="bask_cntx" value="<?=$ascw_good_cnt?>"/>
    <!-- 장바구니 상품 상세 정보 (자바 스크립트 샘플 create_goodInfo()가 온로드 이벤트시 설정되는 부분입니다.) -->
    <input type="hidden" id="good_info" name="good_info"  value="<?=$ascw_good_info?>"/>
    <!-- KCP 로그 데이터 정보 코드 -->
    <input type="hidden" id="kcp_log_data" name="kcp_log_data" value=""/>
    <?
    /* ============================================================================== */
    /* =   1-2. 에스크로 정보                                                       = */
    /* = -------------------------------------------------------------------------- = */
    /* =   에스크로 사용업체에 적용되는 정보입니다.                                 = */
    /* = -------------------------------------------------------------------------- = */
    ?>
    <input type="hidden" name="rcvr_name" value=""/>
    <input type="hidden" name="rcvr_tel1" value=""/>
    <input type="hidden" name="rcvr_tel2" value=""/>
    <input type="hidden" name="rcvr_mail" value="" size="30" maxlength="30" />
    <input type="hidden" name="rcvr_zipx" value=""/>
    <input type="hidden" name="rcvr_add1" value=""/>
    <input type="hidden" name="rcvr_add2" value=""/>
    <?
    /* ============================================================================== */
    /* =   1-3. ARS 정보                                                       = */
    /* = -------------------------------------------------------------------------- = */
    /* =   ARS 가상번호 결제요청시 적용되는 정보입니다.                          = */
    /* = -------------------------------------------------------------------------- = */
    ?>
    <input type="hidden" name="phon_mny" value="<?=$total_goods_price - $total_discount_price + $total_delivery_price?>" />
    <input type="hidden" name="phon_no" value="">
    <input type="hidden" name="comm_id" value="">
    <input type="hidden" name="expr_dt" value="">
    <input type="hidden" name="cert_flg" value ="">

</form>

<script type="text/javascript" src="https://service.iamport.kr/js/iamport.payment-1.1.1.js"></script>
<script src="/assets/js2/cart_coupon.js"></script>
<script type="text/javascript">
    $(document).ready(function(){
        //google_gtag

        var cartDataCnt		= "<?=$idx?>";
        var cartItemsArray  = new Array();
        var cartItems		= new Object();

        for (var a=0; a<cartDataCnt; a++)
        {
            var cartItems	= new Object();

            var brand  = '['+document.getElementsByName("brand_code[]")[a].value + ']'+document.getElementsByName("brand_name[]")[a].value;
            var option = '['+document.getElementsByName("goods_option_code[]")[a].value+']'+document.getElementsByName("goods_option_name[]")[a].value;

            cartItems.id	= document.getElementsByName("goods_code[]")[a].value;
            cartItems.name	= document.getElementsByName("goods_name[]")[a].value;
            cartItems.list_name	= "CheckOut list";
            cartItems.brand	= brand;
            cartItems.variant	= option;
            cartItems.quantity	= document.getElementsByName("goods_cnt[]")[a].value;
            cartItems.price	= document.getElementsByName("goods_selling_price[]")[a].value;

            cartItemsArray.push(cartItems);
        }

//        console.log(cartItemsArray);
        gtag('event', 'begin_checkout', {
            "items": cartItemsArray,
            "coupon": ""
        });
    });

    /******************************************************/
    /** 쿠폰 관련 함수는 /assets/js2/cart_coupon.js 참고 **/
    /******************************************************/
    var cart_cnt = "<?=$idx?>";

    //var IMP = window.IMP;
    //IMP.init('imp46808156'); // 'iamport' 대신 부여받은 "가맹점 식별코드"를 사용.

    /*******************/
    /** 레이어 초기화 **/
    /*******************/
    function jsReset(idx,gb){
        if(gb == 'OPT'){
            $($("span[name='chk_option_name[]']").get(idx)).text(document.getElementsByName("goods_option_name[]")[idx].value);
//		alert(document.getElementsByName("moption1[]")[idx].value);
            document.getElementsByName("moption1[]")[idx].value = document.getElementsByName("goods_option_code[]")[idx].value+"||"+document.getElementsByName("goods_option_add_price[]")[idx].value+"||"+document.getElementsByName("goods_option_qty[]")[idx].value;
//		alert(document.getElementsByName("goods_option_code[]")[idx].value+"||"+document.getElementsByName("goods_option_add_price[]")[idx].value+"||"+document.getElementsByName("goods_option_qty[]")[idx].value);
            document.getElementsByName("option_cnt[]")[idx].value = document.getElementsByName("goods_cnt[]")[idx].value;
            $("input[name=dup_option]").val('N');
            $($("span[name='duplicate_option[]']").get(idx)).html('');
            document.getElementsByName("total_option_price[]")[idx].innerText = numberFormat((parseInt(document.getElementsByName("goods_selling_price[]")[idx].value) + parseInt(document.getElementsByName("goods_option_add_price[]")[idx].value)) * parseInt(document.getElementsByName("goods_cnt[]")[idx].value));

            $("#layer__cart_03_"+idx).attr('class','layer layer__cart_03');	//레이어 닫기
        } else if(gb == 'CPN'){
            var total_coupon_price	= parseInt(document.getElementsByName("goods_discount_price[]")[idx].value)*parseInt($($("input[name='goods_cnt[]']").get(idx)).val());
            var item_coupon_max		= parseInt(0);
            var item_coupon_amt		= parseInt(0);
            var item_coupon_checked_id	= '';
            var item_coupon_checked_tid = '';
            var item_coupon_checked_name = '';
            var cust_coupon_max		= parseInt(0);
            var cust_coupon_amt		= parseInt(0);

            for(var i=0; i<cart_cnt; i++){		//체크한 쿠폰 원래대로
                if(i == idx){
                    var goods_cnt	= parseInt($($("input[name='goods_cnt[]']").get(idx)).val());	//상품갯수

                    if($($("input[name='item_coupon_cnt[]']").get(idx)).val() > 0){	//아이템쿠폰이 하나라도 있을경우 체크재점검
                        for(k=0; k<document.getElementsByName("coupon_select_E"+i).length; k++){
                            document.getElementsByName("coupon_select_E"+i)[k].checked = false;
                        }
//===2016-10-06 중복불가쿠폰은 에타할인으로
                        for(var j=0; j<$($("input[name='item_coupon_cnt[]']").get(i)).val(); j++){
                            if($($("input[name='goods_coupon_code_i[]']").get(idx)).val() == $("#coupon_E"+i+"_"+j).val().split("||")[0]){
                                $("#coupon_E"+i+"_"+j).prop('checked', true);
                                $("#coupon_E"+i+"_"+j).prop('disabled', false);
                                $("#coupon_name_E"+i+"_"+j).html($("#coupon_E"+i+"_"+j).val().split("||")[1]);

                                item_coupon_max	= parseInt($("#coupon_E"+i+"_"+j).val().split("||")[3]);
                                item_coupon_amt	= parseInt($("#coupon_E"+i+"_"+j).val().split("||")[2]);
                                item_coupon_kind	= parseInt($("#coupon_E"+i+"_"+j).val().split("||")[4]);

                                if(item_coupon_kind	== 'COUPON_B'){
                                    if( item_coupon_max < (item_coupon_amt*goods_cnt) && item_coupon_max != 0){
                                        item_coupon_amt = item_coupon_max;
                                    } else {
                                        item_coupon_amt = item_coupon_amt*goods_cnt;
                                    }
                                } else {
                                    if( item_coupon_max < (item_coupon_amt) && item_coupon_max != 0){
                                        item_coupon_amt = item_coupon_max*goods_cnt;
                                    } else {
                                        item_coupon_amt = item_coupon_amt*goods_cnt;
                                    }

                                }
                                $("span[name=coupon_E_text"+i+"]").text(numberFormat(item_coupon_amt));

                                $("#dup_coupon_"+idx).show();
                                break;
                            } else if($($("input[name='goods_coupon_code_i[]']").get(idx)).val() == ""){	//아이템쿠폰 사용안함
                                if($($("input[name='goods_add_coupon_code[]']").get(idx)).val() == ''){	//고객쿠폰쪽도 비어있을경우
                                    $("input[name='coupon_select_E"+idx+"']:input[value='']").prop('checked', true);
//								$("#coupon_E"+i+"_"+j).prop('disabled', false);
//								$("#coupon_name_E"+i+"_"+j).html($("#coupon_E"+i+"_"+j).val().split("||")[1]);
                                    $("span[name=coupon_E_text"+i+"]").text(0);

                                    $("#dup_coupon_"+idx).show();
                                    break;
                                } else {	//고객쿠폰이 있음
//								alert("aa");
//								alert($($("input[name='goods_add_coupon_code[]']").get(idx)).val());
//								alert($("#coupon_E"+i+"_"+j).val().split("||")[0]);
                                    if($($("input[name='goods_add_coupon_code[]']").get(idx)).val() == $("#coupon_E"+i+"_"+j).val().split("||")[0]){
//									alert("bb");
                                        $("#coupon_E"+i+"_"+j).prop('checked', true);
                                        $("#coupon_E"+i+"_"+j).prop('disabled', false);
                                        $("#coupon_name_E"+i+"_"+j).html($("#coupon_E"+i+"_"+j).val().split("||")[1]);

                                        item_coupon_max	= parseInt($("#coupon_E"+i+"_"+j).val().split("||")[3]);
                                        item_coupon_amt	= parseInt($("#coupon_E"+i+"_"+j).val().split("||")[2]);
                                        if( item_coupon_max < (item_coupon_amt*goods_cnt) && item_coupon_max != 0){
                                            item_coupon_amt = item_coupon_max;
                                        } else {
                                            item_coupon_amt = item_coupon_amt*goods_cnt;
                                        }
                                        $("span[name=coupon_E_text"+i+"]").text(numberFormat(item_coupon_amt));

                                        total_coupon_price += item_coupon_amt;

                                        $("#dup_coupon_"+idx).hide();
                                        break;
                                    } else if(j==$($("input[name='item_coupon_cnt[]']").get(i)).val()-1) {	//아이템쿠폰의 고객쿠폰은 아님
                                        $("input[name='coupon_select_E"+idx+"']:input[value='']").prop('checked', true);
//									$("#coupon_E"+i+"_"+j).prop('disabled', false);
//									$("#coupon_name_E"+i+"_"+j).html($("#coupon_E"+i+"_"+j).val().split("||")[1]);
                                        $("span[name=coupon_E_text"+i+"]").text(0);

                                        $("#dup_coupon_"+idx).show();
                                        break;
                                    }
                                }
                            }
                        }
                    }

                    if($($("input[name='add_coupon_cnt[]']").get(idx)).val() > 0){	//에타중복쿠폰 하나라도 있을경우 체크재점검
                        for(k=0; k<document.getElementsByName("coupon_select_C"+i).length; k++){
                            document.getElementsByName("coupon_select_C"+i)[k].checked = false;
                        }

//===2016-10-06 중복불가쿠폰은 에타할인으로
                        for(var j=0; j<$($("input[name='add_coupon_cnt[]']").get(i)).val(); j++){

                            if($($("input[name='goods_add_coupon_code[]']").get(idx)).val() == $("#coupon_C"+i+"_"+j).val().split("||")[0]){
                                $("#coupon_C"+i+"_"+j).prop('checked', true);
                                cust_coupon_max	= parseInt($("#coupon_C"+i+"_"+j).val().split("||")[3]);
                                cust_coupon_amt	= parseInt($("#coupon_C"+i+"_"+j).val().split("||")[2]);
                                if( cust_coupon_max < (cust_coupon_amt*goods_cnt) && cust_coupon_max != 0){
//                                cust_coupon_amt = cust_coupon_amt*goods_cnt;
                                    cust_coupon_amt = cust_coupon_max;
                                } else {
                                    cust_coupon_amt = cust_coupon_amt*goods_cnt;
                                }
                                total_coupon_price += cust_coupon_amt;

                                break;
                            } else if($($("input[name='goods_add_coupon_code[]']").get(idx)).val() == ""){	//중복쿠폰사용x
                                $("input[name='coupon_select_C"+idx+"']:input[value='']").prop('checked', true);

                                break;
                            }
                        }	//END FOR

//===2019-09-25 장바구니->결제페이지 넘어올때 사용중인 쿠폰 표시
                        for(var j=0; j<$($("input[name='add_coupon_cnt[]']").get(i)).val(); j++) {
                            for (var a = 0; a < cart_cnt; a++) {
                                if( $($("input[name='goods_add_coupon_code[]']").get(a)).val() != '' ){ //적용중인 쿠폰 있는 경우만
                                    if( $("#coupon_C" + i + "_" + j).val().split("||")[7] == 'CUST' ) { //구매자 고객쿠폰일때
                                        if( $($("input[name='goods_add_coupon_code[]']").get(a)).val() == $("#coupon_C" + i + "_" + j).val().split("||")[0] ) {
                                            if($("#coupon_C"+i+"_"+j).is(":checked")) {
                                                //체크되어있을때 무시
                                            } else {
                                                //쿠폰 사용중 표시
                                                $("#coupon_C"+i+"_"+j).prop('disabled', true);
                                                $("#coupon_name_C"+i+"_"+j).html("<s>"+$("#coupon_C"+i+"_"+j).val().split("||")[1]+"</s><font color=red> (사용중)</font>");
                                            }
                                        }	//END if
                                    }	//END if
                                }	//END if
                            }//END FOR
                        }//END FOR

                    }
                }	//END if
            }	//END for

            $("span[name='coupon_C_text"+idx+"']").text(numberFormat(cust_coupon_amt));	//할인액 재계산
            $("span[name='coupon_total_amt_"+idx+"']").text(numberFormat(total_coupon_price));		//총 재계산
            $("#layer__cart_02_"+idx).attr('class','layer layer__cart_02');			//레이어 닫기
        }	//END else if
    }	//END function


    /*********************************/
    /***** 가격 재계산 ***************/
    /*********************************/
    var total_sum_price = function()
    {
        var total_delivery_price		= parseInt($('input[name=total_delivery_money]').val());	//전체 배송비(기본+추가)
        var total_goods_selling_price	= 0;	//기존 상품금액 합
        var total_goods_discount_price	= 0;	//기존 상품할인금액 합
        var total_goods_add_discount_price = 0; //기존 상품추가할인금액 합
        var use_mileage					= parseInt($("input[name=use_mileage]").val());
        var cart_coupon_price			= parseInt($("input[name=cart_coupon_amt").val());
        var brand_price			        = parseInt(renumberFormat($("input[name=brand_price").val()));  //브랜드할인(셀러쿠폰액)

        for(i=0; i<document.getElementsByName("goods_code[]").length; i++){
            total_goods_selling_price += (parseInt($($("input[name='goods_selling_price[]']").get(i)).val())+parseInt($($("input[name='goods_option_add_price[]']").get(i)).val()))*parseInt($($("input[name='goods_cnt[]']").get(i)).val());		//기존 상품금액 합

            total_goods_discount_price += parseInt($($("input[name='goods_discount_price[]']").get(i)).val())*parseInt($($("input[name='goods_cnt[]']").get(i)).val());		//기존 상품할인금액 합

            total_goods_add_discount_price += parseInt($($("input[name='goods_add_discount_price[]']").get(i)).val());	//기존 상품추가할인금액 합
        }

        //히든값 변경
        $('input[name=total_order_money]').val(total_goods_selling_price);
        $('input[name=total_discount_money]').val(total_goods_discount_price + total_goods_add_discount_price + cart_coupon_price);
        $('input[name=total_payment_money]').val(total_goods_selling_price - total_goods_discount_price - total_goods_add_discount_price - cart_coupon_price - use_mileage + total_delivery_price);


        //보이는 정보 변경
//	$('span[name=payment_price]').text(numberFormat(total_goods_selling_price - total_goods_discount_price - total_goods_add_discount_price - cart_coupon_price - use_mileage + total_delivery_price));		//결제예정금액(상단)

        $('span[name=discount_price]').text(numberFormat(total_goods_discount_price + total_goods_add_discount_price + cart_coupon_price));		//최종 할인금액(상단)

        $('span[name=payment_price]').text(numberFormat(total_goods_selling_price - total_goods_discount_price - total_goods_add_discount_price - cart_coupon_price + total_delivery_price));		//결제예정금액(상단)

        $('input[name=discount_price]').val(numberFormat(total_goods_discount_price + total_goods_add_discount_price + cart_coupon_price - brand_price));		//에타할인(하단)

        $('span[name=finally_discount_price]').text(numberFormat(total_goods_discount_price + total_goods_add_discount_price + cart_coupon_price));		//최종 할인금액 (하단)

        $('span[name=finally_payment_mileage]').text(numberFormat(use_mileage));		//사용 마일리지

        $('span[name=finally_payment_price]').text(numberFormat(total_goods_selling_price - total_goods_discount_price - total_goods_add_discount_price - cart_coupon_price - use_mileage + total_delivery_price));		//결제예정금액(하단)

        $('input[name=good_mny]').val(total_goods_selling_price - total_goods_discount_price - total_goods_add_discount_price - cart_coupon_price - use_mileage + total_delivery_price);

        $('input[name=phon_mny]').val(total_goods_selling_price - total_goods_discount_price - total_goods_add_discount_price - cart_coupon_price - use_mileage + total_delivery_price);    //ARS 결제 요청 금액(히든값)
    }


    /*******************************************/
    /** 고객 쿠폰 선택시 적용될 금액 미리보기 **/
    /*******************************************/
    function jsSelectCoupon(coupon_val){
        if(coupon_val != "0"){
            if(parseInt(coupon_val.split("||")[0]) >= parseInt(coupon_val.split("||")[1]) && parseInt(coupon_val.split("||")[1]) != 0){	//최대 할인 금액이 있을경우
                $('span[name=cart_coupon_sale_price]').text(numberFormat(parseInt(coupon_val.split("||")[1])));
            } else {
                $('span[name=cart_coupon_sale_price]').text(numberFormat(parseInt(coupon_val.split("||")[0])));
            }
        } else {
            $('span[name=cart_coupon_sale_price]').text(0);
        }
    }

    //===============================================================
    // 고객 쿠폰 적용하기
    //===============================================================
    function jsApplyCoupon(){
        if($('input:radio[name="coupon_select"]:checked').val() != "0"){
            if(parseInt($('input:radio[name="coupon_select"]:checked').val().split("||")[0]) >= parseInt($('input:radio[name="coupon_select"]:checked').val().split("||")[1]) && parseInt($('input:radio[name="coupon_select"]:checked').val().split("||")[1]) != 0){	//최대 할인 금액이 있을경우
                $("input[name=cart_coupon_amt]").val($('input:radio[name="coupon_select"]:checked').val().split("||")[1]);	//히든값(적용가격)
                $("#formDcCoupon").val(numberFormat($('input:radio[name="coupon_select"]:checked').val().split("||")[1]));
            } else {
                $("input[name=cart_coupon_amt]").val($('input:radio[name="coupon_select"]:checked').val().split("||")[0]);	//히든값(적용가격)
                $("#formDcCoupon").val(numberFormat($('input:radio[name="coupon_select"]:checked').val().split("||")[0]));
            }

            //히든값 넣기
            $("input[name=cart_coupon_code]").val($('input:radio[name="coupon_select"]:checked').val().split("||")[2]);	//쿠폰코드
            $("input[name=cart_coupon_num]").val($('input:radio[name="coupon_select"]:checked').val().split("||")[4]);	//쿠폰번호
        } else {
            //히든값 넣기
            $("input[name=cart_coupon_amt]").val(0);	//쿠폰적용가
            $("input[name=cart_coupon_code]").val('');	//쿠폰코드
            $("input[name=cart_coupon_num]").val('');	//쿠폰번호
            $("#formDcCoupon").val(0);
        }

        //금액 재계산
        total_sum_price();

        $('#layer__cart_02').removeClass();
        $('#layer__cart_02').addClass('layer layer__cart_02');
    }

    //===============================================================
    // 마일리지 적용
    //===============================================================
    function jsUsemileage(){
        var cust_mileage = "<?=$mileage?>";
        var use_mileage	 = parseInt(renumberFormat($("#formDcMileage").val()));

        if(parseInt(cust_mileage) < use_mileage){
            alert("보유하고 계신 마일리지보다 많은 마일리지를 적용하실 수 없습니다.");
            $("#formDcMileage").val(numberFormat($("input[name=use_mileage]").val()));
            return false;
        }

        if(parseInt(cust_mileage) < 1000){
            alert("마일리지 보유금액 1,000P이상부터 사용가능합니다.");
            $("#formDcMileage").val(numberFormat($("input[name=use_mileage]").val()));
            return false;
        }

//	if(parseInt(use_mileage) < 1000 && parseInt(use_mileage) != 0){
//		alert("마일리지는 1,000P부터 사용 가능합니다.");
//		$("#formDcMileage").val(numberFormat($("input[name=use_mileage]").val()));
//		return false;
//	}
//
//	if(parseInt(use_mileage)%1000 != 0){
//		alert("마일리지는 1,000P 단위로 사용할 수 있습니다.");
//		$("#formDcMileage").val(numberFormat($("input[name=use_mileage]").val()));
//		return false;
//	}

        if(parseInt(use_mileage) > $("input[name=total_payment_money]").val()){
            alert("결제 금액보다 사용하시려는 마일리지가 큽니다.");
            $("#formDcMileage").val(numberFormat($("input[name=use_mileage]").val()));
            return false;
        }

        $("input[name=use_mileage]").val(use_mileage);
        $("#formDcMileage").val(numberFormat(use_mileage));

        //가격 재계산
        total_sum_price();
    }

    /*****************/
    /** 천단위 콤마 **/
    /*****************/
    function numberFormat(num) {
        num = String(num);
        return num.replace(/(\d)(?=(?:\d{3})+(?!\d))/g,"$1,");
    }

    /**********************/
    /** 천단위 콤마 제거 **/
    /**********************/
    function renumberFormat(num){
        return num.replace(/^\$|,/g, "") + ""
    }

    /**********************/
    /**** 숫자만 입력 *****/
    /**********************/
    function OnlyNumber(){
        if((event.keyCode<48)||(event.keyCode>57)){
            event.returnValue=false;
        }
    }

    /**************************/
    /**** 콤보박스 초기화 *****/
    /**************************/
    function initCombo(pObj, pTitle)
    {
        for (var i = document.getElementById(pObj).length; i >=0; i-- ){
            document.getElementById(pObj)[i] = null;
        }

        var option 		= document.createElement("option");
        option.value 	= "";
        option.text 	= pTitle;
        document.getElementById(pObj).appendChild(option);
        document.getElementById(pObj).value = "";
    }

    /*********************************/
    /***** 전화번호 없음 체크시 ******/
    /*********************************/
    $(function(){
        $("input:checkbox[name='phone_yn']").on('click', function(e) {
            if($("input:checkbox[name='phone_yn']").is(":checked") == true){
                $("input:checkbox[name='phone_yn']").val('N');
                $('select[name=order_phone1]').val('');
                $('input[name=order_phone2]').val('');
                $('input[name=order_phone3]').val('');
                $('select[name=order_phone1]').attr('disabled', true);		//전화번호 입력 비활성화
                $('input[name=order_phone2]').attr('disabled', true);
                $('input[name=order_phone3]').attr('disabled', true);
            } else {
                $("input:checkbox[name='phone_yn']").val('Y');
                $('select[name=order_phone1]').attr('disabled', false);		//전화번호 입력 활성화
                $('input[name=order_phone2]').attr('disabled', false);
                $('input[name=order_phone3]').attr('disabled', false);
            }
        })
    });

    /*********************************/
    /******* 가구 배송정보 동의 체크 */
    /*********************************/
    $(function(){
        $("input:checkbox[id='formShippingAddress0103']").on('click', function(e) {
            if($("input:checkbox[id='formShippingAddress0103']").is(":checked") == true){
                $("input:checkbox[id='formShippingAddress0103']").val('Y');
            } else {
                $("input:checkbox[id='formShippingAddress0103']").val('N');
            }
        })
    });

    $(function(){
        $("input:checkbox[id='formShippingAddress0203']").on('click', function(e) {
            if($("input:checkbox[id='formShippingAddress0203']").is(":checked") == true){
                $("input:checkbox[id='formShippingAddress0203']").val('Y');
            } else {
                $("input:checkbox[id='formShippingAddress0203']").val('N');
            }
        })
    });

    $(function(){
        $("input:checkbox[id='formShippingAddress0401']").on('click', function(e) {
            if($("input:checkbox[id='formShippingAddress0401']").is(":checked") == true){
                $("input:checkbox[id='formShippingAddress0401']").val('Y');
            } else {
                $("input:checkbox[id='formShippingAddress0401']").val('N');
            }
        })
    });

    /***********************************/
    /********* 결제수단 선택 ***********/
    /***********************************/
    function jsChgpaymethod(gb){
        if(gb == '01'){	//카드 결제시
            $("#btn_kcp"    ).show();
            $("#credit_info").show();

            $("#formEscrow" ).hide();

            $("#external_paytype").hide();
            $("#btn_external"    ).hide();

            $("#btn_ars").hide();
            $("#kakao_info").hide();
            $("#btn_kakao" ).hide();

            $("input:checkbox[name='Escorw_yn']").prop('checked', false);		//에스크로 여부 초기화
            $("input:checkbox[name='Escorw_yn']").val('N');

            $(".refundInfoForm").hide();
            $("input:hidden[name='refundFromDispYn']").val('N');  //환불계좌 등록 표시 여부
        } else if(gb == '03'){	//실시간계좌이체시
            $("#btn_kcp"    ).show();
            $("#credit_info").show();

            $("#formEscrow" ).show();

            $("#external_paytype").hide();
            $("#btn_external"    ).hide();

            $("#btn_ars").hide();
            $("#kakao_info").hide();
            $("#btn_kakao" ).hide();

            $(".refundInfoForm").hide();
            $("input:hidden[name='refundFromDispYn']").val('N');  //환불계좌 등록 표시 여부
        } else if(gb == '04'){	//무통장입금시
            $("#btn_kcp"    ).show();
            $("#credit_info").show();

            $("#formEscrow" ).show();

            $("#external_paytype").hide();
            $("#btn_external"    ).hide();

            $("#btn_ars").hide();
            $("#kakao_info").hide();
            $("#btn_kakao" ).hide();

            $(".refundInfoForm").show();
            $("input:hidden[name='refundFromDispYn']").val('Y');  //환불계좌 등록 표시 여부
        } else if(gb == '05'){	//휴대폰결제시
            $("#btn_kcp"    ).show();
            $("#credit_info").show();

            $("#formEscrow" ).hide();
            $("#btn_ars").hide();

            $("#external_paytype").hide();
            $("#btn_external"    ).hide();

            $("#kakao_info").hide();
            $("#btn_kakao" ).hide();
            $("input:checkbox[name='Escorw_yn']").prop('checked', false);		//에스크로 여부 초기화
            $("input:checkbox[name='Escorw_yn']").val('N');

            $(".refundInfoForm").hide();
            $("input:hidden[name='refundFromDispYn']").val('N');  //환불계좌 등록 표시 여부
        } else if(gb == '06'){
            $("#external_paytype").show();
            $("#btn_external").show();
            $("#credit_info").show();
            $("#kakao_info").hide();
            $("#formEscrow").hide();
            $("#btn_kcp").hide();
            $("#btn_kakao").hide();
            $("#btn_ars").hide();
            $("input:checkbox[name='Escorw_yn']").prop('checked', false);		//에스크로 여부 초기화
            $("input:checkbox[name='Escorw_yn']").val('N');
        } else if(gb == '07'){ //카카오페이시
            $("#btn_kakao" ).show();
            $("#kakao_info").show();

            $("#formEscrow").hide();

            $("#external_paytype").hide();
            $("#btn_external"    ).hide();

            $("#btn_ars").hide();
            $("#btn_kcp"    ).hide();
            $("#credit_info").hide();
            $("input:checkbox[name='Escorw_yn']").prop('checked', false);		//에스크로 여부 초기화
            $("input:checkbox[name='Escorw_yn']").val('N');

            $(".refundInfoForm").hide();
            $("input:hidden[name='refundFromDispYn']").val('N');  //환불계좌 등록 표시 여부
        } else if(gb == '08'){	//ARS 결제시
            //ARS 버튼 show
            $("#btn_ars").show();

            $("#btn_kakao").hide();
            $("#kakao_info").hide();

            $("#credit_info").show();
            $("#formEscrow").hide();

            $("#external_paytype").hide();
            $("#btn_external").hide();

            $("#btn_kcp").hide();
            $("input:checkbox[name='Escorw_yn']").prop('checked', false);		//에스크로 여부 초기화
            $("input:checkbox[name='Escorw_yn']").val('N');

            $(".refundInfoForm").hide();
            $("input:hidden[name='refundFromDispYn']").val('N');  //환불계좌 등록 표시 여부
        }

    }



    /*************************************/
    /***** 에스크로 체크 여부 ************/
    /*************************************/
    $(function(){
        $("input:checkbox[name='Escorw_yn']").on('click', function(e) {
            if($("input:checkbox[name='Escorw_yn']").is(":checked") == true){
                $("#Escorw_yn").attr('value', 'Y');
                $("#pay_mod").val('Y');
            } else {
                $("#Escorw_yn").attr('value', 'N');
                $("#pay_mod").val('N');
            }
        })
    });


    //===============================================================
    // 시/군/구 리스트 불러오기
    //===============================================================
    function jsFindGungu(sido, idx){
        //콤보박스 초기화
        initCombo("formPostalSearch"+idx+"02", "선택");
        if(idx == '01' || idx == '03'){
            $("#formPostalSearch"+idx+"03").val('');
        } else if (idx == '02'){
            $("#formPostalSearch"+idx+"03").val('');
            $("#formPostalSearch"+idx+"04").val('');
        }

        $.ajax({
            type: 'POST',
            url: '/cart/get_post_sigungu',
            dataType: 'json',
            data: { sido : sido },
            error: function(res) {
                alert('Database Error');
            },
            success: function(res) {
                if(res.status == 'ok'){
                    for (var i=0; i < res.sigungu_list.length; i++){
                        if(res.sigungu_list[i]['SIGUNGU'] != null){
                            var option		= document.createElement("option");
                            option.value	= res.sigungu_list[i]['SIGUNGU'];
                            option.text		= res.sigungu_list[i]['SIGUNGU'];

                            document.getElementById("formPostalSearch"+idx+"02").appendChild(option);
                        } else {
                            //콤보박스 초기화
                            initCombo("formPostalSearch"+idx+"02", "전체");
                            document.getElementById("formPostalSearch"+idx+"02")[0].value = 'N/A';
                        }
                    }
                }
                else alert(res.message);
            }
        });
    }


    //===============================================================
    // 배송지 초기화
    //===============================================================
    function jsAddrReset(gb){
        var receive_name	= "<?=$RECEIVER_NM?>";
        var receive_zipcode	= "<?=$RECEIVER_ZIPCODE?>";
        var receive_zipcode_text = "<?=$RECEIVER_ZIPCODE?>";

        if(receive_zipcode.length == 6){
            var receive_zipcode_text = receive_zipcode.substr(0,3)+"-"+receive_zipcode.substr(3,3);
        }

        var receive_addr1	= "<?=$RECEIVER_ADDR1?>";
        var receive_addr2	= "<?=$RECEIVER_ADDR2?>";
        var receive_phone	= "<?=$RECEIVER_PHONE_NO?>";
        var receive_phone_1 = receive_phone.split("-")[0];
        var receive_phone_2 = receive_phone.split("-")[1];
        var receive_phone_3 = receive_phone.split("-")[2];
        var receive_mob		= "<?=$RECEIVER_MOB_NO?>";
        var receive_mob_1 = receive_mob.split("-")[0];
        var receive_mob_2 = receive_mob.split("-")[1];
        var receive_mob_3 = receive_mob.split("-")[2];

        if(gb == 'A'){	//최근 배송지
            $("input[name=order_recipient]").val(receive_name);		//받으시는분
            $("input[name=order_postnum_text]").val(receive_zipcode_text);	//우편번호
            $("input[name=order_postnum]").val(receive_zipcode);	//우편번호(값초기화)
            $("input[name=order_addr1_text]").val(receive_addr1);	//기본주소
            $("input[name=order_addr1]").val(receive_addr1);		//기본주소(값초기화)
            $("input[name=order_addr2]").val(receive_addr2);		//상세주소
            $("select[name=order_mobile1]").val(receive_mob_1);		//핸드폰번호
            $("input[name=order_mobile2]").val(receive_mob_2);
            $("input[name=order_mobile3]").val(receive_mob_3);
            $("select[name=order_phone1]").val(receive_phone_1);		//전화번호
            $("input[name=order_phone2]").val(receive_phone_2);
            $("input[name=order_phone3]").val(receive_phone_3);
            $("input[name=order_requst]").val('');			//요청사항

            jsDeliveryAmt(receive_zipcode);
        } else if (gb == 'B'){	//새로운 배송지
            $("input[name=order_recipient]").val('');		//받으시는분
            $("input[name=order_postnum_text]").val('');	//우편번호
            $("input[name=order_postnum]").val('');			//우편번호(값초기화)
            $("input[name=order_addr1_text]").val('');		//기본주소
            $("input[name=order_addr1]").val('');			//기본주소(값초기화)
            $("input[name=order_addr2]").val('');			//상세주소
            $("select[name=order_mobile1]").val('');		//핸드폰번호
            $("input[name=order_mobile2]").val('');
            $("input[name=order_mobile3]").val('');
            $("select[name=order_phone1]").val('');			//전화번호
            $("input[name=order_phone2]").val('');
            $("input[name=order_phone3]").val('');
            $("input[name=order_requst]").val('');			//요청사항

            $('span[name=no_deliv_text]').text("");
            $('input[name=deliv_yn]').val("Y");
        }
    }

    //===============================================================
    // 우편번호 검색
    //===============================================================
    function jsPostnum(gb){
        if(gb == '01'){
            var sido	= $("#formPostalSearch0101").val();
            var sigungu = $("#formPostalSearch0102").val();
            var dong	= $("#formPostalSearch0103").val();

            if(sido == ''){
                alert("시/도를 선택해주세요.");
                $("#formPostalSearch0101").focus();
                return false;
            }

            if(sigungu == ''){
                alert("시/군/구를 선택해주세요.");
                $("#formPostalSearch0102").focus();
                return false;
            }

            if(dong == ''){
                alert("동(읍/면)을 입력해주세요.");
                $("#formPostalSearch0103").focus();
                return false;
            }

            $('#loading').show();

            $.ajax({
                type: 'POST',
                url: '/cart/get_postnum',
                dataType: 'json',
                data: { sido : sido, sigungu : sigungu, dong : dong, gb : gb },
                error: function(res) {
                    alert('Database Error');
                },
                success: function(res) {
                    if(res.status == 'ok'){
                        $('#loading').hide();

                        if(res.old_addr_cnt == 0){
                            $('ul[name=postalCodeCont01]').html('<center>검색된 주소가 없습니다.</center>');	//지번주소
                        } else {
                            //검색결과 붙여넣기
                            $('span[name=old_addr_cnt]').text('('+res.old_addr_cnt+')');
                            $('ul[name=postalCodeCont01]').html(res.old_addr);	//지번주소
                        }
                    }
                    else alert(res.message);
                }
            })
        } else if(gb == '02'){
            var sido		= $("#formPostalSearch0201").val();
            var sigungu		= $("#formPostalSearch0202").val();
            var road_name	= $("#formPostalSearch0203").val();
            var road_no		= $("#formPostalSearch0204").val();

            if(sido == ''){
                alert("시/도를 선택해주세요.");
                $("#formPostalSearch0201").focus();
                return false;
            }

            if(sigungu == ''){
                alert("시/군/구를 선택해주세요.");
                $("#formPostalSearch0202").focus();
                return false;
            }

            if(road_name == ''){
                alert("도로명을 입력해주세요.");
                $("#formPostalSearch0203").focus();
                return false;
            }

            if(road_no == ''){
                alert("건물번호를 입력해주세요.");
                $("#formPostalSearch0204").focus();
                return false;
            }

            $('#loading').show();

            $.ajax({
                type: 'POST',
                url: '/cart/get_postnum',
                dataType: 'json',
                data: { sido : sido, sigungu : sigungu, road_name : road_name, road_no : road_no, gb : gb },
                error: function(res) {
                    alert('Database Error');
                },
                success: function(res) {
                    if(res.status == 'ok'){
                        $('#loading').hide();

                        if(res.new_addr_cnt == 0){
                            $('ul[name=postalCodeCont01]').html('<center>검색된 주소가 없습니다.</center>');	//지번주소
                        } else {
                            //검색결과 붙여넣기
                            $('span[name=new_addr_cnt]').text('('+res.new_addr_cnt+')');
                            $('ul[name=postalCodeCont01]').html(res.new_addr);	//지번주소
                        }
                    }
                    else alert(res.message);
                }
            })
        } else if(gb == '03'){
            var sido			= $("#formPostalSearch0301").val();
            var sigungu			= $("#formPostalSearch0302").val();
            var building_name	= $("#formPostalSearch0303").val();

            if(sido == ''){
                alert("시/도를 선택해주세요.");
                $("#formPostalSearch0301").focus();
                return false;
            }

            if(sigungu == ''){
                alert("시/군/구를 선택해주세요.");
                $("#formPostalSearch0302").focus();
                return false;
            }

            if(building_name == ''){
                alert("건물명(아파트명)을 입력해주세요.");
                $("#formPostalSearch0303").focus();
                return false;
            }

            $('#loading').show();

            $.ajax({
                type: 'POST',
                url: '/cart/get_postnum',
                dataType: 'json',
                data: { sido : sido, sigungu : sigungu, building_name : building_name, gb : gb },
                error: function(res) {
                    alert('Database Error');
                },
                success: function(res) {
                    if(res.status == 'ok'){
                        $('#loading').hide();

                        if(res.new_addr_cnt == 0){
                            $('ul[name=postalCodeCont01]').html('<center>검색된 주소가 없습니다.</center>');	//지번주소
                        } else {
                            //검색결과 붙여넣기
                            $('span[name=new_addr_cnt]').text('('+res.new_addr_cnt+')');
                            $('ul[name=postalCodeCont01]').html(res.new_addr);	//지번주소
                        }
                    }
                    else alert(res.message);
                }
            })
        }
    }

    /****************************************/
    /********* 주소 클릭시 붙여넣기 *********/
    /****************************************/
    function jsPastepost(gubun, idx){

        if(gubun == '1'){	//지번주소
            $('input[name=order_postnum_text]').val($($("input[name='addr_post1[]']").get(idx)).val());
            $('input[name=order_addr1_text]').val($($("input[name='addr_v1[]']").get(idx)).val());
            $('input[name=order_addr1]').val($($("input[name='addr_v1[]']").get(idx)).val());

            var postnum = $($("input[name='addr_post1[]']").get(idx)).val();

            if($($("input[name='addr_post1[]']").get(idx)).val().length == '7'){	//우편번호 6자리일경우 '-'표시 제거
                postnum = $($("input[name='addr_post1[]']").get(idx)).val().split("-")[0] + $($("input[name='addr_post1[]']").get(idx)).val().split("-")[1];
            }

            $('input[name=order_postnum]').val(postnum);	//우편번호 히든값 넣기

            jsDeliveryAmt(postnum);

            //레이어 닫기
            $('#layer__postal_code_search_01').removeClass();
            $('#layer__postal_code_search_01').addClass('layer layer__postal_code_search');
            $('#layer_address_list').removeClass();
            $('#layer_address_list').addClass('layer layer_address_list');

        } else if(gubun == '2'){	//도로명주소
            $('input[name=order_postnum_text]').val($($("input[name='addr_post2[]']").get(idx)).val());
            $('input[name=order_addr1_text]').val($($("input[name='addr_v2[]']").get(idx)).val());
            $('input[name=order_addr1]').val($($("input[name='addr_v2[]']").get(idx)).val());

            var postnum = $($("input[name='addr_post2[]']").get(idx)).val();

            if($($("input[name='addr_post2[]']").get(idx)).val().length == '7'){	//우편번호 6자리일경우 '-'표시 제거
                postnum = $($("input[name='addr_post2[]']").get(idx)).val().split("-")[0] + $($("input[name='addr_post2[]']").get(idx)).val().split("-")[1];
            }

            $('input[name=order_postnum]').val(postnum);	//우편번호 히든값 넣기

            jsDeliveryAmt(postnum);

            //레이어 닫기
            $('#layer__postal_code_search_01').removeClass();
            $('#layer__postal_code_search_01').addClass('layer layer__postal_code_search');
            $('#layer_address_list').removeClass();
            $('#layer_address_list').addClass('layer layer_address_list');
        }

    }

    /****************************************/
    /** 추가배송비 또는 배송 불가지역 재계산*/
    /****************************************/
    function jsDeliveryAmt(postnum){
        var total_add_delivery_price	= 0;	//추가배송비 합
        var total_delivery_price		= 0;	//기존배송비 합
        var total_goods_selling_price	= 0;	//기존 상품금액 합
        var total_goods_discount_price	= 0;	//기존 상품할인금액 합
        var total_goods_add_discount_price = 0; //기존 상품추가할인금액 합
        var use_mileage					= parseInt($("input[name=use_mileage]").val());
        var cart_coupon_price			= parseInt($("input[name=cart_coupon_amt").val());
        var deliv_yn					= "Y";	//배송가능여부
        var group_text					= '';

        for(i=0; i<document.getElementsByName("group_deli_policy_no[]").length; i++){
            var group_deli_policy_no	= document.getElementsByName("group_deli_policy_no[]")[i].value;
            var add_price		= 0;			//지역에 따른 추가배송비

            $.ajax({
                type: 'POST',
                async: false,
                url: '/cart/get_add_delivery',
                dataType: 'json',
                data: { postnum : postnum, deli_policy_no : group_deli_policy_no },
                error: function(res) {
                    alert('Database Error');
                },
                success: function(res) {
                    if(res.status == 'ok'){
                        add_price = res.add_delivery_price;
                    }
                    else{
                        alert(res.message);
                        deliv_yn = 'N';
                    }
                }
            })

            for(j=0; j<document.getElementsByName("goods_code[]").length; j++){
                if(document.getElementsByName("group_deli_policy_no[]")[i].value == document.getElementsByName("goods_deli_policy_no[]")[j].value){
                    if($($("input[name='goods_deli_policy_pattern_type[]']").get(j)).val() == 'NONE'){
                        add_price = 0;
                        break;
                    }
                }
            }

//			$($("input[name='goods_add_delivery_price[]']").get(i)).val(parseInt(add_price));
//			total_add_delivery_price += parseInt($($("input[name='goods_add_delivery_price[]']").get(i)).val());	//추가배송비 합
            $($("input[name='group_add_delivery_price[]']").get(i)).val(parseInt(add_price));
            total_add_delivery_price += parseInt($($("input[name='group_add_delivery_price[]']").get(i)).val());	//추가배송비 합
            total_delivery_price += parseInt($($("input[name='group_delivery_price[]']").get(i)).val());	//기존배송비 합

            if(parseInt(add_price) + parseInt($($("input[name='group_delivery_price[]']").get(i)).val()) != 0){
                $('p[name=delivery_price'+i+']').text(numberFormat(parseInt(add_price) + parseInt($($("input[name='group_delivery_price[]']").get(i)).val()))+"원");		//상품별 추가배송비 계산해서 다시 적용
            } else {
                if(document.getElementsByName("group_text[]")[i].value == 'Y'){
                    group_text = '(묶음)';
                } else {
                    group_text = '';
                }

                $('p[name=delivery_price'+i+']').text("무료배송 "+group_text);

                for(j=0; j<document.getElementsByName("goods_code[]").length; j++){
                    if(document.getElementsByName("group_deli_policy_no[]")[i].value == document.getElementsByName("goods_deli_policy_no[]")[j].value){
                        if($($("input[name='goods_deli_policy_pattern_type[]']").get(j)).val() == 'NONE'){
                            $('p[name=delivery_price'+i+']').text("착불배송");
                            break;
                        }
                    }
                }

            }
        }	//END for

//		for(i=0; i<document.getElementsByName("group_deli_policy_no[]").length; i++){
        for(i=0; i<document.getElementsByName("goods_code[]").length; i++){
            total_goods_selling_price += (parseInt($($("input[name='goods_selling_price[]']").get(i)).val())+parseInt($($("input[name='goods_option_add_price[]']").get(i)).val()))*parseInt($($("input[name='goods_cnt[]']").get(i)).val());		//기존 상품금액 합

            total_goods_discount_price += parseInt($($("input[name='goods_discount_price[]']").get(i)).val())*parseInt($($("input[name='goods_cnt[]']").get(i)).val());		//기존 상품할인금액 합

            total_goods_add_discount_price += parseInt($($("input[name='goods_add_discount_price[]']").get(i)).val());	//기존 상품추가할인금액 합
        }

        $('span[name=total_delivery_price]').text(numberFormat(total_add_delivery_price+total_delivery_price));		//총배송비
        $('span[name=delivery_info]').text(numberFormat(total_delivery_price));
        if(total_add_delivery_price != 0){
            $('span[name=total_add_delivery_price]').html("<span> + "+numberFormat(total_add_delivery_price)+"</span><span class='won'>원(도서산간배송비)</span>");
        } else {
            $('span[name=total_add_delivery_price]').html("");
        }
        //히든값 변경
        $('input[name=total_order_money]').val(total_goods_selling_price);
        $('input[name=total_discount_money]').val(total_goods_discount_price + total_goods_add_discount_price + cart_coupon_price);
        $('input[name=total_delivery_money]').val(total_delivery_price + total_add_delivery_price);
        $('input[name=total_payment_money]').val(total_goods_selling_price - total_goods_discount_price - total_goods_add_discount_price - cart_coupon_price - use_mileage + total_delivery_price + total_add_delivery_price);

        $('span[name=payment_price]').text(numberFormat(total_goods_selling_price - total_goods_discount_price - total_goods_add_discount_price - cart_coupon_price - use_mileage + total_delivery_price + total_add_delivery_price));		//결제예정금액

        $('span[name=finally_payment_price]').text(numberFormat(total_goods_selling_price - total_goods_discount_price - total_goods_add_discount_price - cart_coupon_price - use_mileage + total_delivery_price + total_add_delivery_price));		//결제예정금액

        if(deliv_yn == 'N'){	//배송불가지역이라면
            $('span[name=no_deliv_text]').text("해당 지역에 배송이 불가능한 상품이 있습니다.");
            $('input[name=deliv_yn]').val("N");
        } else {
            $('span[name=no_deliv_text]').text("");
            $('input[name=deliv_yn]').val("Y");
        }
    }

    /****************************************/
    /*************** 주소사용 ***************/
    /****************************************/
    function jsUseaddr(gb){
        if(gb == 'S'){	//주소 검색 적용
            if($('input[name=chk_detailadd]').val() == 'N'){
                alert("상세주소를 입력하여 버튼을 눌러주세요.");
                return false;
            }

            $('input[name=order_postnum_text]').val($('input[name=use_post]').val());
            $('input[name=order_addr1_text]').val($('input[name=use_addr]').val());
            $('input[name=order_addr1]').val($('input[name=use_addr]').val());

            var postnum = $('input[name=use_post]').val();

            if($('input[name=use_post]').val().length == '7'){	//우편번호 6자리일경우 '-'표시 제거
                postnum = $('input[name=use_post]').val().split("-")[0] + $('input[name=use_post]').val().split("-")[1];
            }

            $('input[name=order_postnum]').val(postnum);	//우편번호 히든값 넣기
        } else if(gb == 'C'){	//주소록 적용
            var idx = $(':input:radio[name=address_book]:checked').val();

            $('input[name=order_postnum_text]').val($($("input[name='cust_zipcode[]']").get(idx)).val());
            $('input[name=order_addr1_text]').val($($("input[name='cust_addr1[]']").get(idx)).val());
            $('input[name=order_addr1]').val($($("input[name='cust_addr1[]']").get(idx)).val());
            $('input[name=order_addr2]').val($($("input[name='cust_addr2[]']").get(idx)).val());

            var postnum = $($("input[name='cust_zipcode[]']").get(idx)).val();

            if($($("input[name='cust_zipcode[]']").get(idx)).val().length == '7'){	//우편번호 6자리일경우 '-'표시 제거
                postnum = $($("input[name='cust_zipcode[]']").get(idx)).val().split("-")[0] + $($("input[name='cust_zipcode[]']").get(idx)).val().split("-")[1];
            }

            $('input[name=order_postnum]').val(postnum);	//우편번호 히든값 넣기
        }

        jsDeliveryAmt(postnum);		//추가배송비 또는 배송불가지역 재계산

        $('#layer__postal_code_search_01').removeClass();
        $('#layer__postal_code_search_01').addClass('layer layer__postal_code_search');
        $('#layer_address_list').removeClass();
        $('#layer_address_list').addClass('layer layer_address_list');
    }

    //=======================================
    // 상품옵션체크
    //=======================================
    function jsChkOption()
    {
        var optionCode = new Array();

        var hidOptionCode = document.getElementsByName("goods_option_code[]");

        for(var i=0;i<hidOptionCode.length;i++){
            optionCode[i] = hidOptionCode[i].value;
        }
        $.unique(optionCode);

        if(hidOptionCode.length != optionCode.length) {
            alert("주문하려는 상품의 옵션이 올바르지 않습니다. \n옵션 확인 후 다시 주문부탁드립니다.");
            return false;
        }

        var hidGoodsName = document.getElementsByName("goods_name[]");
        var hidGoodsOptionName = document.getElementsByName("goods_option_name[]");
        var hidGoodsQty = document.getElementsByName("goods_cnt[]");
        var hidOptionQty = document.getElementsByName("goods_option_qty[]");
        var hidBuyLimitQty = document.getElementsByName("goods_buy_limit_qty[]");

        for(var j=0;j<hidGoodsQty.length;j++){
            console.log(parseInt(hidGoodsQty[j].value));

            if(Number(hidBuyLimitQty[j].value) != 0) {
                if(Number(hidGoodsQty[j].value) > Number(hidBuyLimitQty[j].value)) {
                    alert("상품정보 : "+hidGoodsName[j].value+"("+hidGoodsOptionName[j].value+")\n1회 최대 구매수는 "+hidBuyLimitQty[j].value+" 개 입니다. \n상품 수량 수정 후 다시 주문부탁드립니다.\n현재 구매수량 : "+hidGoodsQty[j].value);
                    return false;
                }
            }

            if(Number(hidGoodsQty[j].value) > Number(hidOptionQty[j].value)) {
                alert("상품정보 : "+hidGoodsName[j].value+"("+hidGoodsOptionName[j].value+")\n현재 주문가능한 재고수량은 "+hidOptionQty[j].value+" 개입니다. \n상품 수량 수정 후 다시 주문부탁드립니다.\n현재 구매수량 : "+hidGoodsQty[j].value);
                return false;
            }
        }



        return true;
    }

    //===============================================================
    // validation체크
    //===============================================================
    function jsChkValidation()
    {
        var frm = document.OrderForm;
        var deliv_info = "<?=$DELIV_INFO?>";
        var send_nation_info = "<?=$SEND_NATION_INFO?>";


        if(frm.order_name.value == ""){
            alertDelay("주문하시는 분을 입력해주세요.");
            frm.order_name.focus();
            return false;
        }

        frm.buyername.value = frm.order_name.value;		//주문자 히든값에 넣기

        if(frm.order_recipient.value == ""){
            alertDelay("받으시는 분을 입력해주세요.");
            frm.order_recipient.focus();
            return false;
        }

        if(frm.order_postnum.value == ""){
            alertDelay("우편번호를 입력해주세요.");
            frm.order_postnum.focus();
            return false;
        }

        if(frm.order_addr1.value == ""){
            alertDelay("배송할 기본 주소지를 입력해주세요.");
            frm.order_addr1.focus();
            return false;
        }

        if(frm.order_addr2.value == ""){
            alertDelay("배송할 상세 주소지를 입력해주세요.");
            frm.order_addr2.focus();
            return false;
        }

        if($("input:radio[id='formpay08']").is(":checked")){
            if(frm.sel_comm_id.value == ""){
                alertDelay("통신사를 선택해주세요.");
                frm.sel_comm_id.focus();
                return false;
            }
        }

        if(frm.order_mobile1.value == ""){
            alertDelay("휴대폰 번호를 입력해주세요.");
            frm.order_mobile1.focus();
            return false;
        }

        if(frm.order_mobile2.value == ""){
            alertDelay("휴대폰 번호를 입력해주세요.");
            frm.order_mobile2.focus();
            return false;
        }

        if(frm.order_mobile3.value == ""){
            alertDelay("휴대폰 번호를 입력해주세요.");
            frm.order_mobile3.focus();
            return false;
        }

        if(frm.phone_yn.value == "Y" && frm.order_phone1.value == ""){
            alertDelay("전화번호를 입력해주세요.");
            frm.order_phone1.focus();
            return false;
        }

        if(frm.phone_yn.value == "Y" && frm.order_phone2.value == ""){
            alertDelay("전화번호를 입력해주세요.");
            frm.order_phone2.focus();
            return false;
        }

        if(frm.phone_yn.value == "Y" && frm.order_phone3.value == ""){
            alertDelay("전화번호를 입력해주세요.");
            frm.order_phone3.focus();
            return false;
        }

        if(frm.order_email1.value == ""){
            alertDelay("결제정보를 받을 이메일을 입력해주세요.");
            frm.order_email1.focus();
            return false;
        }

        if(frm.order_email2.value == ""){
            alertDelay("결제정보를 받을 이메일을 입력해주세요.");
            frm.order_email2.focus();
            return false;
        }

        if(deliv_info == 'Y'){
            if(document.getElementById("formShippingAddress0103").value == "N" || document.getElementById("formShippingAddress0203").value == "N" || document.getElementById("formShippingAddress0401").value == "N"){
                alertDelay("가구 배송정보에 동의 확인을 해주세요.");
                document.getElementById("formShippingAddress0103").focus();
                return false;
            }
        }

        if(send_nation_info == 'Y'){
            if((!document.getElementById("formCustomsIdNumber0").checked)){
                alertDelay("통관정보 수집 및 제공에 동의해주세요.");
                return false;
            }
            if((!document.getElementById("formCustomsIdNumber1").checked)){
                alertDelay("개인통관고유부호의 이름과 주문자명, 수취인명이 모두 동일한지 확인해주세요.");
                return false;
            }
            if(frm.orderCustomsNum.value == ''){
                alertDelay("P로 시작하는 개인통관 고유부호를 입력해주세요.");
                return false;
            }
        }

        if(frm.refundFromDispYn.value == 'Y') {
            if(frm.selRefundBank.value == "") {
                alert("주문취소 및 반품 시 환불받으실 은행을 선택해주세요.");
                frm.selRefundBank.focus();
                return false;
            }
            if(frm.txtRefundAccount.value == "") {
                alert("주문취소 및 반품 시 환불받으실 계좌번호를 입력해주세요.");
                frm.txtRefundAccount.focus();
                return false;
            }
            if(frm.txtRefundCust.value == "") {
                alert("주문취소 및 반품 시 환불받으실 예금주명을 입력해주세요.");
                frm.txtRefundCust.focus();
                return false;
            }
        }

        if(!document.getElementById("formAgree").checked){
            alertDelay("구매동의에 동의해주세요.");
            document.getElementById("formAgree").focus();
            return false;
        }

        if($('input[name=deliv_yn]').val() == 'N'){
            alertDelay("주문하려는 주소지에 배송이 불가능한 상품이 있습니다. \n주소를 변경해주세요.");
            frm.order_postnum.focus();
            return false;
        }

        document.OrderForm.order_mobile.value	= frm.order_mobile1.value + "-" + frm.order_mobile2.value + "-" + frm.order_mobile3.value;

        if(frm.order_phone1.value != '' && frm.order_phone2.value != '' && frm.order_phone3.value != ''){
            document.OrderForm.order_phone.value	= frm.order_phone1.value + "-" + frm.order_phone2.value + "-" + frm.order_phone3.value;
        }
        else {
            document.OrderForm.order_phone.value = "";
        }

        var order_email = frm.order_email1.value+'@'+frm.order_email2.value;
        $('input[name=buyeremail]').val(order_email);	//주문자 이메일 히든값에 넣기
        $('input[name=buyertel]').val(document.OrderForm.order_mobile.value);	//주문자 휴대폰 번호 히든값에 넣기
        $('input[name=escrowuse]').val($('input[name=Escorw_yn]').val());//에스크로 여부 히든값에 넣기

        return true;

    }
    //===============================================================
    // 주문 결제하기
    //===============================================================
    //function jsOrderPay(){
    //
    //	var session_no	= "<?//=$this->session->userdata('EMS_U_NO_')?>//";
    //	var session_id	= "<?//=$this->session->userdata('EMS_U_ID_')?>//";
    //
    //	//validation 체크
    //	if(!jsChkValidation()){
    //		return false;
    //	}
    //
    //	if(!(session_no != "" && session_id != 'GUEST' && session_id != 'TMP_GUEST')){
    ////		$('input[name=buyercode]').val('');
    //		$('input[name=buyerid]').val('GUEST');
    //		$('input[name=buyername]').val(document.OrderForm.order_name.value);
    //	}
    //	req_approval();
    ////	test_req_approval();
    //}

    //===============================================================
    // 결제 팝업
    //===============================================================
    //function req_approval()
    //{
    //	// 모바일 체크
    //	var mobileInfo = new Array('Android', 'iPhone', 'iPod', 'BlackBerry', 'Windows CE', 'SAMSUNG', 'LG', 'MOT', 'SonyEricsson'),
    //		checker = false;
    //	for (var info in mobileInfo){
    //		if (navigator.userAgent.match(mobileInfo[info]) != null){
    //			checker = true;
    //		}
    //	}
    //	if( checker ) {
    //		alert("모바일페이지에서는 결제가 되지 않습니다. PC로 접속해주십시오.");
    //		return false;
    //	} else {
    //
    //
    //
    //	var SSL_val = "<?//=$_SERVER['HTTP_HOST']?>//";
    //
    //	if(document.getElementById("formpay01").checked || document.getElementById("formpay03").checked || document.getElementById("formpay04").checked ){
    //
    //		if(document.getElementById("formpay01").checked){    //이니페이:카드
    //			document.OrderForm.order_payment_type.value  = "01";
    //			document.OrderForm.gopaymethod.value     = "card";
    ////			document.OrderForm.paymethod.value       = "onlycard";
    //		} else if(document.getElementById("formpay03").checked){   //이니페이:계좌이체
    //			document.OrderForm.order_payment_type.value  = "03";
    //			document.OrderForm.gopaymethod.value     = "trans";
    ////			document.OrderForm.paymethod.value       = "onlydbank";
    //		} else if(document.getElementById("formpay04").checked){  //이니페이:가상계좌
    //                document.OrderForm.order_payment_type.value  = "02";
    //                document.OrderForm.gopaymethod.value     = "vbank";
    ////                document.OrderForm.paymethod.value       = "onlyvbank";
    //        }
    //
    //
    //		if($("input:checkbox[name='Escorw_yn']").val() == 'Y'){	//에스크로여부 동의했을경우
    //			var escrow_yn	= true;
    //		} else {
    //			var escrow_yn	= false;
    //		}
    //
    //		var order_name	= document.OrderForm.goodname.value;
    //		var pay_method	= document.OrderForm.gopaymethod.value;
    //		var b_email		= $('input[name=buyeremail]').val();
    //		var b_name		= $('input[name=buyername]').val();
    //		var b_tel		= $('input[name=buyertel]').val();
    //		var b_addr		= document.OrderForm.order_addr1.value + document.OrderForm.order_addr2.value;
    //		var b_postcode	= document.OrderForm.order_postnum.value;
    //		var pay_amonut	= $('input[name=total_payment_money]').val();
    //		var nowDate		= "<?//=date('Ymd')+3?>//";
    //
    //
    //		IMP.request_pay({
    //		pg : 'inicis', // version 1.1.0부터 지원.
    //			/*
    //				'kakao':카카오페이,
    //				'inicis':이니시스, 'html5_inicis':이니시스(웹표준결제),
    //				'nice':나이스,
    //				'jtnet':jtnet,
    //				'uplus':LG유플러스,
    //				'danal':다날
    //			*/
    //		pay_method : pay_method, // 'card':신용카드, 'trans':실시간계좌이체, 'vbank':가상계좌, 'phone':휴대폰소액결제
    //		escrow : escrow_yn,
    //		merchant_uid : 'merchant_' + new Date().getTime(),
    //		name : order_name,
    //		amount : pay_amonut,
    //		buyer_email : b_email,
    //		buyer_name : b_name,
    //		buyer_tel : b_tel,
    //		buyer_addr : b_addr,
    //		buyer_postcode : b_postcode,
    //		vbank_due : nowDate
    //	}, function(rsp) {
    //		if ( rsp.success ) {
    //			var msg = '결제가 완료되었습니다.';
    //			msg += '고유ID : ' + rsp.imp_uid;
    //			msg += '상점 거래ID : ' + rsp.merchant_uid;
    //			msg += '결제 금액 : ' + rsp.paid_amount;
    //			msg += '카드 승인번호 : ' + rsp.apply_num;
    //
    //			document.OrderForm.imp_uid.value		= rsp.imp_uid;			//아임포트 결제 고유 UID
    //			document.OrderForm.receipt_url.value	= rsp.receipt_url;		//신용카드 매출전표 확인 URL
    //			document.OrderForm.card_name.value		= rsp.card_name;		//카드사명
    //			document.OrderForm.card_quota.value		= rsp.card_quota;		//카드할부개월
    //			document.OrderForm.vbank_name.value		= rsp.vbank_name;		//가상계좌은행명
    //			document.OrderForm.vbank_num.value		= rsp.vbank_num;		//가상계좌번호
    //			document.OrderForm.vbank_date.value		= rsp.vbank_date;
    //			document.OrderForm.pg_tid.value			= rsp.pg_tid;
    //
    //			var param = $("#OrderForm").serialize();
    //            $.ajax({
    //                type: 'POST',
    //                url: 'https://'+SSL_val+'/order/process',
    //                dataType: 'json',
    //                data: param,
    //                error: function(res) {
    //                    alert('오류가 발생하였습니다.');
    //					alert(res.responseText);
    //                },
    //                success: function(res) {
    //                    if(res.status == 'ok'){
    //						location.href = 'https://'+SSL_val+'/cart/Step3_Order_finish?order_no='+res.order_no;
    //                    }
    //                    else alert(res.message);
    //                }
    //            });
    //		} else {
    //			var msg = '결제에 실패하였습니다.';
    //			msg += '에러내용 : ' + rsp.error_msg;
    //		}
    //	});
    //
    //
    //
    //
    //return false;
    //
    ////		}	///1-if
    //    }
    //
    //	}	//mobile if
    //}

    //자동으로 최근배송지 선택
    jsAddrReset('A');


    /****************************************************************/
    /* m_Completepayment  설명                                      */
    /****************************************************************/
    /* 인증완료시 재귀 함수                                         */
    /* 해당 함수명은 절대 변경하면 안됩니다.                        */
    /* 해당 함수의 위치는 payplus.js 보다먼저 선언되어여 합니다.    */
    /* Web 방식의 경우 리턴 값이 form 으로 넘어옴                   */
    /* EXE 방식의 경우 리턴 값이 json 으로 넘어옴                   */
    /****************************************************************/
    function m_Completepayment( FormOrJson, closeEvent )
    {
        var frm = document.order_info;

        /********************************************************************/
        /* FormOrJson은 가맹점 임의 활용 금지                               */
        /* frm 값에 FormOrJson 값이 설정 됨 frm 값으로 활용 하셔야 됩니다.  */
        /* FormOrJson 값을 활용 하시려면 기술지원팀으로 문의바랍니다.       */
        /********************************************************************/
        GetField( frm, FormOrJson );


        if( frm.res_cd.value == "0000" )
        {
            //alert("결제 승인 요청 전,\n\n반드시 결제창에서 고객님이 결제 인증 완료 후\n\n리턴 받은 ordr_chk 와 업체 측 주문정보를\n\n다시 한번 검증 후 결제 승인 요청하시기 바랍니다."); //업체 연동 시 필수 확인 사항.
            /*
			가맹점 리턴값 처리 영역
		*/
            var ordIdx = frm.ordr_idxx.value;
            var ordr_chk = frm.ordr_chk.value;
            var SSL_val = "<?=$_SERVER['HTTP_HOST']?>";

            if(ordIdx.match(ordr_chk)){

                var pay_method		= frm.pay_method.value;
                var ordr_idxx		= frm.ordr_idxx.value;
                var good_name		= frm.good_name.value;
                var good_mny		= frm.good_mny.value;
                var buyr_name		= frm.buyr_name.value;

                var buyr_mail		= frm.buyr_mail.value;
                var buyr_tel1		= frm.buyr_tel1.value;
                var buyr_tel2		= frm.buyr_tel2.value;
                var req_tx			= frm.req_tx.value;
                var site_cd			= frm.site_cd.value;

                var site_name		= frm.site_name.value;
                var quotaopt		= frm.quotaopt.value;
                var currency		= frm.currency.value;
                var module_type		= frm.module_type.value;
                var res_cd			= frm.res_cd.value;

                var res_msg			= frm.res_msg.value;
                var enc_info		= frm.enc_info.value;
                var enc_data		= frm.enc_data.value;
                var ret_pay_method	= frm.ret_pay_method.value;
                var tran_cd			= frm.tran_cd.value;
                var use_pay_method	= frm.use_pay_method.value;

                var good_expr		= frm.good_expr.value;
                var kcp_noint		= frm.kcp_noint.value;
                var escw_used		= frm.escw_used.value;
                var pay_mod			= frm.pay_mod.value;
                var deli_term		= frm.deli_term.value;

                var bask_cntx		= frm.bask_cntx.value;
                var good_info		= frm.good_info.value;
                var rcvr_name		= frm.rcvr_name.value;
                var rcvr_tel1		= frm.rcvr_tel1.value;
                var rcvr_tel2		= frm.rcvr_tel2.value;

                var rcvr_mail		= frm.rcvr_mail.value;
                var rcvr_zipx		= frm.rcvr_zipx.value;
                var rcvr_add1		= frm.rcvr_add1.value;
                var rcvr_add2		= frm.rcvr_add2.value;
                var kcp_data       = frm.kcp_log_data.value;

                $.ajax({
                    type: 'POST',
                    url: 'https://'+SSL_val+'/order/kcpCli',
                    data: {'pay_method':pay_method, 'ordr_idxx':ordr_idxx, 'good_name':good_name, 'good_mny':good_mny, 'buyr_name':buyr_name,
                        'buyr_mail':buyr_mail, 'buyr_tel1':buyr_tel1, 'buyr_tel2':buyr_tel2, 'req_tx':req_tx, 'site_cd':site_cd,
                        'site_name':site_name, 'quotaopt':quotaopt, 'currency':currency, 'module_type':module_type, 'res_cd':res_cd,
                        'res_msg':res_msg, 'enc_info':enc_info, 'enc_data':enc_data, 'ret_pay_method':ret_pay_method, 'tran_cd':tran_cd,
                        'good_expr':good_expr, 'kcp_noint':kcp_noint, 'escw_used':escw_used, 'pay_mod':pay_mod, 'deli_term':deli_term,
                        'bask_cntx':bask_cntx, 'good_info':good_info, 'rcvr_name':rcvr_name, 'rcvr_tel1':rcvr_tel1, 'rcvr_tel2':rcvr_tel2,
                        'rcvr_mail':rcvr_mail, 'rcvr_zipx':rcvr_zipx, 'rcvr_add1':rcvr_add1, 'rcvr_add2':rcvr_add2, 'use_pay_method': use_pay_method, 'kcp_log_data':kcp_data},
                    error: function(request,status,error) {
                        alert('오류가 발생하였습니다.');
                        alert("code:"+request.status+"\n"+"message:"+request.responseText+"\n"+"error:"+error);
                    },
                    success: function(res) {
                        // alert(res.res_cd);
                        if(res.res_cd == '0000'){
                            //kcp결제 통신 완료
                            document.OrderForm.imp_uid.value		= res.tno;				//kcp 결제 고유 UID
                            document.OrderForm.receipt_url.value	= "https://admin8.kcp.co.kr/assist/bill.BillActionNew.do?cmd=card_bill&tno="+res.tno;		//신용카드 매출전표 확인 URL
                            document.OrderForm.card_name.value		= res.card_name;		//카드사명
                            document.OrderForm.card_quota.value		= res.card_quota;		//카드할부개월
                            document.OrderForm.vbank_name.value		= res.vbank_name;		//가상계좌은행명
                            document.OrderForm.vbank_num.value		= res.vbank_num;		//가상계좌번호
                            document.OrderForm.vbank_date.value		= res.vbank_date;
                            document.OrderForm.tel_code.value		= res.tel_code;		//휴대폰 결제 통신사
                            document.OrderForm.mob_no.value		    = res.mob_no;       //휴대폰 결제 번호
                            document.OrderForm.pg_tid.value			= res.pg_tid;
                            document.OrderForm.kcp_temp_data.value  = res.kcp_log_data;
                            req_ord_succ();
                        }else{
                            alert('결제에 실패 하였습니다 \n'+res.message);
                        }
                    }
                });

                closeEvent();
            }else{
                alert("결제에 실패했습니다");
                closeEvent();
            }
        }
        else
        {
            alert( "[" + frm.res_cd.value + "] " + frm.res_msg.value );
            closeEvent();
        }
    }

    function req_ord_succ(){
        var SSL_val = "<?=$_SERVER['HTTP_HOST']?>";
        var param = $("#OrderForm").serialize();

        $.ajax({
            type: 'POST',
            url: 'https://'+SSL_val+'/order/process',
            dataType: 'json',
            data: param,
            error: function(res) {
                alert('오류가 발생하였습니다.');
                alert(res.responseText);
            },
            success: function(res) {
                if(res.status == 'ok'){
                    location.href = 'https://'+SSL_val+'/cart/Step3_Order_finish?order_no='+res.order_no;
                }
                else alert(res.message);
            }
        });
    }

</script>
<?
/* ============================================================================== */
/* =  KCP Javascript source Include                                             = */
/* = -------------------------------------------------------------------------- = */
/* =   ※ 필수                                                                   = */
/* =   테스트 및 실결제 연동시 site_conf_inc.php파일을 수정하시기 바랍니다.     = */
/* = -------------------------------------------------------------------------- = */
?>
<script type="text/javascript" src='<?=$g_conf_js_url?>'></script>
<?
/* = -------------------------------------------------------------------------- = */
/* =   KCP Javascript source Include END                                        = */
/* ============================================================================== */
?>

<script type="text/javascript">
    //===============================================================
    // KCP  결제하기
    //===============================================================
    function jsOrderPayKCP(){

        if(document.order_info.good_mny.value == 0) {   //전액 마일리지 결제
            var session_no	= "<?=$this->session->userdata('EMS_U_NO_')?>";
            var session_id	= "<?=$this->session->userdata('EMS_U_ID_')?>";

            var browser_info = navigator.userAgent;
            document.OrderForm.browser_info.value = browser_info;

            //상품옵션체크
            if(!jsChkOption()){
                return false;
            }

            //validation 체크
            if(!jsChkValidation()){
                return false;
            }

            //금액 재계산
            total_sum_price();

            if(!(session_no != "" && session_id != 'GUEST' && session_id != 'TMP_GUEST')){
//		$('input[name=buyercode]').val('');
                $('input[name=buyerid]').val('GUEST');
                $('input[name=buyername]').val(document.OrderForm.order_name.value);
            }

            document.OrderForm.order_payment_type.value  = "04";
            document.OrderForm.gopaymethod.value     = "mileage";

            var param = $("#OrderForm").serialize();

            $.ajax({
                type: 'POST',
                url: '/order/process_temp',
                dataType: 'json',
                data: param,
                error: function(res) {
                    alert('결제에 실패했습니다.');
                    //alert(res.responseText)
                },
                success: function(res) {
                    if(res.status == 'ok'){
                        req_ord_succ();
                    }
                    else alert(res.message);
                }
            });
        } else {
            var session_no	= "<?=$this->session->userdata('EMS_U_NO_')?>";
            var session_id	= "<?=$this->session->userdata('EMS_U_ID_')?>";


            var browser_info = navigator.userAgent;
            document.OrderForm.browser_info.value = browser_info;

            //상품옵션체크
            if(!jsChkOption()){
                return false;
            }

            //validation 체크
            if(!jsChkValidation()){
                return false;
            }

            //금액 재계산
            total_sum_price();

            if(!(session_no != "" && session_id != 'GUEST' && session_id != 'TMP_GUEST')){
//		$('input[name=buyercode]').val('');
                $('input[name=buyerid]').val('GUEST');
                $('input[name=buyername]').val(document.OrderForm.order_name.value);
            }

            var form = document.order_info;
            var today = new Date();
            var year  = today.getFullYear();
            var month = today.getMonth() + 1;
            var date  = today.getDate();
            var time  = today.getTime();

            if(parseInt(month) < 10) {
                month = "0" + month;
            }

            if(parseInt(date) < 10) {
                date = "0" + date;
            }
            var order_idxx = "ETAH" + year + "" + month + "" + date + "" + time;

            var pay_method = "";
            if(document.getElementById("formpay01").checked){
                pay_method = "100000000000";
                document.OrderForm.order_payment_type.value  = "01";
                document.OrderForm.gopaymethod.value     = "card";
            }else if(document.getElementById("formpay03").checked){
                pay_method = "010000000000";
                document.OrderForm.order_payment_type.value  = "03";
                document.OrderForm.gopaymethod.value     = "trans";
            }else if(document.getElementById("formpay04").checked){
                pay_method = "001000000000";
                document.OrderForm.order_payment_type.value  = "02";
                document.OrderForm.gopaymethod.value     = "vbank";
            }else if(document.getElementById("formpay05").checked){
                pay_method = "000010000000";
                document.OrderForm.order_payment_type.value  = "05";
                document.OrderForm.gopaymethod.value     = "phone";
            }else{
                pay_method = "100000000000";
                document.OrderForm.order_payment_type.value  = "01";
                document.OrderForm.gopaymethod.value     = "card";
            }

            var order_email = document.OrderForm.order_email1.value+'@'+document.OrderForm.order_email2.value;

            var buyr_tel1	= document.OrderForm.order_mobile1.value + "-" + document.OrderForm.order_mobile2.value + "-" + document.OrderForm.order_mobile3.value;

            if(document.OrderForm.order_phone1.value != '' && document.OrderForm.order_phone2.value != '' && document.OrderForm.order_phone3.value != ''){
                var buyr_tel2	= document.OrderForm.order_phone1.value + "-" + document.OrderForm.order_phone2.value + "-" + document.OrderForm.order_phone3.value;
            }
            else {
                var buyr_tel2 = "";
            }

            document.order_info.ordr_idxx.value = order_idxx;
            document.order_info.pay_method.value = pay_method;
            document.order_info.buyr_name.value = document.OrderForm.order_name.value;
            document.order_info.buyr_mail.value = order_email;
            document.order_info.buyr_tel1.value = buyr_tel1;
            document.order_info.buyr_tel2.value = buyr_tel2;

            //에스크로 정보
            document.order_info.rcvr_name.value = document.OrderForm.order_name.value;
            document.order_info.rcvr_mail.value = order_email;
            document.order_info.rcvr_tel1.value = buyr_tel1;
            document.order_info.rcvr_tel2.value = buyr_tel2;
            document.order_info.rcvr_zipx.value = document.OrderForm.order_postnum_text.value;
            document.order_info.rcvr_add1.value = document.OrderForm.order_addr1_text.value;
            document.order_info.rcvr_add2.value = document.OrderForm.order_addr2.value;

            var param = $("#OrderForm").serialize();
            $.ajax({
                type: 'POST',
                url: '/order/process_temp',
                dataType: 'json',
                data: param,
                error: function(res) {
                    alert('결제에 실패했습니다.');
                    //alert(res.responseText)
                },
                success: function(res) {
                    if(res.status == 'ok'){
                        document.order_info.kcp_log_data.value = res.order_no;

                        try
                        {
                            KCP_Pay_Execute( form );
                        }
                        catch (e)
                        {
                            /* IE 에서 결제 정상종료시 throw로 스크립트 종료 */
                        }
                    }
                    else alert(res.message);
                }
            });
        }

    }

    /*에스크로 결제시 필요한 장바구니 샘플예제 입니다.*/
    function create_goodInfo()
    {
        var chr30 = String.fromCharCode(30);	// ASCII 코드값 30
        var chr31 = String.fromCharCode(31);	// ASCII 코드값 31

        var good_info = "seq=1" + chr31 + "ordr_numb=20060310_0001" + chr31 + "good_name=양말" + chr31 + "good_cntx=2" + chr31 + "good_amtx=1000" + chr30 +
            "seq=2" + chr31 + "ordr_numb=20060310_0002" + chr31 + "good_name=신발" + chr31 + "good_cntx=1" + chr31 + "good_amtx=1500" + chr30 +
            "seq=3" + chr31 + "ordr_numb=20060310_0003" + chr31 + "good_name=바지" + chr31 + "good_cntx=1" + chr31 + "good_amtx=1000";

        document.order_info.good_info.value = good_info;
    }

    //===============================================================
    // 카카오페이 추가
    // 2018.05.08
    //===============================================================
    function jsOrderPaykakao(){
        if(document.order_info.good_mny.value == 0) {   //전액 마일리지 결제
            var session_no	= "<?=$this->session->userdata('EMS_U_NO_')?>";
            var session_id	= "<?=$this->session->userdata('EMS_U_ID_')?>";

            var browser_info = navigator.userAgent;
            document.OrderForm.browser_info.value = browser_info;

            //상품옵션체크
            if(!jsChkOption()){
                return false;
            }

            //validation 체크
            if(!jsChkValidation()){
                return false;
            }

            //금액 재계산
            total_sum_price();

            if(!(session_no != "" && session_id != 'GUEST' && session_id != 'TMP_GUEST')){
//		$('input[name=buyercode]').val('');
                $('input[name=buyerid]').val('GUEST');
                $('input[name=buyername]').val(document.OrderForm.order_name.value);
            }

            document.OrderForm.order_payment_type.value  = "04";
            document.OrderForm.gopaymethod.value     = "mileage";

            var param = $("#OrderForm").serialize();

            $.ajax({
                type: 'POST',
                url: '/order/process_temp',
                dataType: 'json',
                data: param,
                error: function(res) {
                    alert('결제에 실패했습니다.');
                    //alert(res.responseText)
                },
                success: function(res) {
                    if(res.status == 'ok'){
                        req_ord_succ();
                    }
                    else alert(res.message);
                }
            });
        } else {
            var session_no	= "<?=$this->session->userdata('EMS_U_NO_')?>";
            var session_id	= "<?=$this->session->userdata('EMS_U_ID_')?>";

            var browser_info = navigator.userAgent;
            document.OrderForm.browser_info.value = browser_info;

            //상품옵션체크
            if(!jsChkOption()){
                return false;
            }

            //validation 체크
            if(!jsChkValidation()){
                return false;
            }

            if(!(session_no != "" && session_id != 'GUEST' && session_id != 'TMP_GUEST')){
                $('input[name=buyerid]').val('GUEST');
                $('input[name=buyername]').val(document.OrderForm.order_name.value);
            }

            if(document.getElementById("formpay07").checked){
                document.OrderForm.order_payment_type.value  = "07";
            }
            var param = $("#OrderForm").serialize();

            $.ajax({
                type: 'POST',
                url: '/order/process_temp_kakao',
                dataType: 'json',
                data: param,
                error: function(res) {
                    alert('오류가 발생하였습니다.');
                    alert(res.responseText);
                },
                success: function(res) {
                    if(res.status == 'ok'){
                        var SSL_val = "<?=$_SERVER['HTTP_HOST']?>";
                        window.open("https://"+SSL_val+"/order/kakao_pay?order_no="+res.order_no+"&temp_no="+res.temp_no,"kakao_pay","width=464, height=618, status=yes, resizable=yes, scrollbars=yes,top=0,left=0");
                    }
                    else alert(res.message);
                }
            });
        }
    }

    //===============================================================
    // ARS 결제 추가
    // 2019.07.11
    //===============================================================
    function jsOrderPayARS(){
        if(document.order_info.good_mny.value == 0) {   //전액 마일리지 결제
            var session_no	= "<?=$this->session->userdata('EMS_U_NO_')?>";
            var session_id	= "<?=$this->session->userdata('EMS_U_ID_')?>";

            var browser_info = navigator.userAgent;
            document.OrderForm.browser_info.value = browser_info;

            //상품옵션체크
            if(!jsChkOption()){
                return false;
            }

            //validation 체크
            if(!jsChkValidation()){
                return false;
            }

            //금액 재계산
            total_sum_price();

            if(!(session_no != "" && session_id != 'GUEST' && session_id != 'TMP_GUEST')){
//		$('input[name=buyercode]').val('');
                $('input[name=buyerid]').val('GUEST');
                $('input[name=buyername]').val(document.OrderForm.order_name.value);
            }

            document.OrderForm.order_payment_type.value  = "04";
            document.OrderForm.gopaymethod.value     = "mileage";

            var param = $("#OrderForm").serialize();

            $.ajax({
                type: 'POST',
                url: '/order/process_temp',
                dataType: 'json',
                data: param,
                error: function(res) {
                    alert('결제에 실패했습니다.');
                    //alert(res.responseText)
                },
                success: function(res) {
                    if(res.status == 'ok'){
                        req_ord_succ();
                    }
                    else alert(res.message);
                }
            });
        } else {
            var session_no	= "<?=$this->session->userdata('EMS_U_NO_')?>";
            var session_id	= "<?=$this->session->userdata('EMS_U_ID_')?>";

            var browser_info = navigator.userAgent;
            document.OrderForm.browser_info.value = browser_info;

            //상품옵션체크
            if(!jsChkOption()){
                return false;
            }

            //validation 체크
            if(!jsChkValidation()){
                return false;
            }

            //금액 재계산
            total_sum_price();

            if(!(session_no != "" && session_id != 'GUEST' && session_id != 'TMP_GUEST')){
                $('input[name=buyerid]').val('GUEST');
                $('input[name=buyername]').val(document.OrderForm.order_name.value);
            }

            var form = document.order_info;
            var today = new Date();
            var year  = today.getFullYear();
            var month = today.getMonth() + 1;
            var date  = today.getDate();
            var time  = today.getTime();

            if(parseInt(month) < 10) {
                month = "0" + month;
            }

            if(parseInt(date) < 10) {
                date = "0" + date;
            }
            var order_idxx = "ETAH" + year + "" + month + "" + date + "" + time;

            var pay_method = "VARS";
            document.OrderForm.order_payment_type.value = "08";
            document.OrderForm.gopaymethod.value = "vars";

            var phon_no = document.OrderForm.order_mobile1.value + document.OrderForm.order_mobile2.value + document.OrderForm.order_mobile3.value;

            document.order_info.ordr_idxx.value = order_idxx;
            document.order_info.pay_method.value = pay_method;
            document.order_info.buyr_name.value = document.OrderForm.order_name.value;
            document.order_info.phon_no.value = phon_no;
            document.order_info.comm_id.value = document.OrderForm.sel_comm_id.value;
            document.order_info.cert_flg.value = 'Y';

            var param = $("#OrderForm").serialize();

            $.ajax({
                type: 'POST',
                url: '/order/process_temp',
                dataType: 'json',
                data: param,
                error: function(res) {
                    alert('결제에 실패했습니다.');
                },
                success: function(res) {
                    if(res.status == 'ok'){
                        go_pay_ars();
                    }
                    else alert(res.message);
                }
            });
        }
    }

    function go_pay_ars(){
        var param = $("#order_info").serialize();

        $.ajax({
            type: 'POST',
            url: '/order/process_temp_ars',
            dataType: 'json',
            data: param,
            error: function(res) {
                alert('오류가 발생하였습니다.');
            },
            success: function(res) {
                if(res.res_cd == '0000'){
                    //kcp결제 통신 완료
                    document.OrderForm.vnum_no.value		= res.vnum_no;		//ARS 결제요청 가상 전화번호
                    document.OrderForm.expr_dt.value	    = res.expr_dt;		//ARS 결제 유효기간
                    document.OrderForm.ars_trade_no.value	= res.ars_trade_no;	//ARS 상품 등록번호
                    document.OrderForm.pg_tid.value			= res.pg_tid;

                    req_ord_succ();
                } else{
                    alert('결제에 실패 하였습니다 \n'+res.res_msg);
//                location.href = '/cart/Step3_Order_fail';
                }
            }
        });
    }

    //===============================================================
    // 외부 결제추가
    // 2018.05.08
    // 2019.12.16 /수정
    //===============================================================
    function jsOrderPayExternal(){

        var SSL_val = "<?=$_SERVER['HTTP_HOST']?>";
        var ip = "<?=$_SERVER['HTTP_X_FORWARDED_FOR']?>";

        var session_no	= "<?=$this->session->userdata('EMS_U_NO_')?>";
        var session_id	= "<?=$this->session->userdata('EMS_U_ID_')?>";

        //validation 체크
        if(!jsChkValidation()){
            return false;
        }

        if(!(session_no != "" && session_id != 'GUEST' && session_id != 'TMP_GUEST')){
//		$('input[name=buyercode]').val('');
            $('input[name=buyerid]').val('GUEST');
            $('input[name=buyername]').val(document.OrderForm.order_name.value);
        }

        var param = $("#OrderForm").serialize();

        $.ajax({
            type: 'POST',
            url: 'https://'+SSL_val+'/order/external_pay',
            dataType: 'json',
            data: param,
            error: function(res) {
                alert('오류가 발생하였습니다.');
                alert(res.responseText);
            },
            success: function(res) {
                if(res.status == 'ok'){
                    location.href = 'https://'+SSL_val+'/cart/Step3_Order_finish?order_no='+res.order_no;
                }
                else alert(res.message);
            }
        });
    }
</script>


